-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 21, 2025 at 09:20 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pocket_ai_production_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `feedback`
--

CREATE TABLE `feedback` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `feedback` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_code`
--

CREATE TABLE `password_reset_code` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `otp` varchar(20) DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `status`
--

CREATE TABLE `status` (
  `id` tinyint(4) NOT NULL,
  `status_ar` varchar(100) DEFAULT NULL,
  `status_en` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `status`
--

INSERT INTO `status` (`id`, `status_ar`, `status_en`, `created_at`, `updated_at`) VALUES
(1, 'مفعل', 'active', '2025-06-20 18:18:34', '2025-06-20 18:18:34'),
(2, 'غير مفعل', 'inactive', '2025-06-20 18:19:07', '2025-06-20 18:19:07'),
(3, 'موقوف', 'suspended', '2025-06-20 18:19:58', '2025-06-20 18:19:58'),
(4, 'محذوف', 'deleted', '2025-11-09 16:59:05', '2025-11-09 18:46:30');

-- --------------------------------------------------------

--
-- Table structure for table `transaction`
--

CREATE TABLE `transaction` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` enum('income','expense') NOT NULL,
  `insertion_type` enum('voice','manual') NOT NULL DEFAULT 'manual',
  `amount` decimal(10,2) NOT NULL,
  `category` varchar(100) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `duration` decimal(6,2) DEFAULT NULL,
  `updates_count` int(11) NOT NULL DEFAULT 0,
  `is_deleted` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `activated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `transaction`
--

INSERT INTO `transaction` (`id`, `user_id`, `type`, `insertion_type`, `amount`, `category`, `description`, `duration`, `updates_count`, `is_deleted`, `created_at`, `activated_at`, `updated_at`, `deleted_at`) VALUES
(1, 156, 'expense', 'manual', 44.00, 'cbxb', NULL, NULL, 0, 0, '2025-11-16 06:31:21', '2025-11-16 06:31:21', '2025-11-16 06:31:21', NULL),
(2, 156, 'income', 'manual', 55.00, NULL, NULL, NULL, 0, 0, '2025-11-16 06:31:38', '2025-11-16 06:31:35', '2025-11-16 06:31:38', NULL),
(3, 164, 'expense', 'voice', 5.00, 'بطاطس', '‏خمسة جنيه بطاطس', 3.00, 0, 0, '2025-11-17 17:50:02', '2025-11-17 17:50:02', '2025-11-25 19:50:20', NULL),
(7, 165, 'expense', 'voice', 110.00, 'فاكهة', '‏جبت بعشرة 110 جنيه فاكهة وتسعين جنيه شوكولاتة', 15.00, 0, 0, '2025-11-17 17:52:46', '2025-11-17 17:52:46', '2025-11-25 19:50:20', NULL),
(8, 165, 'expense', 'voice', 90.00, 'شوكولاتة', '‏جبت بعشرة 110 جنيه فاكهة وتسعين جنيه شوكولاتة', 15.00, 0, 0, '2025-11-17 17:52:46', '2025-11-17 17:52:46', '2025-11-25 19:50:20', NULL),
(9, 165, 'expense', 'voice', 10.00, 'مواصلات مداخل', '‏10 جنيه مواصلات مداخل', 25.00, 0, 0, '2025-11-17 17:53:18', '2025-11-17 17:53:18', '2025-11-25 19:50:20', NULL),
(10, 165, 'expense', 'voice', 50.00, 'حواوشي', '‏50 جنيه حواوشي بستين جنيه مويةوب وعشرة جنيه بروتين', 14.00, 0, 0, '2025-11-17 17:53:42', '2025-11-17 17:53:42', '2025-11-25 19:50:20', NULL),
(11, 165, 'expense', 'voice', 60.00, 'مياه', '‏50 جنيه حواوشي بستين جنيه مويةوب وعشرة جنيه بروتين', 14.00, 0, 0, '2025-11-17 17:53:42', '2025-11-17 17:53:42', '2025-11-25 19:50:20', NULL),
(12, 165, 'expense', 'voice', 10.00, 'بروتين', '‏50 جنيه حواوشي بستين جنيه مويةوب وعشرة جنيه بروتين', 14.00, 0, 0, '2025-11-17 17:53:42', '2025-11-17 17:53:42', '2025-11-25 19:50:20', NULL),
(13, 165, 'expense', 'voice', 50.00, 'جيم', '‏50 جنيه جيم وسبع 100 جنيه بروتين وستين جنيه زبدة حلاوة شاح', 21.00, 0, 0, '2025-11-17 17:54:06', '2025-11-17 17:54:06', '2025-11-25 19:50:20', NULL),
(14, 165, 'expense', 'voice', 700.00, 'بروتين', '‏50 جنيه جيم وسبع 100 جنيه بروتين وستين جنيه زبدة حلاوة شاح', 21.00, 0, 0, '2025-11-17 17:54:06', '2025-11-17 17:54:06', '2025-11-25 19:50:20', NULL),
(15, 165, 'expense', 'voice', 60.00, 'زبدة حلاوة طحينية', '‏50 جنيه جيم وسبع 100 جنيه بروتين وستين جنيه زبدة حلاوة شاح', 21.00, 0, 0, '2025-11-17 17:54:06', '2025-11-17 17:54:23', '2025-11-25 19:50:20', NULL),
(16, 165, 'income', 'manual', 10000.00, NULL, NULL, NULL, 0, 0, '2025-11-17 17:57:24', '2025-10-17 00:00:00', '2025-11-17 17:57:24', NULL),
(17, 167, 'income', 'manual', 3500.00, NULL, NULL, NULL, 0, 0, '2025-11-17 18:00:38', '2025-11-17 19:58:35', '2025-11-17 18:00:38', NULL),
(24, 169, 'expense', 'voice', 50.00, 'كفت', '‏50 جنيه كفت', 2.00, 0, 0, '2025-11-17 18:49:09', '2025-11-17 18:49:09', '2025-11-25 19:50:20', NULL),
(25, 169, 'expense', 'voice', 20.00, 'حواوشي', '‏بعشرين جنيه حواوشي', 3.00, 0, 0, '2025-11-17 18:49:18', '2025-11-17 18:49:18', '2025-11-25 19:50:20', NULL),
(26, 169, 'expense', 'voice', 700.00, 'سينما', '‏700 جنيه سينما', 3.00, 0, 0, '2025-11-17 18:49:31', '2025-11-17 18:49:31', '2025-11-25 19:50:20', NULL),
(27, 169, 'expense', 'voice', 3000.00, 'عربية', '‏3000 جنيه عربية', 5.00, 0, 0, '2025-11-17 18:49:50', '2025-11-17 18:49:50', '2025-11-25 19:50:20', NULL),
(28, 169, 'expense', 'voice', 1200.00, 'جمعية', '‏1200 جنيه جمعية', 2.00, 0, 0, '2025-11-17 18:50:05', '2025-11-17 18:50:05', '2025-11-25 19:50:20', NULL),
(29, 169, 'expense', 'voice', 300.00, 'جمعية', '‏300 جنيه جمعية واربع 100 جنيه أكل 60 جنيه 150 جنيه بروتين', 7.00, 0, 0, '2025-11-17 18:50:28', '2025-11-17 18:50:28', '2025-11-25 19:50:20', NULL),
(30, 169, 'expense', 'voice', 400.00, 'أكل', '‏300 جنيه جمعية واربع 100 جنيه أكل 60 جنيه 150 جنيه بروتين', 7.00, 0, 0, '2025-11-17 18:50:28', '2025-11-17 18:50:28', '2025-11-25 19:50:20', NULL),
(31, 169, 'expense', 'voice', 60.00, 'مياه', '‏300 جنيه جمعية واربع 100 جنيه أكل 60 جنيه 150 جنيه بروتين', 7.00, 0, 0, '2025-11-17 18:50:28', '2025-11-17 18:50:46', '2025-11-25 19:50:20', NULL),
(32, 169, 'expense', 'voice', 150.00, 'بروتين', '‏300 جنيه جمعية واربع 100 جنيه أكل 60 جنيه 150 جنيه بروتين', 7.00, 0, 0, '2025-11-17 18:50:28', '2025-11-17 18:50:28', '2025-11-25 19:50:20', NULL),
(33, 170, 'income', 'manual', 30000.00, NULL, NULL, NULL, 0, 0, '2025-11-17 18:52:31', '2025-11-10 00:00:00', '2025-11-17 18:52:31', NULL),
(36, 170, 'income', 'manual', 21000.00, NULL, NULL, NULL, 0, 0, '2025-11-17 18:53:06', '2025-11-15 00:00:00', '2025-11-17 18:53:06', NULL),
(40, 170, 'expense', 'voice', 20.00, 'قهوة', '‏نزلت النهاردة الصبح شربت لي قهوة بعشرين جنيه كنتش شوية ركبت المصطفى بسبعة جنيه ونص بعد كده بخمس 100 جنيه جبت أكل', 14.00, 0, 0, '2025-11-17 19:01:12', '2025-11-17 19:01:12', '2025-11-25 19:50:20', NULL),
(41, 170, 'expense', 'voice', 7.50, 'المصطفى (مواصلات)', '‏نزلت النهاردة الصبح شربت لي قهوة بعشرين جنيه كنتش شوية ركبت المصطفى بسبعة جنيه ونص بعد كده بخمس 100 جنيه جبت أكل', 14.00, 0, 0, '2025-11-17 19:01:12', '2025-11-17 19:01:12', '2025-11-25 19:50:20', NULL),
(42, 170, 'expense', 'voice', 500.00, 'أكل', '‏نزلت النهاردة الصبح شربت لي قهوة بعشرين جنيه كنتش شوية ركبت المصطفى بسبعة جنيه ونص بعد كده بخمس 100 جنيه جبت أكل', 14.00, 0, 0, '2025-11-17 19:01:12', '2025-11-17 19:01:12', '2025-11-25 19:50:20', NULL),
(44, 170, 'expense', 'voice', 350.00, 'برجر', '‏اشتريت برجر 350 جنيه', 3.00, 0, 0, '2025-11-17 19:02:04', '2025-11-17 19:02:04', '2025-11-25 19:50:20', NULL),
(47, 171, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-17 20:38:50', '2025-11-17 20:38:50', '2025-11-17 20:38:50', NULL),
(50, 171, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-17 20:39:13', '2025-11-17 20:39:13', '2025-11-17 20:39:13', NULL),
(51, 171, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-17 20:39:19', '2025-11-17 20:39:19', '2025-11-17 20:39:19', NULL),
(53, 170, 'expense', 'voice', 4.50, 'مواصلات', '‏أربع جنيه ونص مواصلات', 2.00, 0, 0, '2025-11-18 05:10:20', '2025-11-18 05:10:20', '2025-11-25 19:50:20', NULL),
(55, 170, 'expense', 'voice', 52.00, 'مواصلات', '‏52 مواصلات', 2.00, 0, 0, '2025-11-18 06:54:36', '2025-11-18 06:54:36', '2025-11-25 19:50:20', NULL),
(64, 177, 'income', 'manual', 500.00, NULL, NULL, NULL, 0, 0, '2025-11-18 08:23:15', '2025-11-18 00:00:00', '2025-11-18 08:23:15', NULL),
(65, 177, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 08:24:03', '2025-11-18 08:24:03', '2025-11-18 08:24:03', NULL),
(66, 178, 'expense', 'voice', 70.00, 'قهوة', '‏قهوة بسبعين جنيه', 6.00, 0, 0, '2025-11-18 08:35:49', '2025-11-18 08:35:49', '2025-11-25 19:50:20', NULL),
(67, 178, 'expense', 'voice', 35.25, 'شايب', '‏شايب بخمسة وثلاثين وربع', 7.00, 0, 0, '2025-11-18 08:35:58', '2025-11-18 08:35:58', '2025-11-25 19:50:20', NULL),
(68, 178, 'expense', 'voice', 10.00, 'شوكولاتة', '‏اشتريت من السوبر ماركت شوكولاتة بعشرة والشيبس بخمسة 10', 15.00, 0, 0, '2025-11-18 08:36:31', '2025-11-18 08:36:31', '2025-11-25 19:50:20', NULL),
(69, 178, 'expense', 'voice', 5.00, 'شيبس', '‏اشتريت من السوبر ماركت شوكولاتة بعشرة والشيبس بخمسة 10', 15.00, 0, 0, '2025-11-18 08:36:31', '2025-11-18 08:36:31', '2025-11-25 19:50:20', NULL),
(70, 178, 'expense', 'voice', 500.00, '-', '‏امبارح صاحبي رجع لي فلوسي حوالي 500 جنيه', 12.00, 0, 0, '2025-11-18 08:37:12', '2025-11-18 08:37:12', '2025-11-25 19:50:20', NULL),
(81, 170, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 12:42:05', '2025-11-18 12:42:05', '2025-11-18 12:42:05', NULL),
(82, 170, 'expense', 'voice', 1.00, 'مواصلات دمنهور', '‏تكلمت معه بس لما كلمتين راقصة أحكي له مصاريف ماشي إن أنا ركبته مواصلات جنيه دمنهور وبعدين طلبنا بسكوت وعصير حاجة وخمسين وأنا مروحة السكن اشتريت حاجات بثلاثين جنيه شيبسي خيار من دي بس المصرف اللي أنا عملتها', 24.00, 0, 0, '2025-11-18 12:43:14', '2025-11-18 12:43:14', '2025-11-25 19:50:20', NULL),
(83, 170, 'expense', 'voice', 50.00, 'بسكوت وعصير', '‏تكلمت معه بس لما كلمتين راقصة أحكي له مصاريف ماشي إن أنا ركبته مواصلات جنيه دمنهور وبعدين طلبنا بسكوت وعصير حاجة وخمسين وأنا مروحة السكن اشتريت حاجات بثلاثين جنيه شيبسي خيار من دي بس المصرف اللي أنا عملتها', 24.00, 0, 0, '2025-11-18 12:43:14', '2025-11-18 12:43:14', '2025-11-25 19:50:20', NULL),
(84, 170, 'expense', 'voice', 30.00, 'شيبسي وخيار', '‏تكلمت معه بس لما كلمتين راقصة أحكي له مصاريف ماشي إن أنا ركبته مواصلات جنيه دمنهور وبعدين طلبنا بسكوت وعصير حاجة وخمسين وأنا مروحة السكن اشتريت حاجات بثلاثين جنيه شيبسي خيار من دي بس المصرف اللي أنا عملتها', 24.00, 0, 0, '2025-11-18 12:43:14', '2025-11-18 12:43:14', '2025-11-25 19:50:20', NULL),
(85, 170, 'expense', 'voice', 77.00, 'مواصلات', '‏سافرنا 77 جنيه مواصلات وجبنة أيس كوفي بمية وخمسة تاني وجبت حاجات حلوة بثلاثين نسكافيه بكم بسبعة بس', 23.00, 0, 0, '2025-11-18 12:45:09', '2025-11-18 12:45:09', '2025-11-25 19:50:20', NULL),
(87, 170, 'expense', 'voice', 30.00, 'حاجات حلوة', '‏سافرنا 77 جنيه مواصلات وجبنة أيس كوفي بمية وخمسة تاني وجبت حاجات حلوة بثلاثين نسكافيه بكم بسبعة بس', 23.00, 0, 0, '2025-11-18 12:45:09', '2025-11-18 12:45:09', '2025-11-25 19:50:20', NULL),
(88, 170, 'expense', 'voice', 7.00, 'نسكافيه', '‏سافرنا 77 جنيه مواصلات وجبنة أيس كوفي بمية وخمسة تاني وجبت حاجات حلوة بثلاثين نسكافيه بكم بسبعة بس', 23.00, 0, 0, '2025-11-18 12:45:09', '2025-11-18 12:45:09', '2025-11-25 19:50:20', NULL),
(91, 170, 'expense', 'voice', 0.00, 'Coffee', '‏عطر 18 وسبعة وسبعين مواصلات Coffee شيبسي 20 50', 16.00, 0, 0, '2025-11-18 12:46:34', '2025-11-18 12:46:34', '2025-11-25 19:50:20', NULL),
(92, 170, 'expense', 'voice', 0.00, 'شيبسي', '‏عطر 18 وسبعة وسبعين مواصلات Coffee شيبسي 20 50', 16.00, 0, 0, '2025-11-18 12:46:34', '2025-11-18 12:46:34', '2025-11-25 19:50:20', NULL),
(93, 170, 'expense', 'voice', 20.00, '-', '‏عطر 18 وسبعة وسبعين مواصلات Coffee شيبسي 20 50', 16.00, 0, 0, '2025-11-18 12:46:34', '2025-11-18 12:46:34', '2025-11-25 19:50:20', NULL),
(95, 170, 'expense', 'voice', 70.00, 'أكل', '‏70 جنيه أكل 50 جنيه مواصلات تسعة جنيه قطر', 6.00, 0, 0, '2025-11-18 12:47:14', '2025-11-18 12:47:14', '2025-11-25 19:50:20', NULL),
(96, 170, 'expense', 'voice', 50.00, 'مواصلات', '‏70 جنيه أكل 50 جنيه مواصلات تسعة جنيه قطر', 6.00, 0, 0, '2025-11-18 12:47:14', '2025-11-18 12:47:14', '2025-11-25 19:50:20', NULL),
(97, 170, 'expense', 'voice', 9.00, 'قطر', '‏70 جنيه أكل 50 جنيه مواصلات تسعة جنيه قطر', 6.00, 0, 0, '2025-11-18 12:47:14', '2025-11-18 12:47:14', '2025-11-25 19:50:20', NULL),
(98, 186, 'income', 'manual', 35000.00, NULL, NULL, NULL, 0, 0, '2025-11-18 13:12:26', '2025-11-18 15:11:54', '2025-11-18 13:12:26', NULL),
(107, 167, 'expense', 'voice', 200.00, 'تصليح سباكة', '‏صرفت النهارده 200 جنيه عشان السباك', 25.00, 0, 0, '2025-11-18 13:35:27', '2025-11-18 13:35:27', '2025-11-25 19:50:20', NULL),
(108, 187, 'expense', 'voice', 60.00, 'فطار', '‏60 جنيه فطار', 3.00, 0, 0, '2025-11-18 13:35:50', '2025-11-18 13:35:50', '2025-11-25 19:50:20', NULL),
(109, 187, 'expense', 'voice', 70.00, 'سجاير', '‏70 جنيه سجاير', 2.00, 0, 0, '2025-11-18 13:36:14', '2025-11-18 13:36:14', '2025-11-25 19:50:20', NULL),
(110, 188, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 14:06:35', '2025-11-18 14:06:35', '2025-11-18 14:06:35', NULL),
(112, 188, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 14:06:48', '2025-11-18 14:06:48', '2025-11-18 14:06:48', NULL),
(132, 170, 'expense', 'voice', 50.00, 'فطار', '‏50 جنيه فطار', 2.00, 0, 0, '2025-11-18 14:17:07', '2025-11-18 14:17:07', '2025-11-25 19:50:20', NULL),
(134, 170, 'expense', 'voice', 40.00, 'مواصلات', '‏برب 40 جنيه مواصلات', 3.00, 0, 0, '2025-11-18 14:17:53', '2025-11-18 14:17:53', '2025-11-25 19:50:20', NULL),
(135, 170, 'expense', 'voice', 44.00, 'موص', '‏44 موص', 2.00, 0, 0, '2025-11-18 14:18:06', '2025-11-18 14:18:06', '2025-11-25 19:50:20', NULL),
(136, 167, 'expense', 'voice', 300.00, 'وبر', '‏وبر 300 جنيه', 5.00, 0, 0, '2025-11-18 14:18:42', '2025-11-18 14:18:42', '2025-11-25 19:50:20', NULL),
(137, 167, 'income', 'manual', 600.00, NULL, NULL, NULL, 0, 0, '2025-11-18 14:57:05', '2025-11-18 16:57:00', '2025-11-18 14:57:05', NULL),
(138, 170, 'expense', 'voice', 200.00, '-', '‏200', 1.00, 0, 0, '2025-11-18 15:16:49', '2025-11-18 15:16:49', '2025-11-25 19:50:20', NULL),
(139, 170, 'expense', 'voice', 200.00, 'شاورما', '‏واحد شاورما 200 جنيه', 1.00, 0, 0, '2025-11-18 15:16:55', '2025-11-18 15:16:55', '2025-11-25 19:50:20', NULL),
(140, 184, 'expense', 'manual', 50.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-18 15:20:35', '2025-11-18 15:21:10', '2025-11-18 15:21:10', NULL),
(141, 170, 'expense', 'voice', 50.00, 'شاورما', '‏50 جنيه شاورما وخلي مواصلات', 3.00, 0, 0, '2025-11-18 15:29:30', '2025-11-18 15:29:30', '2025-11-25 19:50:20', NULL),
(142, 170, 'expense', 'voice', 55.00, 'شاورما', '‏50 جنيه شاورما بخمسة جنيه وصلت', 3.00, 0, 0, '2025-11-18 15:29:41', '2025-11-18 15:29:41', '2025-11-25 19:50:20', NULL),
(143, 170, 'expense', 'voice', 50.00, '-', '‏50 جنيه', 4.00, 0, 0, '2025-11-18 15:29:56', '2025-11-18 15:29:56', '2025-11-25 19:50:20', NULL),
(145, 170, 'expense', 'voice', 54.00, 'قهوة', '‏54 جنيه قهوة', 2.00, 0, 0, '2025-11-18 15:44:30', '2025-11-18 15:44:30', '2025-11-25 19:50:20', NULL),
(146, 170, 'expense', 'voice', 4000.00, '-', '‏4000 جنيه يا أسماء إسراء', 2.00, 0, 0, '2025-11-18 15:53:55', '2025-11-18 15:53:55', '2025-11-25 19:50:20', NULL),
(147, 190, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 15:56:58', '2025-11-18 15:56:58', '2025-11-18 15:56:58', NULL),
(148, 170, 'expense', 'voice', 4000.00, 'جمعية', '‏4000 جنيه جمعية قصدي الأسماء', 3.00, 0, 0, '2025-11-18 15:57:12', '2025-11-18 15:57:12', '2025-11-25 19:50:20', NULL),
(149, 170, 'expense', 'voice', 20.00, 'قهوة', '‏قهوة بعشرين', 9.00, 0, 0, '2025-11-18 15:59:26', '2025-11-18 15:59:26', '2025-11-25 19:50:20', NULL),
(150, 170, 'expense', 'voice', 600.00, 'مكسرات', '‏مكسرات 600 جنيه', 3.00, 0, 0, '2025-11-18 15:59:42', '2025-11-18 15:59:42', '2025-11-25 19:50:20', NULL),
(151, 170, 'expense', 'voice', 600.00, 'مكسرات', '‏مكسرات 600 جنيه وسبعين جنيه خضار بربع 100 جنيه محشي 30 جنيه فرا', 9.00, 0, 0, '2025-11-18 16:00:00', '2025-11-18 16:00:00', '2025-11-25 19:50:20', NULL),
(152, 170, 'expense', 'voice', 70.00, 'خضار', '‏مكسرات 600 جنيه وسبعين جنيه خضار بربع 100 جنيه محشي 30 جنيه فرا', 9.00, 0, 0, '2025-11-18 16:00:00', '2025-11-18 16:00:00', '2025-11-25 19:50:20', NULL),
(153, 170, 'expense', 'voice', 25.00, 'ربع كيلو محشي', '‏مكسرات 600 جنيه وسبعين جنيه خضار بربع 100 جنيه محشي 30 جنيه فرا', 9.00, 0, 0, '2025-11-18 16:00:00', '2025-11-18 16:00:00', '2025-11-25 19:50:20', NULL),
(154, 170, 'expense', 'voice', 30.00, 'فراخ', '‏مكسرات 600 جنيه وسبعين جنيه خضار بربع 100 جنيه محشي 30 جنيه فرا', 9.00, 0, 0, '2025-11-18 16:00:00', '2025-11-18 16:00:00', '2025-11-25 19:50:20', NULL),
(155, 170, 'expense', 'voice', 10.00, 'بنتين', '‏10 جنيه بنتين', 3.00, 0, 0, '2025-11-18 16:00:14', '2025-11-18 16:00:14', '2025-11-25 19:50:20', NULL),
(157, 170, 'expense', 'voice', 20.00, 'مكسرات', '‏بعشرين جنيه مكسرات', 2.00, 0, 0, '2025-11-18 16:06:37', '2025-11-18 16:06:37', '2025-11-25 19:50:20', NULL),
(158, 170, 'expense', 'voice', 300.00, 'شاورما', '‏بثلاث 100 جنيه شاورما', 3.00, 0, 0, '2025-11-18 16:07:02', '2025-11-18 16:07:02', '2025-11-25 19:50:20', NULL),
(159, 170, 'expense', 'voice', 400.00, 'كفتة', '‏400 جنيه كفتة', 3.00, 0, 0, '2025-11-18 16:07:36', '2025-11-18 16:07:36', '2025-11-25 19:50:20', NULL),
(160, 170, 'expense', 'voice', 60.00, '-', '‏60 جنيه', 2.00, 0, 0, '2025-11-18 16:10:22', '2025-11-18 16:10:22', '2025-11-25 19:50:20', NULL),
(161, 170, 'expense', 'voice', 50.00, 'Work space', '‏50 جنيه Work space', 2.00, 0, 0, '2025-11-18 16:10:50', '2025-11-18 16:10:50', '2025-11-25 19:50:20', NULL),
(162, 170, 'expense', 'voice', 60.00, 'ايس كوفي', '‏60 جنيه أيس كوفي', 3.00, 0, 0, '2025-11-18 16:11:02', '2025-11-18 16:11:02', '2025-11-25 19:50:20', NULL),
(170, 170, 'expense', 'voice', 200.00, 'جنيه', '‏200 جنيه 200 جنيه', 5.00, 0, 0, '2025-11-18 16:37:22', '2025-11-18 16:37:22', '2025-11-25 19:50:20', NULL),
(171, 170, 'expense', 'voice', 200.00, 'جنيه', '‏200 جنيه 200 جنيه', 5.00, 0, 0, '2025-11-18 16:37:22', '2025-11-18 16:37:22', '2025-11-25 19:50:20', NULL),
(172, 170, 'expense', 'voice', 200.00, 'شاورما', '‏200 جنيه شاورما', 2.00, 0, 0, '2025-11-18 16:37:30', '2025-11-18 16:37:30', '2025-11-25 19:50:20', NULL),
(173, 170, 'expense', 'voice', 1.00, 'شاورما', '‏تديني شاورما وبش جنيه فلافل بثلاثين جنيه قهوة', 4.00, 0, 0, '2025-11-18 16:37:37', '2025-11-18 16:37:37', '2025-11-25 19:50:20', NULL),
(174, 170, 'expense', 'voice', 1.00, 'فلافل', '‏تديني شاورما وبش جنيه فلافل بثلاثين جنيه قهوة', 4.00, 0, 0, '2025-11-18 16:37:37', '2025-11-18 16:37:37', '2025-11-25 19:50:20', NULL),
(175, 170, 'expense', 'voice', 30.00, 'قهوة', '‏تديني شاورما وبش جنيه فلافل بثلاثين جنيه قهوة', 4.00, 0, 0, '2025-11-18 16:37:37', '2025-11-18 16:37:37', '2025-11-25 19:50:20', NULL),
(176, 170, 'expense', 'voice', 20.00, 'شاورما', '‏20 جنيه شاورما وثلاثين قهوة وست 100 غدا', 8.00, 0, 0, '2025-11-18 16:38:08', '2025-11-18 16:38:08', '2025-11-25 19:50:20', NULL),
(177, 170, 'expense', 'voice', 30.00, 'قهوة', '‏20 جنيه شاورما وثلاثين قهوة وست 100 غدا', 8.00, 0, 0, '2025-11-18 16:38:08', '2025-11-18 16:38:08', '2025-11-25 19:50:20', NULL),
(178, 170, 'expense', 'voice', 600.00, 'غداء', '‏20 جنيه شاورما وثلاثين قهوة وست 100 غدا', 8.00, 0, 0, '2025-11-18 16:38:08', '2025-11-18 16:38:08', '2025-11-25 19:50:20', NULL),
(182, 170, 'expense', 'voice', 100.00, 'ماتش', '‏100 جنيه ماتش', 3.00, 0, 0, '2025-11-18 16:41:01', '2025-11-18 16:41:01', '2025-11-25 19:50:20', NULL),
(183, 192, 'income', 'manual', 1000.00, NULL, NULL, NULL, 0, 0, '2025-11-18 16:45:26', '2025-11-18 18:45:20', '2025-11-18 16:45:26', NULL),
(184, 192, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 16:45:36', '2025-11-18 16:45:36', '2025-11-18 16:45:36', NULL),
(185, 192, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 16:45:47', '2025-11-18 16:45:47', '2025-11-18 16:45:47', NULL),
(191, 170, 'expense', 'voice', 20.00, 'فول', '‏شرين دي فول وعشرين جنيه فلافل وعشرين جنيه بطاطس', 4.00, 0, 0, '2025-11-18 17:15:55', '2025-11-18 17:15:55', '2025-11-25 19:50:20', NULL),
(193, 170, 'expense', 'voice', 20.00, 'بطاطس', '‏شرين دي فول وعشرين جنيه فلافل وعشرين جنيه بطاطس', 4.00, 0, 0, '2025-11-18 17:15:55', '2025-11-18 17:15:55', '2025-11-25 19:50:20', NULL),
(197, 193, 'income', 'manual', 1297.00, NULL, NULL, NULL, 0, 0, '2025-11-18 17:27:39', '2025-11-18 12:27:21', '2025-11-18 17:27:39', NULL),
(198, 193, 'income', 'manual', 20.00, NULL, NULL, NULL, 0, 0, '2025-11-18 17:28:13', '2025-11-18 12:28:09', '2025-11-18 17:28:13', NULL),
(199, 193, 'expense', 'manual', 1.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 17:28:21', '2025-11-18 17:28:44', '2025-11-18 17:28:44', NULL),
(200, 193, 'expense', 'manual', 1.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 17:28:22', '2025-11-18 17:28:52', '2025-11-18 17:28:52', NULL),
(213, 170, 'income', 'manual', 300.00, NULL, NULL, NULL, 0, 0, '2025-11-18 17:31:04', '2025-11-18 00:00:00', '2025-11-18 17:31:04', NULL),
(219, 170, 'expense', 'voice', 4.00, 'شمة', '‏فور شمة', 4.00, 0, 0, '2025-11-18 17:36:35', '2025-11-18 17:36:35', '2025-11-25 19:50:20', NULL),
(224, 170, 'expense', 'voice', 0.00, 'شاورما', '‏Solve شاورما', 3.00, 0, 0, '2025-11-18 17:36:54', '2025-11-18 17:36:54', '2025-11-25 19:50:20', NULL),
(225, 170, 'expense', 'voice', 50.00, 'شاورما', '‏Fifty شاورما', 2.00, 0, 0, '2025-11-18 17:37:03', '2025-11-18 17:37:03', '2025-11-25 19:50:20', NULL),
(228, 170, 'expense', 'voice', 500.00, 'Ball', '‏FIVE Hundred Basket بول', 5.00, 0, 0, '2025-11-18 17:37:33', '2025-11-18 17:37:33', '2025-11-25 19:50:20', NULL),
(230, 184, 'expense', 'manual', 385.00, 'Food', NULL, NULL, 0, 0, '2025-11-18 17:39:15', '2025-11-18 17:39:34', '2025-11-18 17:39:34', NULL),
(236, 170, 'expense', 'voice', 150.00, 'درس', '‏صرفت 150 درس', 3.00, 0, 0, '2025-11-18 17:40:56', '2025-11-18 17:40:56', '2025-11-25 19:50:20', NULL),
(238, 184, 'income', 'manual', 2000.00, NULL, NULL, NULL, 0, 0, '2025-11-18 17:41:43', '2025-11-18 19:40:47', '2025-11-18 17:41:43', NULL),
(240, 184, 'expense', 'manual', 45.00, 'other things ', NULL, NULL, 0, 0, '2025-11-18 17:42:29', '2025-11-18 17:43:31', '2025-11-18 17:43:31', NULL),
(281, 192, 'income', 'manual', 200.00, NULL, NULL, NULL, 0, 0, '2025-11-18 17:56:22', '2025-10-11 00:00:00', '2025-11-18 17:56:22', NULL),
(286, 170, 'expense', 'voice', 60.00, 'Work', '‏60 جنيه Work', 3.00, 0, 0, '2025-11-18 17:57:18', '2025-11-18 17:57:18', '2025-11-25 19:50:20', NULL),
(289, 170, 'expense', 'voice', 60.00, 'Work space', '‏Work space وستين جنيه', 3.00, 0, 0, '2025-11-18 17:57:28', '2025-11-18 17:57:28', '2025-11-25 19:50:20', NULL),
(341, 194, 'income', 'manual', 5000.00, NULL, NULL, NULL, 0, 0, '2025-11-18 18:19:02', '2025-11-18 20:18:59', '2025-11-18 18:19:02', NULL),
(345, 170, 'expense', 'voice', 8.00, 'مواصلات', '‏ثمانية جنيه مواصلات', 5.00, 0, 0, '2025-11-18 18:24:11', '2025-11-18 18:24:11', '2025-11-25 19:50:20', NULL),
(348, 194, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-18 18:26:35', '2025-11-18 18:26:35', '2025-11-18 18:26:35', NULL),
(349, 194, 'expense', 'voice', 10.00, 'فول', '10 جنيه فول 10 جنيه فلافل', 2.00, 0, 0, '2025-11-18 18:27:48', '2025-11-18 18:27:48', '2025-11-25 19:50:20', NULL),
(350, 194, 'expense', 'voice', 10.00, 'فلافل', '10 جنيه فول 10 جنيه فلافل', 2.00, 0, 0, '2025-11-18 18:27:48', '2025-11-18 18:27:48', '2025-11-25 19:50:20', NULL),
(355, 170, 'expense', 'voice', 4.50, '-', '‏أربعة ونص', 1.00, 0, 0, '2025-11-18 18:28:10', '2025-11-18 18:28:10', '2025-11-25 19:50:20', NULL),
(356, 170, 'expense', 'voice', 4.00, 'مواصلات', '‏أربعة جنيه مواصلات', 2.00, 0, 0, '2025-11-18 18:28:24', '2025-11-18 18:28:24', '2025-11-25 19:50:20', NULL),
(357, 170, 'expense', 'voice', 4.00, 'المواصلات', '‏صرفت أربع جنيه في المواصلات فيك أنت وعشرين جنيه على القهوة وست وستين جنيه شاورما', 10.00, 0, 0, '2025-11-18 18:37:13', '2025-11-18 18:37:13', '2025-11-25 19:50:20', NULL),
(358, 170, 'expense', 'voice', 20.00, 'القهوة', '‏صرفت أربع جنيه في المواصلات فيك أنت وعشرين جنيه على القهوة وست وستين جنيه شاورما', 10.00, 0, 0, '2025-11-18 18:37:13', '2025-11-18 18:37:13', '2025-11-25 19:50:20', NULL),
(359, 170, 'expense', 'voice', 66.00, 'شاورما', '‏صرفت أربع جنيه في المواصلات فيك أنت وعشرين جنيه على القهوة وست وستين جنيه شاورما', 10.00, 0, 0, '2025-11-18 18:37:13', '2025-11-18 18:37:13', '2025-11-25 19:50:20', NULL),
(361, 170, 'expense', 'voice', 20.00, 'كورة', '‏20 جنيه حجز كورة', 3.00, 0, 0, '2025-11-18 18:39:09', '2025-11-18 18:39:09', '2025-11-25 19:50:20', NULL),
(384, 170, 'expense', 'voice', 300.00, '-', '‏300 جنيه د', 2.00, 0, 0, '2025-11-18 19:00:22', '2025-11-18 19:00:22', '2025-11-25 19:50:20', NULL),
(385, 170, 'expense', 'voice', 300.00, 'درس', '‏درس بثلاث 100 جنيه', 2.00, 0, 0, '2025-11-18 19:00:30', '2025-11-18 19:00:30', '2025-11-25 19:50:20', NULL),
(386, 170, 'expense', 'voice', 200.00, 'درس العربي', '‏200 جنيه درس العربي', 5.00, 0, 0, '2025-11-18 19:01:01', '2025-11-18 19:01:01', '2025-11-25 19:50:20', NULL),
(470, 197, 'expense', 'manual', 68.00, ' vcc', NULL, NULL, 0, 0, '2025-11-18 20:49:10', '2025-11-18 20:49:10', '2025-11-18 20:49:10', NULL),
(471, 197, 'expense', 'manual', 68.00, 'dfvc', NULL, NULL, 0, 0, '2025-11-18 20:49:23', '2025-11-18 20:49:23', '2025-11-18 20:49:23', NULL),
(472, 197, 'expense', 'manual', 388.00, 'sgxxc', NULL, NULL, 0, 0, '2025-11-18 20:49:29', '2025-11-18 20:49:29', '2025-11-18 20:49:29', NULL),
(473, 197, 'expense', 'manual', 655.00, 'ccdd', NULL, NULL, 0, 0, '2025-11-18 20:49:36', '2025-11-18 20:49:36', '2025-11-18 20:49:36', NULL),
(480, 197, 'expense', 'manual', 687.00, 'svvddx', NULL, NULL, 0, 0, '2025-11-18 20:50:05', '2025-11-18 20:50:05', '2025-11-18 20:50:05', NULL),
(484, 199, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-19 01:47:16', '2025-11-19 01:47:16', '2025-11-19 01:47:16', NULL),
(485, 199, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-19 01:47:19', '2025-11-19 01:47:19', '2025-11-19 01:47:19', NULL),
(486, 200, 'income', 'manual', 100000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 01:48:55', '2025-11-01 00:00:00', '2025-11-19 01:48:55', NULL),
(488, 203, 'income', 'manual', 500.00, NULL, NULL, NULL, 0, 0, '2025-11-19 08:13:13', '2025-11-19 10:12:22', '2025-11-19 08:13:13', NULL),
(489, 204, 'expense', 'voice', 20.00, 'قهوة', '200 جنيه قهوه', 25.00, 0, 0, '2025-11-19 08:34:48', '2025-11-19 08:34:48', '2025-11-25 19:50:20', NULL),
(490, 204, 'expense', 'voice', 20.00, 'كفتة', '20 جنيه كفته', 13.00, 0, 0, '2025-11-19 08:34:54', '2025-11-19 08:34:54', '2025-11-25 19:50:20', NULL),
(491, 204, 'expense', 'voice', 140.00, 'قهوة', '140 جنيه على القهوه و 60 جنيه ميه و', 25.00, 0, 0, '2025-11-19 08:35:02', '2025-11-19 08:35:02', '2025-11-25 19:50:20', NULL),
(492, 204, 'expense', 'voice', 60.00, 'مياه', '140 جنيه على القهوه و 60 جنيه ميه و', 25.00, 0, 0, '2025-11-19 08:35:02', '2025-11-19 08:35:02', '2025-11-25 19:50:20', NULL),
(493, 204, 'expense', 'voice', 77.00, 'فاتورة كهرباء', '77 جنيه فاتوره كهرباء', 12.00, 0, 0, '2025-11-19 08:35:16', '2025-11-19 08:35:16', '2025-11-25 19:50:20', NULL),
(494, 204, 'expense', 'voice', 88.00, 'ماء', '88 جنيه فاتوره الم', 14.00, 0, 0, '2025-11-19 08:35:22', '2025-11-19 08:35:22', '2025-11-25 19:50:20', NULL),
(495, 204, 'expense', 'voice', 300.00, 'فلوس الج', '300 جنيه فلوس الج', 14.00, 0, 0, '2025-11-19 08:35:37', '2025-11-19 08:35:37', '2025-11-25 19:50:20', NULL),
(496, 204, 'expense', 'voice', 300.00, 'فلوس جيم', '300 جنيه فلوس جيم', 13.00, 0, 0, '2025-11-19 08:35:42', '2025-11-19 08:35:42', '2025-11-25 19:50:20', NULL),
(497, 204, 'income', 'manual', 1005.00, NULL, NULL, NULL, 0, 0, '2025-11-19 08:36:09', '2025-11-19 00:00:00', '2025-11-19 08:36:09', NULL),
(498, 204, 'expense', 'manual', 100.00, 'كفتة', NULL, NULL, 0, 0, '2025-11-19 08:36:24', '2025-11-19 08:36:24', '2025-11-19 08:36:24', NULL),
(499, 204, 'expense', 'voice', 77.00, 'مياه', '77 جنيه ميه 60 جنيه شوربه 50 جنيه جي', 23.00, 0, 0, '2025-11-19 08:36:36', '2025-11-19 08:36:36', '2025-11-25 19:50:20', NULL),
(500, 204, 'expense', 'voice', 60.00, 'شوربة', '77 جنيه ميه 60 جنيه شوربه 50 جنيه جي', 23.00, 0, 0, '2025-11-19 08:36:36', '2025-11-19 08:36:36', '2025-11-25 19:50:20', NULL),
(501, 204, 'expense', 'voice', 50.00, 'جي', '77 جنيه ميه 60 جنيه شوربه 50 جنيه جي', 23.00, 0, 0, '2025-11-19 08:36:36', '2025-11-19 08:36:36', '2025-11-25 19:50:20', NULL),
(502, 204, 'expense', 'voice', 2000.00, '-', '2000 جنيه', 1.00, 0, 0, '2025-11-19 08:36:50', '2025-11-19 08:36:50', '2025-11-25 19:50:20', NULL),
(503, 204, 'expense', 'voice', 2000.00, 'اسماء واسراء', '2000 جنيه اسماء واسراء و 1000 جنيه لعلي', 22.00, 0, 0, '2025-11-19 08:36:57', '2025-11-19 08:36:57', '2025-11-25 19:50:20', NULL),
(504, 204, 'expense', 'voice', 1000.00, 'علي', '2000 جنيه اسماء واسراء و 1000 جنيه لعلي', 22.00, 0, 0, '2025-11-19 08:36:57', '2025-11-19 08:36:57', '2025-11-25 19:50:20', NULL),
(506, 204, 'expense', 'voice', 400.00, 'مياه', 'ب 400 جنيه ميه وب 300 جنيه للكفته', 25.00, 0, 0, '2025-11-19 08:37:53', '2025-11-19 08:37:53', '2025-11-25 19:50:20', NULL),
(507, 204, 'expense', 'voice', 300.00, 'كفتة', 'ب 400 جنيه ميه وب 300 جنيه للكفته', 25.00, 0, 0, '2025-11-19 08:37:53', '2025-11-19 08:37:53', '2025-11-25 19:50:20', NULL),
(512, 207, 'income', 'manual', 3700.00, NULL, NULL, NULL, 0, 0, '2025-11-19 08:51:48', '2025-11-19 10:51:42', '2025-11-19 08:51:48', NULL),
(523, 209, 'expense', 'manual', 50.00, 'burger', NULL, NULL, 0, 0, '2025-11-19 09:43:03', '2025-11-19 09:43:03', '2025-11-19 09:43:03', NULL),
(524, 209, 'income', 'manual', 500.00, NULL, NULL, NULL, 0, 0, '2025-11-19 09:43:19', '2025-11-19 11:43:10', '2025-11-19 09:43:19', NULL),
(525, 207, 'expense', 'voice', 50.00, 'مواصلات', 'انا النهارده والله كانت اتصرفت مثلا نقول مثلا بتاع 50 جنيه مواصلات و 100 جنيه مثلا فطار و500 جنيه غدا', 11.00, 0, 0, '2025-11-19 11:31:12', '2025-11-19 11:31:12', '2025-11-25 19:50:20', NULL),
(526, 207, 'expense', 'voice', 100.00, 'فطار', 'انا النهارده والله كانت اتصرفت مثلا نقول مثلا بتاع 50 جنيه مواصلات و 100 جنيه مثلا فطار و500 جنيه غدا', 11.00, 0, 0, '2025-11-19 11:31:12', '2025-11-19 11:31:12', '2025-11-25 19:50:20', NULL),
(527, 207, 'expense', 'voice', 500.00, 'غدا', 'انا النهارده والله كانت اتصرفت مثلا نقول مثلا بتاع 50 جنيه مواصلات و 100 جنيه مثلا فطار و500 جنيه غدا', 11.00, 0, 0, '2025-11-19 11:31:12', '2025-11-19 11:31:12', '2025-11-25 19:50:20', NULL),
(528, 210, 'income', 'manual', 3497.00, NULL, NULL, NULL, 0, 0, '2025-11-19 11:36:37', '2025-11-19 13:36:30', '2025-11-19 11:36:37', NULL),
(529, 210, 'income', 'manual', 355.00, NULL, NULL, NULL, 0, 0, '2025-11-19 11:36:50', '2025-11-19 13:36:39', '2025-11-19 11:36:50', NULL),
(535, 202, 'income', 'manual', 6680.00, NULL, NULL, NULL, 0, 0, '2025-11-19 13:49:31', '2025-11-19 15:49:25', '2025-11-19 13:49:31', NULL),
(536, 202, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-19 13:49:46', '2025-11-19 13:49:46', '2025-11-19 13:49:46', NULL),
(538, 202, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-19 13:50:20', '2025-11-19 13:50:20', '2025-11-19 13:50:20', NULL),
(595, 212, 'expense', 'voice', 123.00, 'قهوة', '70 جنيه للقهوه', 6.00, 0, 0, '2025-11-19 14:30:55', '2025-11-19 14:31:06', '2025-11-25 19:50:20', NULL),
(596, 212, 'income', 'manual', 50000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 14:31:31', '2025-11-19 00:00:00', '2025-11-19 14:31:31', NULL),
(598, 214, 'expense', 'voice', 125.00, 'شاورما', '‏125 شاورما', 3.00, 0, 0, '2025-11-19 15:58:54', '2025-11-19 15:58:54', '2025-11-25 19:50:20', NULL),
(599, 214, 'expense', 'voice', 5.00, 'مواصلات', '‏خمسة مواصلات 10 مواصلات في 25 شاورما 30 بطاطس 20 فور', 14.00, 0, 0, '2025-11-19 15:59:15', '2025-11-19 15:59:15', '2025-11-25 19:50:20', NULL),
(600, 214, 'expense', 'voice', 10.00, 'مواصلات', '‏خمسة مواصلات 10 مواصلات في 25 شاورما 30 بطاطس 20 فور', 14.00, 0, 0, '2025-11-19 15:59:15', '2025-11-19 15:59:15', '2025-11-25 19:50:20', NULL),
(602, 214, 'expense', 'voice', 30.00, 'بطاطس', '‏خمسة مواصلات 10 مواصلات في 25 شاورما 30 بطاطس 20 فور', 14.00, 0, 0, '2025-11-19 15:59:15', '2025-11-19 15:59:15', '2025-11-25 19:50:20', NULL),
(603, 214, 'expense', 'voice', 20.00, 'فول', '‏خمسة مواصلات 10 مواصلات في 25 شاورما 30 بطاطس 20 فور', 14.00, 0, 0, '2025-11-19 15:59:15', '2025-11-19 15:59:44', '2025-11-25 19:50:20', NULL),
(604, 214, 'expense', 'voice', 10.00, 'شيبسي', '‏10 جنيه شيبسي', 2.00, 0, 0, '2025-11-19 16:00:11', '2025-11-19 16:00:11', '2025-11-25 19:50:20', NULL),
(607, 215, 'income', 'manual', 1000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 16:10:15', '2025-11-19 20:09:44', '2025-11-19 16:10:15', NULL),
(612, 210, 'expense', 'voice', 900.00, 'رحلة بورسعيد', 'دفعت 900 جنيه لرحله بورسعيد', 4.00, 0, 0, '2025-11-19 16:11:29', '2025-11-19 16:12:12', '2025-11-25 19:50:20', NULL),
(614, 215, 'expense', 'manual', 9.00, 'fruits', NULL, NULL, 0, 0, '2025-11-19 16:12:25', '2025-11-19 16:12:25', '2025-11-19 16:12:25', NULL),
(616, 209, 'expense', 'voice', 30.00, 'بطاطس', '30 جنيه بطاطس', 2.00, 0, 0, '2025-11-19 16:21:59', '2025-11-19 16:21:59', '2025-11-25 19:50:20', NULL),
(619, 209, 'expense', 'voice', 50.00, '-', 'كسبت 50 جنيه زياده', 2.00, 0, 0, '2025-11-19 16:22:26', '2025-11-19 16:22:26', '2025-11-25 19:50:20', NULL),
(620, 210, 'expense', 'voice', 6.00, 'مواصلات', '6 جنيه مواصلات لاول النفق', 3.00, 0, 0, '2025-11-19 16:25:23', '2025-11-19 16:25:23', '2025-11-25 19:50:20', NULL),
(621, 216, 'expense', 'voice', 70.00, 'قهوة', '70 جنيه قهوه', 2.00, 0, 0, '2025-11-19 16:33:01', '2025-11-19 16:33:01', '2025-11-25 19:50:20', NULL),
(622, 216, 'expense', 'voice', 50.00, 'فراخ', '50 جنيه فراخ', 2.00, 0, 0, '2025-11-19 16:33:13', '2025-11-19 16:33:13', '2025-11-25 19:50:20', NULL),
(623, 216, 'expense', 'voice', 1.00, 'قهوة', 'قهوه مع الصحاب', 2.00, 0, 0, '2025-11-19 16:33:21', '2025-11-19 16:33:21', '2025-11-25 19:50:20', NULL),
(624, 216, 'income', 'manual', 15000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 16:34:02', '2025-11-19 18:33:57', '2025-11-19 16:34:02', NULL),
(625, 216, 'expense', 'voice', 5.00, 'ش', '5 جنيه ش', 2.00, 0, 0, '2025-11-19 16:34:21', '2025-11-19 16:34:21', '2025-11-25 19:50:20', NULL),
(626, 216, 'expense', 'voice', 5.00, 'شاي', '5 جنيه شاي', 4.00, 0, 0, '2025-11-19 16:34:56', '2025-11-19 16:34:56', '2025-11-25 19:50:20', NULL),
(627, 216, 'expense', 'voice', 10.00, 'سكر', '10 جنيه سكر', 3.00, 0, 0, '2025-11-19 16:35:17', '2025-11-19 16:35:17', '2025-11-25 19:50:20', NULL),
(633, 206, 'expense', 'voice', 63.00, 'مواصلات', 'جنيه دي صرفت 63 جنيه مواصلات واشتريت قهوه ب 20 جنيه وفطرت ب 50 جنيه', 13.00, 0, 0, '2025-11-19 16:38:15', '2025-11-19 16:38:15', '2025-11-25 19:50:20', NULL),
(634, 206, 'expense', 'voice', 20.00, 'قهوه', 'جنيه دي صرفت 63 جنيه مواصلات واشتريت قهوه ب 20 جنيه وفطرت ب 50 جنيه', 13.00, 0, 0, '2025-11-19 16:38:15', '2025-11-19 16:38:15', '2025-11-25 19:50:20', NULL),
(635, 206, 'expense', 'voice', 50.00, 'فطار', 'جنيه دي صرفت 63 جنيه مواصلات واشتريت قهوه ب 20 جنيه وفطرت ب 50 جنيه', 13.00, 0, 0, '2025-11-19 16:38:15', '2025-11-19 16:38:15', '2025-11-25 19:50:20', NULL),
(636, 206, 'expense', 'voice', 100.00, '-', 'انا حطيت في المحفظه 100 جنيه', 4.00, 0, 0, '2025-11-19 16:38:27', '2025-11-19 16:38:27', '2025-11-25 19:50:20', NULL),
(637, 206, 'expense', 'voice', 100.00, '-', 'انا اخذت 100 جنيه', 2.00, 0, 0, '2025-11-19 16:38:33', '2025-11-19 16:38:33', '2025-11-25 19:50:20', NULL),
(638, 206, 'expense', 'voice', 100.00, '-', 'زود 100 جنيه على الحساب', 2.00, 0, 0, '2025-11-19 16:38:40', '2025-11-19 16:38:40', '2025-11-25 19:50:20', NULL),
(639, 220, 'income', 'manual', 6680.00, NULL, NULL, NULL, 0, 0, '2025-11-19 16:40:48', '2025-11-19 18:40:44', '2025-11-19 16:40:48', NULL),
(644, 219, 'expense', 'voice', 0.00, 'رز', 'رز', 3.00, 0, 0, '2025-11-19 16:41:21', '2025-11-19 16:41:21', '2025-11-25 19:50:20', NULL),
(645, 219, 'expense', 'voice', 35.00, 'رز', '35 رز', 2.00, 0, 0, '2025-11-19 16:41:28', '2025-11-19 16:41:28', '2025-11-25 19:50:20', NULL),
(646, 219, 'expense', 'voice', 220.00, 'مو', 'اثنين 20 مو', 3.00, 0, 0, '2025-11-19 16:41:37', '2025-11-19 16:41:37', '2025-11-25 19:50:20', NULL),
(647, 219, 'income', 'manual', 15000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 16:42:23', '2025-11-19 18:42:17', '2025-11-19 16:42:23', NULL),
(648, 219, 'expense', 'voice', 25.00, 'كتكوت', '25 كتكوت', 3.00, 0, 0, '2025-11-19 16:43:27', '2025-11-19 16:43:27', '2025-11-25 19:50:20', NULL),
(649, 219, 'expense', 'voice', 50.00, '-', '50', 4.00, 0, 0, '2025-11-19 16:43:35', '2025-11-19 16:43:35', '2025-11-25 19:50:20', NULL),
(651, 220, 'expense', 'voice', 6.00, 'water', '‏ستة جنيه', 2.00, 0, 0, '2025-11-19 16:44:25', '2025-11-19 16:44:38', '2025-11-25 19:50:20', NULL),
(652, 220, 'expense', 'voice', 12.00, 'مُوَصِّلَات', '‏12 جنيه موصلات', 1.00, 0, 0, '2025-11-19 16:45:59', '2025-11-19 16:45:59', '2025-11-25 19:50:20', NULL),
(653, 220, 'expense', 'voice', 80.00, 'بسكوت', '‏80 جنيه بسكوت', 2.00, 0, 0, '2025-11-19 16:46:27', '2025-11-19 16:46:27', '2025-11-25 19:50:20', NULL),
(654, 219, 'expense', 'voice', 3.00, 'برتقال', 'ثلاثه برتقال', 5.00, 0, 0, '2025-11-19 16:48:11', '2025-11-19 16:48:11', '2025-11-25 19:50:20', NULL),
(655, 219, 'expense', 'voice', 0.00, 'مسحوق اوكسي', 'مسحوق اوكسي', 3.00, 0, 0, '2025-11-19 16:48:21', '2025-11-19 16:48:21', '2025-11-25 19:50:20', NULL),
(656, 219, 'expense', 'voice', 0.00, 'كلوركس', 'كلوركس', 5.00, 0, 0, '2025-11-19 16:48:34', '2025-11-19 16:48:34', '2025-11-25 19:50:20', NULL),
(657, 210, 'expense', 'voice', 3.50, 'مواصلات', '3 جنيه ونص مواصلات', 9.00, 0, 0, '2025-11-19 17:12:20', '2025-11-19 17:12:20', '2025-11-25 19:50:20', NULL),
(658, 210, 'expense', 'voice', 100.00, 'سندوتشات كفتة', 'دفعت 100 جنيه سندوتشات كفته', 4.00, 0, 0, '2025-11-19 17:12:29', '2025-11-19 17:12:29', '2025-11-25 19:50:20', NULL),
(666, 210, 'expense', 'manual', 25.00, 'قهوة', NULL, NULL, 0, 0, '2025-11-19 17:33:44', '2025-11-19 17:33:44', '2025-11-19 17:33:44', NULL),
(667, 210, 'expense', 'manual', 7.00, 'مياة', NULL, NULL, 0, 0, '2025-11-19 17:33:55', '2025-11-19 17:33:55', '2025-11-19 17:33:55', NULL),
(669, 219, 'expense', 'voice', 50.00, 'بيبسي', '50 جنيه بيبسي', 3.00, 0, 0, '2025-11-19 18:05:40', '2025-11-19 18:05:40', '2025-11-25 19:50:20', NULL),
(670, 219, 'expense', 'voice', 50.00, 'بيبسي', '50 جنيه بيبسي', 2.00, 0, 0, '2025-11-19 18:07:12', '2025-11-19 18:07:12', '2025-11-25 19:50:20', NULL),
(671, 219, 'expense', 'voice', 2.00, 'سيجارة', 'اتنين سيجاره', 4.00, 0, 0, '2025-11-19 18:07:26', '2025-11-19 18:07:26', '2025-11-25 19:50:20', NULL),
(672, 219, 'expense', 'voice', 2.00, 'يوستفندي', 'اتنين يوستفندي', 3.00, 0, 0, '2025-11-19 18:07:40', '2025-11-19 18:07:40', '2025-11-25 19:50:20', NULL),
(673, 210, 'expense', 'voice', 75.00, 'تذكرة قطار', '75 جنيه تذكره قطر', 3.00, 0, 0, '2025-11-19 18:24:19', '2025-11-19 18:24:30', '2025-11-25 19:50:20', NULL),
(674, 210, 'expense', 'voice', 50.00, 'مش لقيها', 'في 50 جنيه ضايعه', 2.00, 0, 0, '2025-11-19 18:27:37', '2025-11-19 18:27:47', '2025-11-25 19:50:20', NULL),
(676, 223, 'expense', 'manual', 1250.00, 'jewelry ', NULL, NULL, 0, 0, '2025-11-19 18:29:33', '2025-11-19 18:29:51', '2025-11-19 18:29:51', NULL),
(679, 223, 'expense', 'manual', 80.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-19 18:30:06', '2025-11-19 18:30:24', '2025-11-19 18:30:24', NULL),
(682, 223, 'expense', 'manual', 270.00, 'candy for kids', NULL, NULL, 0, 0, '2025-11-19 18:30:43', '2025-11-19 18:31:00', '2025-11-19 18:31:00', NULL),
(683, 223, 'expense', 'manual', 70.00, 'fruits', NULL, NULL, 0, 0, '2025-11-19 18:31:17', '2025-11-19 18:31:32', '2025-11-19 18:31:32', NULL),
(685, 223, 'expense', 'manual', 70.00, 'batteries ', NULL, NULL, 0, 0, '2025-11-19 18:31:50', '2025-11-19 18:32:20', '2025-11-19 18:32:20', NULL),
(693, 223, 'income', 'manual', 1000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 18:35:15', '2025-11-19 20:35:11', '2025-11-19 18:35:15', NULL),
(694, 223, 'expense', 'manual', 40.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-19 18:35:40', '2025-11-19 18:35:56', '2025-11-19 18:35:56', NULL),
(696, 210, 'expense', 'voice', 1.00, 'تحويل انستا باي', '1 جنيه تحويل انستا باي', 4.00, 0, 0, '2025-11-19 18:36:27', '2025-11-19 18:36:27', '2025-11-25 19:50:20', NULL),
(697, 184, 'expense', 'manual', 80.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-19 18:36:55', '2025-11-19 18:37:10', '2025-11-19 18:37:10', NULL),
(699, 184, 'expense', 'manual', 1250.00, 'Jewelry ', NULL, NULL, 0, 0, '2025-11-19 18:37:24', '2025-11-19 18:40:17', '2025-11-19 18:40:17', NULL),
(700, 210, 'expense', 'voice', 1.00, 'مش لقيه', 'جنيه', 2.00, 0, 0, '2025-11-19 18:37:59', '2025-11-19 18:39:40', '2025-11-25 19:50:20', NULL),
(701, 184, 'expense', 'manual', 270.00, 'Candy for kids', NULL, NULL, 0, 0, '2025-11-19 18:38:05', '2025-11-19 18:38:20', '2025-11-19 18:38:20', NULL),
(702, 184, 'expense', 'manual', 60.00, 'Fruits ', NULL, NULL, 0, 0, '2025-11-19 18:38:43', '2025-11-19 18:39:58', '2025-11-19 18:39:58', NULL),
(703, 184, 'expense', 'manual', 70.00, 'batteries ', NULL, NULL, 0, 0, '2025-11-19 18:39:12', '2025-11-19 18:39:26', '2025-11-19 18:39:26', NULL),
(704, 184, 'expense', 'manual', 40.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-19 18:39:40', '2025-11-19 18:39:50', '2025-11-19 18:39:50', NULL),
(705, 184, 'income', 'manual', 1000.00, NULL, NULL, NULL, 0, 0, '2025-11-19 18:40:29', '2025-11-19 20:40:23', '2025-11-19 18:40:29', NULL),
(716, 226, 'expense', 'voice', 70.00, 'قهوة', '70 جنيه قهوه', 2.00, 0, 0, '2025-11-19 20:31:20', '2025-11-19 20:31:20', '2025-11-25 19:50:20', NULL),
(717, 226, 'expense', 'voice', 15.00, 'رز', '15 جنيه رز', 2.00, 0, 0, '2025-11-19 20:31:28', '2025-11-19 20:31:28', '2025-11-25 19:50:20', NULL),
(718, 226, 'expense', 'voice', 3.00, '-', 'دخل ب 3 جنيه', 3.00, 0, 0, '2025-11-19 20:31:48', '2025-11-19 20:31:48', '2025-11-25 19:50:20', NULL),
(719, 227, 'expense', 'voice', 0.00, 'coffee', 'كوفي', 1.00, 0, 0, '2025-11-19 20:38:35', '2025-11-19 20:38:35', '2025-11-25 19:50:20', NULL),
(720, 227, 'expense', 'voice', 50.00, 'كوفي', 'كوفي ب 50 جنيه', 3.00, 0, 0, '2025-11-19 20:38:42', '2025-11-19 20:38:42', '2025-11-25 19:50:20', NULL),
(721, 227, 'income', 'manual', 50.00, NULL, NULL, NULL, 0, 0, '2025-11-19 20:41:53', '2025-11-19 22:41:48', '2025-11-19 20:41:53', NULL),
(722, 227, 'expense', 'voice', 0.00, 'شاي', 'شاي اخ', 2.00, 0, 0, '2025-11-19 20:42:59', '2025-11-19 20:42:59', '2025-11-25 19:50:20', NULL),
(723, 227, 'expense', 'voice', 1.00, 'شاي اخضر', 'شاي اخضر ب', 2.00, 0, 0, '2025-11-19 20:43:05', '2025-11-19 20:43:05', '2025-11-25 19:50:20', NULL),
(724, 184, 'expense', 'manual', 300.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-19 21:08:36', '2025-11-19 21:09:03', '2025-11-19 21:09:03', NULL),
(725, 184, 'expense', 'manual', 220.00, 'Food', NULL, NULL, 0, 0, '2025-11-19 21:08:37', '2025-11-19 21:08:50', '2025-11-19 21:08:50', NULL),
(726, 227, 'expense', 'voice', 80.00, 'نس', 'ب 80 جنيه نس', 2.00, 0, 0, '2025-11-19 21:12:58', '2025-11-19 21:12:58', '2025-11-25 19:50:20', NULL),
(727, 227, 'expense', 'voice', 5.00, 'سميه', 'سميه ب 5 جنيه', 2.00, 0, 0, '2025-11-19 21:13:08', '2025-11-19 21:13:08', '2025-11-25 19:50:20', NULL),
(728, 227, 'expense', 'voice', 0.25, 'جنيه', 'ربع جنيه', 2.00, 0, 0, '2025-11-19 21:13:19', '2025-11-19 21:13:19', '2025-11-25 19:50:20', NULL),
(729, 227, 'expense', 'voice', 0.25, 'زيد', 'زيد بربع جنيه', 2.00, 0, 0, '2025-11-19 21:13:28', '2025-11-19 21:13:28', '2025-11-25 19:50:20', NULL),
(730, 227, 'expense', 'voice', 14.00, 'سميه', 'سميه 14 قرش', 3.00, 0, 0, '2025-11-19 21:13:37', '2025-11-19 21:13:37', '2025-11-25 19:50:20', NULL),
(731, 210, 'expense', 'voice', 9.00, 'مواصلات', '9 جنيه مواصلات', 9.00, 0, 0, '2025-11-19 21:19:43', '2025-11-19 21:19:43', '2025-11-25 19:50:20', NULL),
(733, 210, 'expense', 'voice', 120.00, 'عشاء', 'ودفعت 120 جنيه عشاء', 4.00, 0, 0, '2025-11-19 21:19:59', '2025-11-19 21:19:59', '2025-11-25 19:50:20', NULL),
(735, 210, 'expense', 'voice', 60.00, 'كووركينج سبيس', 'انا دفعت 60 جنيه في كوركينج سبي', 3.00, 0, 0, '2025-11-19 21:21:32', '2025-11-20 09:59:48', '2025-11-25 19:50:20', NULL),
(736, 213, 'income', 'manual', 40000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 04:58:38', '2025-11-20 06:58:30', '2025-11-20 04:58:38', NULL),
(737, 213, 'expense', 'manual', 32900.00, '7alan', NULL, NULL, 0, 0, '2025-11-20 04:58:49', '2025-11-20 04:58:49', '2025-11-20 04:58:49', NULL),
(738, 213, 'expense', 'manual', 4000.00, 'rokaya', NULL, NULL, 0, 0, '2025-11-20 04:58:58', '2025-11-20 04:58:58', '2025-11-20 04:58:58', NULL),
(739, 213, 'expense', 'manual', 575.00, 'chocolat ', NULL, NULL, 0, 0, '2025-11-20 04:59:05', '2025-11-20 04:59:05', '2025-11-20 04:59:05', NULL),
(740, 213, 'expense', 'manual', 300.00, 'breakfast ', NULL, NULL, 0, 0, '2025-11-20 04:59:37', '2025-11-20 04:59:37', '2025-11-20 04:59:37', NULL),
(743, 182, 'income', 'manual', 440.00, NULL, NULL, NULL, 0, 0, '2025-11-20 05:55:00', '2025-11-20 07:54:53', '2025-11-20 05:55:00', NULL),
(744, 210, 'income', 'manual', 95.00, NULL, NULL, NULL, 0, 0, '2025-11-20 07:49:00', '2025-11-20 09:48:56', '2025-11-20 07:49:00', NULL),
(745, 210, 'expense', 'voice', 30.00, 'سكوتر', '30 جنيه سكوتر', 3.00, 0, 0, '2025-11-20 07:49:09', '2025-11-20 07:49:09', '2025-11-25 19:50:20', NULL),
(750, 225, 'expense', 'voice', 20.00, '-', '20', 3.00, 0, 0, '2025-11-20 08:23:08', '2025-11-20 08:23:08', '2025-11-25 19:50:20', NULL),
(751, 225, 'expense', 'voice', 10.00, 'فول', '10 جنيه فول', 8.00, 0, 0, '2025-11-20 08:23:40', '2025-11-20 08:23:40', '2025-11-25 19:50:20', NULL),
(752, 232, 'expense', 'voice', 50000.00, 'فلوسي', 'صرفت 50,000 اليوم من فلوسي وصرفت 200 ريال مواصلات و200 ريال صدقه', 25.00, 0, 0, '2025-11-20 08:24:03', '2025-11-20 08:24:03', '2025-11-25 19:50:20', NULL),
(753, 232, 'expense', 'voice', 200.00, 'مواصلات', 'صرفت 50,000 اليوم من فلوسي وصرفت 200 ريال مواصلات و200 ريال صدقه', 25.00, 0, 0, '2025-11-20 08:24:03', '2025-11-20 08:24:03', '2025-11-25 19:50:20', NULL),
(754, 232, 'expense', 'voice', 200.00, 'صدقة', 'صرفت 50,000 اليوم من فلوسي وصرفت 200 ريال مواصلات و200 ريال صدقه', 25.00, 0, 0, '2025-11-20 08:24:03', '2025-11-20 08:24:03', '2025-11-25 19:50:20', NULL),
(755, 232, 'income', 'manual', 200000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 08:24:38', '2025-11-20 11:24:30', '2025-11-20 08:24:38', NULL),
(756, 232, 'income', 'manual', 5000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 08:29:30', '2025-11-20 11:29:19', '2025-11-20 08:29:30', NULL),
(757, 220, 'expense', 'voice', 100.00, 'uber', '‏100 جنيه و', 1.00, 0, 0, '2025-11-20 08:34:40', '2025-11-20 08:34:52', '2025-11-25 19:50:20', NULL),
(759, 233, 'income', 'manual', 200000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 08:53:34', '2025-11-20 11:53:27', '2025-11-20 08:53:34', NULL),
(760, 233, 'expense', 'voice', 25000.00, '-', 'حصلت على 25,000 ريال', 3.00, 0, 0, '2025-11-20 08:54:13', '2025-11-20 08:54:13', '2025-11-25 19:50:20', NULL),
(761, 233, 'expense', 'voice', 25.00, '-', 'حصلت على 25 جنيه', 6.00, 0, 0, '2025-11-20 08:55:16', '2025-11-20 08:55:16', '2025-11-25 19:50:20', NULL),
(762, 233, 'expense', 'manual', 30000.00, 'تبرعات', NULL, NULL, 0, 0, '2025-11-20 08:56:10', '2025-11-20 08:56:10', '2025-11-20 08:56:10', NULL),
(763, 233, 'income', 'manual', 100000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 08:57:21', '2025-11-20 11:56:50', '2025-11-20 08:57:21', NULL),
(764, 182, 'expense', 'voice', 60.00, 'السوق ماركت', '‏صرفت 60 جنيه في السوق ماركت بتاع', 4.00, 0, 0, '2025-11-20 09:03:45', '2025-11-20 09:03:45', '2025-11-25 19:50:20', NULL),
(765, 210, 'expense', 'voice', 200.00, 'باقة النت', 'دفعت 200 جنيه في باقه النت', 3.00, 0, 0, '2025-11-20 09:10:37', '2025-11-20 09:10:37', '2025-11-25 19:50:20', NULL),
(769, 182, 'expense', 'manual', 30.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-20 09:34:25', '2025-11-20 09:34:34', '2025-11-20 09:34:34', NULL),
(770, 230, 'income', 'manual', 15.00, NULL, NULL, NULL, 0, 0, '2025-11-20 09:40:09', '2025-11-20 11:39:59', '2025-11-20 09:40:09', NULL),
(771, 167, 'expense', 'voice', 80.00, 'وثمانين جنيه على حلويات', '‏صرفت امبارح 80 جنيه علشان وثمانين جنيه على حلويات', 11.00, 0, 0, '2025-11-20 12:41:28', '2025-11-20 12:41:28', '2025-11-25 19:50:20', NULL),
(773, 167, 'expense', 'voice', 80.00, 'كباية شاي', '‏80 جنيه على كباية شاي', 3.00, 0, 0, '2025-11-20 12:41:56', '2025-11-20 12:41:56', '2025-11-25 19:50:20', NULL),
(774, 220, 'expense', 'voice', 300.00, 'فطار', '‏300 فطار', 2.00, 0, 0, '2025-11-20 13:19:08', '2025-11-20 13:19:08', '2025-11-25 19:50:20', NULL),
(775, 220, 'expense', 'voice', 600.00, 'مشتريات من المعرض', '‏600 مشتريات من المعرض', 3.00, 0, 0, '2025-11-20 13:19:14', '2025-11-20 13:19:14', '2025-11-25 19:50:20', NULL),
(777, 184, 'income', 'manual', 3120.00, NULL, NULL, NULL, 0, 0, '2025-11-20 13:28:48', '2025-11-20 15:28:42', '2025-11-20 13:28:48', NULL),
(778, 184, 'expense', 'manual', 75.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-20 13:29:00', '2025-11-20 13:29:15', '2025-11-20 13:29:15', NULL),
(779, 220, 'expense', 'voice', 115.00, 'اوبر', '‏115 وبر', 3.00, 0, 0, '2025-11-20 13:55:43', '2025-11-20 13:55:53', '2025-11-25 19:50:20', NULL),
(780, 184, 'expense', 'manual', 380.00, 'couffier ', NULL, NULL, 0, 0, '2025-11-20 15:02:18', '2025-11-20 15:02:27', '2025-11-20 15:02:27', NULL),
(781, 184, 'expense', 'manual', 50.00, 'coffee ', NULL, NULL, 0, 0, '2025-11-20 15:02:35', '2025-11-20 15:02:48', '2025-11-20 15:02:48', NULL),
(782, 184, 'expense', 'manual', 85.00, 'coffee', NULL, NULL, 0, 0, '2025-11-20 15:06:06', '2025-11-20 15:06:16', '2025-11-20 15:06:16', NULL),
(783, 237, 'expense', 'voice', 10.00, '-', '10', 1.00, 0, 0, '2025-11-20 15:44:08', '2025-11-20 15:44:08', '2025-11-25 19:50:20', NULL),
(789, 238, 'expense', 'voice', 5.00, 'مواصلات', '‏خمسة جنيه مواصلات 10 جنيه موية 20 جنيه فول', 6.00, 0, 0, '2025-11-20 15:54:56', '2025-11-20 15:54:56', '2025-11-25 19:50:20', NULL),
(790, 238, 'expense', 'voice', 10.00, 'مياه', '‏خمسة جنيه مواصلات 10 جنيه موية 20 جنيه فول', 6.00, 0, 0, '2025-11-20 15:54:56', '2025-11-20 15:54:56', '2025-11-25 19:50:20', NULL),
(791, 238, 'expense', 'voice', 20.00, 'فول', '‏خمسة جنيه مواصلات 10 جنيه موية 20 جنيه فول', 6.00, 0, 0, '2025-11-20 15:54:56', '2025-11-20 15:54:56', '2025-11-25 19:50:20', NULL),
(792, 238, 'expense', 'voice', 200.00, 'شغل', '‏أنا دفعت 200 جنيه شغل', 5.00, 0, 0, '2025-11-20 15:55:17', '2025-11-20 15:55:17', '2025-11-25 19:50:20', NULL),
(793, 238, 'income', 'manual', 10000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 15:55:43', '2025-11-20 17:55:30', '2025-11-20 15:55:43', NULL),
(795, 238, 'expense', 'voice', 7000.00, 'مرتب شهر', '‏7000 جنيه الشهر', 3.00, 0, 0, '2025-11-20 15:56:42', '2025-11-20 15:56:42', '2025-11-25 19:50:20', NULL),
(796, 210, 'expense', 'voice', 15.00, 'اتوبيس', 'دفعت 15 جنيه اتوبيس 51 جنيه عصير', 6.00, 0, 0, '2025-11-20 16:33:45', '2025-11-20 16:33:45', '2025-11-25 19:50:20', NULL),
(797, 210, 'expense', 'voice', 51.00, 'عصير', 'دفعت 15 جنيه اتوبيس 51 جنيه عصير', 6.00, 0, 0, '2025-11-20 16:33:45', '2025-11-20 16:33:45', '2025-11-25 19:50:20', NULL),
(798, 210, 'expense', 'voice', 0.50, 'تحويل انستا باي', 'نص جنيه تحويل انستا باي', 3.00, 0, 0, '2025-11-20 16:35:54', '2025-11-20 16:35:54', '2025-11-25 19:50:20', NULL),
(800, 210, 'expense', 'voice', 5.00, 'فرق السحب', 'في 5 جنيه اتخصمت في فرقه فرق السحب', 6.00, 0, 0, '2025-11-20 17:19:06', '2025-11-20 17:19:06', '2025-11-25 19:50:20', NULL),
(801, 230, 'income', 'manual', 100.00, NULL, NULL, NULL, 0, 0, '2025-11-20 17:30:26', '2025-11-20 19:30:16', '2025-11-20 17:30:26', NULL),
(809, 192, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-20 17:39:56', '2025-11-20 17:39:56', '2025-11-20 17:39:56', NULL),
(813, 192, 'expense', 'voice', 100.00, 'الأكل', '‏أنا صرفت 100 جنيه النهارده في الأكل', 3.00, 0, 0, '2025-11-20 17:41:04', '2025-11-20 17:41:04', '2025-11-25 19:50:20', NULL),
(814, 192, 'expense', 'voice', 0.00, '-', '‏هاي apps Pinto Andre Boz Eating توداي', 4.00, 0, 0, '2025-11-20 17:41:23', '2025-11-20 17:41:23', '2025-11-25 19:50:20', NULL),
(815, 192, 'expense', 'voice', 100.00, 'الصيدلية', '‏صرفت 100 جنيه النهارده في الصيدلية', 3.00, 0, 0, '2025-11-20 17:41:47', '2025-11-20 17:41:47', '2025-11-25 19:50:20', NULL),
(816, 192, 'expense', 'voice', 200.00, 'بنزين', '‏صرفت 100 جنيه النهارده في البنزين', 3.00, 0, 0, '2025-11-20 17:41:59', '2025-11-23 12:03:23', '2025-11-25 19:50:20', NULL),
(817, 192, 'expense', 'voice', 52.00, 'بنزين', '‏صرفت 52 جنيه النهارده بنزين', 3.00, 0, 0, '2025-11-20 17:42:09', '2025-11-20 17:42:09', '2025-11-25 19:50:20', NULL);
INSERT INTO `transaction` (`id`, `user_id`, `type`, `insertion_type`, `amount`, `category`, `description`, `duration`, `updates_count`, `is_deleted`, `created_at`, `activated_at`, `updated_at`, `deleted_at`) VALUES
(818, 192, 'income', 'manual', 1000.00, NULL, NULL, NULL, 0, 0, '2025-11-20 17:42:49', '2025-11-01 00:00:00', '2025-11-20 17:42:49', NULL),
(819, 210, 'expense', 'manual', 90.00, 'اكل في القطار', NULL, NULL, 0, 0, '2025-11-20 18:18:26', '2025-11-20 18:18:26', '2025-11-20 18:18:26', NULL),
(820, 240, 'expense', 'voice', 245.00, 'Noon order ', 'دفعت 245', 17.00, 0, 0, '2025-11-20 18:28:53', '2025-11-20 18:30:39', '2025-11-25 19:50:20', NULL),
(822, 240, 'expense', 'voice', 50.00, 'مواصلات', 'هات غير 50 جنيه مواصلات', 9.00, 0, 0, '2025-11-20 18:29:25', '2025-11-20 18:29:25', '2025-11-25 19:50:20', NULL),
(824, 242, 'expense', 'voice', 50.00, 'مواصلات', 'انا خرجت النهارده صرفت 50 جنيه مواصلات ودفعت اوردر نون 245 جنيه', 11.00, 0, 0, '2025-11-20 18:32:04', '2025-11-20 18:32:04', '2025-11-25 19:50:20', NULL),
(825, 242, 'expense', 'voice', 245.00, 'اوردر نون', 'انا خرجت النهارده صرفت 50 جنيه مواصلات ودفعت اوردر نون 245 جنيه', 11.00, 0, 0, '2025-11-20 18:32:04', '2025-11-20 18:32:04', '2025-11-25 19:50:20', NULL),
(827, 229, 'expense', 'voice', 30.00, 'مواصلات', '‏30 جنيه مواصلات 20 جنيه Sean شيبسي بس كده', 25.00, 0, 0, '2025-11-20 18:52:17', '2025-11-20 18:53:15', '2025-11-25 19:50:20', NULL),
(828, 229, 'expense', 'voice', 20.00, 'Sean شيبسي', '‏30 جنيه مواصلات 20 جنيه Sean شيبسي بس كده', 25.00, 0, 0, '2025-11-20 18:52:17', '2025-11-20 18:52:17', '2025-11-25 19:50:20', NULL),
(830, 229, 'income', 'manual', 500.00, NULL, NULL, NULL, 0, 0, '2025-11-20 18:53:05', '2025-11-20 20:53:01', '2025-11-20 18:53:05', NULL),
(831, 210, 'expense', 'voice', 180.00, 'تذكرة سوبر جيت', '180 جنيه تذكره سوبر جيت و 100 جنيه حلاقه', 5.00, 0, 0, '2025-11-20 18:54:30', '2025-11-20 18:54:30', '2025-11-25 19:50:20', NULL),
(832, 210, 'expense', 'voice', 100.00, 'حلاقة', '180 جنيه تذكره سوبر جيت و 100 جنيه حلاقه', 5.00, 0, 0, '2025-11-20 18:54:30', '2025-11-20 18:54:30', '2025-11-25 19:50:20', NULL),
(834, 210, 'expense', 'voice', 34.00, 'مواصلات للعجمي', '34 جنيه مواصلات للعجمي', 3.00, 0, 0, '2025-11-20 20:09:09', '2025-11-20 20:09:09', '2025-11-25 19:50:20', NULL),
(835, 210, 'expense', 'voice', 5.00, 'تونايه', '5 جنيه تونايه لاخر الشارع', 4.00, 0, 0, '2025-11-20 21:24:08', '2025-11-20 21:24:08', '2025-11-25 19:50:20', NULL),
(836, 210, 'expense', 'voice', 150.00, 'عشاء', '140 جنيه عشاء', 2.00, 0, 0, '2025-11-20 21:38:03', '2025-11-20 21:50:03', '2025-11-25 19:50:20', NULL),
(837, 210, 'expense', 'voice', 10.00, 'عيش', 'و 10 جنيه عيش', 6.00, 0, 0, '2025-11-20 21:38:16', '2025-11-20 21:38:16', '2025-11-25 19:50:20', NULL),
(838, 210, 'expense', 'voice', 20.00, 'مياه', 'و 20 جنيه مياه و 15 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-20 21:38:26', '2025-11-20 21:38:26', '2025-11-25 19:50:20', NULL),
(839, 210, 'expense', 'voice', 15.00, 'حاجه ساقعه', 'و 20 جنيه مياه و 15 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-20 21:38:26', '2025-11-20 21:38:26', '2025-11-25 19:50:20', NULL),
(840, 220, 'expense', 'voice', 1000.00, 'صداقة', '‏1000 جنيه صداقة', 2.00, 0, 0, '2025-11-20 21:47:33', '2025-11-20 21:47:33', '2025-11-25 19:50:20', NULL),
(842, 248, 'income', 'manual', 1700.00, NULL, NULL, NULL, 0, 0, '2025-11-20 22:26:41', '2025-11-21 00:26:38', '2025-11-20 22:26:41', NULL),
(847, 184, 'expense', 'manual', 245.00, 'medicine ', NULL, NULL, 0, 0, '2025-11-21 00:08:19', '2025-11-21 00:08:27', '2025-11-21 00:08:27', NULL),
(848, 184, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-21 00:08:21', '2025-11-21 00:08:21', '2025-11-21 00:08:21', NULL),
(849, 213, 'expense', 'manual', 300.00, 'charity ', NULL, NULL, 0, 0, '2025-11-21 09:55:05', '2025-11-21 09:55:05', '2025-11-21 09:55:05', NULL),
(855, 182, 'expense', 'manual', 55.00, 'cash', NULL, NULL, 0, 0, '2025-11-21 14:49:27', '2025-11-21 14:49:45', '2025-11-21 14:49:45', NULL),
(858, 210, 'expense', 'voice', 15.00, 'عصير قصب', '15 جنيه عصير قصب وخمسه جنيه تو', 6.00, 0, 0, '2025-11-21 15:07:19', '2025-11-21 15:07:19', '2025-11-25 19:50:20', NULL),
(862, 210, 'expense', 'voice', 5.00, 'مواصلات', 'يا عم 5 جنيه مواصلات يا عم', 2.00, 0, 0, '2025-11-21 15:07:51', '2025-11-21 15:07:51', '2025-11-25 19:50:20', NULL),
(863, 184, 'income', 'manual', 500.00, NULL, NULL, NULL, 0, 0, '2025-11-21 15:17:10', '2025-11-21 17:17:06', '2025-11-21 15:17:10', NULL),
(864, 184, 'income', 'manual', 310.00, NULL, NULL, NULL, 0, 0, '2025-11-21 15:17:20', '2025-11-21 17:17:18', '2025-11-21 15:17:20', NULL),
(865, 184, 'expense', 'manual', 30.00, 'printer files', NULL, NULL, 0, 0, '2025-11-21 15:17:29', '2025-11-21 15:18:29', '2025-11-21 15:18:29', NULL),
(866, 184, 'expense', 'manual', 310.00, 'credit ', NULL, NULL, 0, 0, '2025-11-21 15:17:39', '2025-11-21 15:17:53', '2025-11-21 15:17:53', NULL),
(867, 184, 'expense', 'manual', 175.00, 'candy kids ', NULL, NULL, 0, 0, '2025-11-21 15:17:40', '2025-11-21 15:18:07', '2025-11-21 15:18:07', NULL),
(868, 184, 'income', 'manual', 85.00, NULL, NULL, NULL, 0, 0, '2025-11-21 15:18:40', '2025-11-21 17:18:36', '2025-11-21 15:18:40', NULL),
(869, 184, 'expense', 'manual', 85.00, 'coffee', NULL, NULL, 0, 0, '2025-11-21 15:18:48', '2025-11-21 15:22:09', '2025-11-21 15:22:09', NULL),
(870, 184, 'expense', 'manual', 80.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-21 15:18:52', '2025-11-21 15:19:14', '2025-11-21 15:19:14', NULL),
(871, 184, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-21 15:18:53', '2025-11-21 15:18:53', '2025-11-21 15:18:53', NULL),
(872, 184, 'expense', 'manual', 85.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-21 15:19:27', '2025-11-21 15:34:35', '2025-11-21 15:34:35', NULL),
(873, 184, 'expense', 'manual', 5.00, 'tissues', NULL, NULL, 0, 0, '2025-11-21 15:20:07', '2025-11-21 15:20:15', '2025-11-21 15:20:15', NULL),
(874, 184, 'expense', 'manual', 150.00, 'al amod', NULL, NULL, 0, 0, '2025-11-21 15:22:32', '2025-11-21 15:22:45', '2025-11-21 15:22:45', NULL),
(875, 210, 'expense', 'manual', 2.00, 'مناديل ', NULL, NULL, 0, 0, '2025-11-21 15:31:40', '2025-11-21 15:31:40', '2025-11-21 15:31:40', NULL),
(876, 210, 'expense', 'manual', 17.00, 'مواصلات', NULL, NULL, 0, 0, '2025-11-21 15:31:56', '2025-11-21 15:31:56', '2025-11-21 15:31:56', NULL),
(878, 210, 'expense', 'voice', 135.00, 'اكل من بردى', '135 اكل من بره', 3.00, 0, 0, '2025-11-21 19:10:41', '2025-11-21 19:10:54', '2025-11-25 19:50:20', NULL),
(879, 210, 'expense', 'voice', 22.00, 'مواصلات', 'ايه يا معلم ركبت مواصلات النهارده ب 22 جنيه', 5.00, 0, 0, '2025-11-21 19:59:39', '2025-11-21 19:59:39', '2025-11-25 19:50:20', NULL),
(882, 210, 'expense', 'voice', 180.00, 'تذكرة سوبر جيت لمجدي', 'لسه ما دفعت 180 جنيه تذكره سوبر جيت لمجدي', 6.00, 0, 0, '2025-11-21 20:09:07', '2025-11-21 20:09:19', '2025-11-25 19:50:20', NULL),
(883, 210, 'expense', 'voice', 15.00, 'عصير قصب', '15 جنيه عصير قصب تاني', 3.00, 0, 0, '2025-11-21 20:14:58', '2025-11-21 20:14:58', '2025-11-25 19:50:20', NULL),
(884, 184, 'income', 'manual', 110.00, NULL, NULL, NULL, 0, 0, '2025-11-21 20:22:36', '2025-11-21 22:22:24', '2025-11-21 20:22:36', NULL),
(885, 184, 'expense', 'manual', 365.00, 'others ', NULL, NULL, 0, 0, '2025-11-21 20:27:36', '2025-11-21 20:27:45', '2025-11-21 20:27:45', NULL),
(886, 215, 'expense', 'voice', 400.00, '-', 'صرفت 400 جنيه جبت', 3.00, 0, 0, '2025-11-21 20:37:57', '2025-11-21 20:37:57', '2025-11-25 19:50:20', NULL),
(887, 215, 'expense', 'voice', 400.00, 'دول', 'شيل 400 دول', 5.00, 0, 0, '2025-11-21 20:38:18', '2025-11-21 20:38:18', '2025-11-25 19:50:20', NULL),
(888, 230, 'income', 'manual', 70.00, NULL, NULL, NULL, 0, 0, '2025-11-21 20:48:54', '2025-11-21 22:48:45', '2025-11-21 20:48:54', NULL),
(889, 210, 'expense', 'voice', 30.00, 'خروب', '30 جنيه خروب', 4.00, 0, 0, '2025-11-21 21:13:10', '2025-11-21 21:13:10', '2025-11-25 19:50:20', NULL),
(890, 210, 'expense', 'voice', 5.00, 'مواصلات', 'ما تجيب خمسه جنيه مواصلات', 3.00, 0, 0, '2025-11-21 21:13:29', '2025-11-21 21:13:29', '2025-11-25 19:50:20', NULL),
(891, 256, 'expense', 'voice', 5.00, 'بطاطس', '5 جنيه بطاطس', 3.00, 0, 0, '2025-11-22 09:19:10', '2025-11-22 09:19:10', '2025-11-25 19:50:20', NULL),
(892, 256, 'expense', 'voice', 24.00, 'بطاطس', '24 جنيه بطاطس', 3.00, 0, 0, '2025-11-22 09:29:43', '2025-11-22 09:29:43', '2025-11-25 19:50:20', NULL),
(893, 257, 'expense', 'voice', 15.00, 'كيس لسان عصفور', 'امبارح صرفت 15 جنيه على كيس لسان عصفور', 25.00, 0, 0, '2025-11-22 10:20:03', '2025-11-22 10:20:03', '2025-11-25 19:50:20', NULL),
(894, 257, 'expense', 'voice', 28.00, 'كيس قلقاس مجمد', 'وصرفت 28 جنيه على كيس قلقاس مجمد', 15.00, 0, 0, '2025-11-22 10:20:15', '2025-11-22 10:20:15', '2025-11-25 19:50:20', NULL),
(895, 257, 'expense', 'voice', 1500.00, 'قبض', 'وقبضت 1500 جنيه', 13.00, 0, 0, '2025-11-22 10:20:32', '2025-11-22 10:20:46', '2025-11-25 19:50:20', NULL),
(900, 260, 'expense', 'voice', 360.00, '-', '‏تلتمية وستين جنيه اللي عليك', 1.00, 0, 0, '2025-11-22 12:38:55', '2025-11-22 12:38:55', '2025-11-25 19:50:20', NULL),
(904, 218, 'expense', 'voice', 1.50, 'عصير تفاح', 'درهم ونص عصير تفاح', 3.00, 0, 0, '2025-11-22 12:51:54', '2025-11-22 12:51:54', '2025-11-25 19:50:20', NULL),
(905, 218, 'expense', 'voice', 4.50, 'ساندوتش', '4:30 ساندوتش', 5.00, 0, 0, '2025-11-22 12:52:14', '2025-11-22 12:52:14', '2025-11-25 19:50:20', NULL),
(907, 218, 'expense', 'voice', 2.00, 'تشيكن رول', 'درهمين تشيكن رول', 2.00, 0, 0, '2025-11-22 12:53:19', '2025-11-22 12:53:19', '2025-11-25 19:50:20', NULL),
(908, 187, 'expense', 'voice', 160.00, 'بدل', '‏مبارح صرفت 160 جنيه بدل وأربعين جنيه مسعد صرفت 80 جنيه 10', 16.00, 0, 0, '2025-11-22 13:39:31', '2025-11-22 13:39:31', '2025-11-25 19:50:20', NULL),
(909, 187, 'expense', 'voice', 40.00, 'مسعد', '‏مبارح صرفت 160 جنيه بدل وأربعين جنيه مسعد صرفت 80 جنيه 10', 16.00, 0, 0, '2025-11-22 13:39:31', '2025-11-22 13:39:31', '2025-11-25 19:50:20', NULL),
(910, 187, 'expense', 'voice', 80.00, 'NULL', '‏مبارح صرفت 160 جنيه بدل وأربعين جنيه مسعد صرفت 80 جنيه 10', 16.00, 0, 0, '2025-11-22 13:39:31', '2025-11-22 13:39:31', '2025-11-25 19:50:20', NULL),
(911, 187, 'expense', 'voice', 10.00, 'NULL', '‏مبارح صرفت 160 جنيه بدل وأربعين جنيه مسعد صرفت 80 جنيه 10', 16.00, 0, 0, '2025-11-22 13:39:31', '2025-11-22 13:39:31', '2025-11-25 19:50:20', NULL),
(914, 189, 'expense', 'voice', 5.00, 'فول', 'ب 5 جنيه فول و 5 جنيه فلا', 3.00, 0, 0, '2025-11-22 13:41:12', '2025-11-22 13:41:12', '2025-11-25 19:50:20', NULL),
(915, 189, 'expense', 'voice', 5.00, 'فلافل', 'ب 5 جنيه فول و 5 جنيه فلا', 3.00, 0, 0, '2025-11-22 13:41:12', '2025-11-22 13:41:12', '2025-11-25 19:50:20', NULL),
(920, 189, 'expense', 'voice', 5.00, 'حاجة ساقعة', 'اشتري ب 10 جنيه عيش و 5 جنيه فول وخمسه جنيه فلافل وخمسه جنيه فينو 5 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-22 13:41:21', '2025-11-22 13:41:21', '2025-11-25 19:50:20', NULL),
(921, 189, 'expense', 'voice', 5.00, 'فول', 'المشكله ب 5 جنيه فول وخمسه جنيه فلافل وخمسه جنيه حاجه ساعه وخمسه جنيه عيش', 4.00, 0, 0, '2025-11-22 13:41:33', '2025-11-22 13:41:33', '2025-11-25 19:50:20', NULL),
(927, 189, 'expense', 'voice', 5.00, 'فول', 'ب 5 جنيه فول وخمسه جنيه فلافل 5 جنيه حاجه سعرها 5 جنيه', 4.00, 0, 0, '2025-11-22 13:42:36', '2025-11-22 13:42:36', '2025-11-25 19:50:20', NULL),
(928, 189, 'expense', 'voice', 5.00, 'فلافل', 'ب 5 جنيه فول وخمسه جنيه فلافل 5 جنيه حاجه سعرها 5 جنيه', 4.00, 0, 0, '2025-11-22 13:42:36', '2025-11-22 13:42:36', '2025-11-25 19:50:20', NULL),
(930, 187, 'expense', 'voice', 10.00, 'مواصلات', '‏10 جنيه مواصلات', 2.00, 0, 0, '2025-11-22 13:44:19', '2025-11-22 13:44:19', '2025-11-25 19:50:20', NULL),
(931, 187, 'expense', 'voice', 40.00, '10', '‏40 جنيه 10', 2.00, 0, 0, '2025-11-22 13:44:27', '2025-11-22 13:44:27', '2025-11-25 19:50:20', NULL),
(932, 187, 'expense', 'voice', 40.00, '10', '‏40 جنيه 10', 2.00, 0, 0, '2025-11-22 13:44:36', '2025-11-22 13:44:36', '2025-11-25 19:50:20', NULL),
(933, 187, 'expense', 'voice', 20.00, 'غداء', '‏200 جنيه غداء', 3.00, 0, 0, '2025-11-22 13:45:07', '2025-11-22 13:45:07', '2025-11-25 19:50:20', NULL),
(934, 187, 'expense', 'voice', 50.00, 'كورة', '‏50 جنيه حجز كورة', 2.00, 0, 0, '2025-11-22 13:45:31', '2025-11-22 13:45:31', '2025-11-25 19:50:20', NULL),
(935, 187, 'expense', 'voice', 300.00, 'أوردر اونلاين', '‏300 جنيه أوردر اونلاين', 3.00, 0, 0, '2025-11-22 13:45:57', '2025-11-22 13:45:57', '2025-11-25 19:50:20', NULL),
(936, 187, 'expense', 'voice', 200.00, 'بنزين', '‏حطيت بنزين بمئتين جنيه', 2.00, 0, 0, '2025-11-22 13:46:18', '2025-11-22 13:46:18', '2025-11-25 19:50:20', NULL),
(937, 187, 'expense', 'voice', 5000.00, '-', '‏5000 جنيه معي', 2.00, 0, 0, '2025-11-22 13:47:53', '2025-11-22 13:47:53', '2025-11-25 19:50:20', NULL),
(938, 261, 'expense', 'voice', 394.00, '-', '394', 6.00, 0, 0, '2025-11-22 14:04:24', '2025-11-22 14:04:24', '2025-11-25 19:50:20', NULL),
(939, 261, 'expense', 'voice', 0.00, 'اوردر', 'دلوقتي انا دفعت اوردر النهارده', 7.00, 0, 0, '2025-11-22 14:05:49', '2025-11-22 14:05:49', '2025-11-25 19:50:20', NULL),
(945, 263, 'income', 'manual', 5000.00, NULL, NULL, NULL, 0, 0, '2025-11-22 14:59:25', '2025-11-22 16:59:19', '2025-11-22 14:59:25', NULL),
(946, 264, 'expense', 'voice', 90.00, 'قهوة', '‏90 جنيه قهوة', 6.00, 0, 0, '2025-11-22 15:01:21', '2025-11-22 15:01:21', '2025-11-25 19:50:20', NULL),
(950, 210, 'expense', 'voice', 5.00, 'مواصلات', 'مواصلات ب 5', 2.00, 0, 0, '2025-11-22 15:23:09', '2025-11-22 15:23:09', '2025-11-25 19:50:20', NULL),
(951, 266, 'expense', 'manual', 65.00, 'gsss', NULL, NULL, 0, 0, '2025-11-22 15:43:41', '2025-11-22 15:43:41', '2025-11-22 15:43:41', NULL),
(952, 266, 'expense', 'manual', 68.00, 'xcd', NULL, NULL, 0, 0, '2025-11-22 15:44:02', '2025-11-22 15:44:02', '2025-11-22 15:44:02', NULL),
(953, 210, 'expense', 'voice', 15.00, 'خروب', 'بص يا معلم انا جبت 15 خروب ركبت مواصلات ب 11:30', 6.00, 0, 0, '2025-11-22 15:56:51', '2025-11-22 15:56:51', '2025-11-25 19:50:20', NULL),
(954, 210, 'expense', 'voice', 11.50, 'مواصلات', 'بص يا معلم انا جبت 15 خروب ركبت مواصلات ب 11:30', 6.00, 0, 0, '2025-11-22 15:56:51', '2025-11-22 15:56:51', '2025-11-25 19:50:20', NULL),
(955, 270, 'expense', 'manual', 66.00, 'vbf', NULL, NULL, 0, 0, '2025-11-22 16:12:58', '2025-11-22 16:12:58', '2025-11-22 16:12:58', NULL),
(959, 259, 'expense', 'voice', 25.00, 'مواصلات', '25 جنيه مواصلات', 2.00, 0, 0, '2025-11-22 16:38:47', '2025-11-22 16:38:47', '2025-11-25 19:50:20', NULL),
(960, 259, 'expense', 'voice', 15.00, 'باتيه', '15 جنيه باتيه', 2.00, 0, 0, '2025-11-22 16:38:54', '2025-11-22 16:38:54', '2025-11-25 19:50:20', NULL),
(961, 259, 'expense', 'voice', 10.00, 'شيبسي', '10 جنيه شيبسي', 2.00, 0, 0, '2025-11-22 16:39:07', '2025-11-22 16:39:07', '2025-11-25 19:50:20', NULL),
(962, 259, 'expense', 'voice', 90.00, 'جاتوه', '90 جنيه جاتوه', 4.00, 0, 0, '2025-11-22 16:52:37', '2025-11-22 16:52:37', '2025-11-25 19:50:20', NULL),
(963, 259, 'expense', 'voice', 10.00, 'زبادي', '10 جنيه زبادي', 2.00, 0, 0, '2025-11-22 16:52:44', '2025-11-22 16:52:44', '2025-11-25 19:50:20', NULL),
(968, 272, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-22 17:17:04', '2025-11-22 17:17:04', '2025-11-22 17:17:04', NULL),
(969, 210, 'income', 'manual', 450.00, NULL, NULL, NULL, 0, 0, '2025-11-22 17:48:51', '2025-11-22 19:48:47', '2025-11-22 17:48:51', NULL),
(982, 271, 'expense', 'manual', 688.00, 'vfdc ', NULL, NULL, 0, 0, '2025-11-22 18:15:09', '2025-11-22 18:15:09', '2025-11-22 18:15:09', NULL),
(987, 271, 'expense', 'manual', 68.00, 'gddd', NULL, NULL, 0, 0, '2025-11-22 18:21:30', '2025-11-22 18:21:30', '2025-11-22 18:21:30', NULL),
(988, 271, 'expense', 'manual', 65.00, 'gxc', NULL, NULL, 0, 0, '2025-11-22 18:21:41', '2025-11-22 18:21:41', '2025-11-22 18:21:41', NULL),
(990, 271, 'expense', 'manual', 6.00, 'ddxd', NULL, NULL, 0, 0, '2025-11-22 18:27:43', '2025-11-22 18:27:43', '2025-11-22 18:27:43', NULL),
(991, 275, 'expense', 'voice', 5.00, 'بطاطس', '‏خمسة جنيه بطاطس', 1.00, 0, 0, '2025-11-22 18:32:20', '2025-11-22 18:32:20', '2025-11-25 19:50:20', NULL),
(992, 271, 'expense', 'manual', 55.00, 'vvvvvv', NULL, NULL, 0, 0, '2025-11-22 18:37:04', '2025-11-22 18:37:04', '2025-11-22 18:37:04', NULL),
(993, 271, 'expense', 'manual', 98.00, 'gssss', NULL, NULL, 0, 0, '2025-11-22 18:37:09', '2025-11-22 18:37:09', '2025-11-22 18:37:09', NULL),
(994, 275, 'expense', 'voice', 5.00, 'فول', '‏خمسة فول خمسة جنيه وخمسة جنيه بطاطس', 4.00, 0, 0, '2025-11-22 18:43:25', '2025-11-22 18:43:25', '2025-11-25 19:50:20', NULL),
(995, 275, 'expense', 'voice', 5.00, 'جنيه', '‏خمسة فول خمسة جنيه وخمسة جنيه بطاطس', 4.00, 0, 0, '2025-11-22 18:43:25', '2025-11-22 18:43:25', '2025-11-25 19:50:20', NULL),
(996, 275, 'expense', 'voice', 5.00, 'بطاطس', '‏خمسة فول خمسة جنيه وخمسة جنيه بطاطس', 4.00, 0, 0, '2025-11-22 18:43:25', '2025-11-22 18:43:25', '2025-11-25 19:50:20', NULL),
(997, 275, 'expense', 'voice', 5.00, 'فول', '‏خمسة جنيه فول خمسة جنيه فلافل خمسة جنيه بطاطس 10 جنيه بيبسي', 7.00, 0, 0, '2025-11-22 18:44:08', '2025-11-22 18:44:08', '2025-11-25 19:50:20', NULL),
(998, 275, 'expense', 'voice', 5.00, 'فلافل', '‏خمسة جنيه فول خمسة جنيه فلافل خمسة جنيه بطاطس 10 جنيه بيبسي', 7.00, 0, 0, '2025-11-22 18:44:08', '2025-11-22 18:44:08', '2025-11-25 19:50:20', NULL),
(999, 275, 'expense', 'voice', 5.00, 'بطاطس', '‏خمسة جنيه فول خمسة جنيه فلافل خمسة جنيه بطاطس 10 جنيه بيبسي', 7.00, 0, 0, '2025-11-22 18:44:08', '2025-11-22 18:44:08', '2025-11-25 19:50:20', NULL),
(1000, 275, 'expense', 'voice', 10.00, 'بيبسي', '‏خمسة جنيه فول خمسة جنيه فلافل خمسة جنيه بطاطس 10 جنيه بيبسي', 7.00, 0, 0, '2025-11-22 18:44:08', '2025-11-22 18:44:08', '2025-11-25 19:50:20', NULL),
(1001, 276, 'expense', 'voice', 5.00, 'بطاطس', '‏امس جيب بطاطس خمسة جنيه ساعة', 4.00, 0, 0, '2025-11-22 19:11:09', '2025-11-22 19:11:09', '2025-11-25 19:50:20', NULL),
(1002, 276, 'expense', 'voice', 5.00, 'بطاطس', '‏بطاطس وخمسة جنيه حاجة ساعة', 4.00, 0, 0, '2025-11-22 19:11:18', '2025-11-22 19:11:18', '2025-11-25 19:50:20', NULL),
(1003, 276, 'expense', 'voice', 1.00, 'بطاطس', '‏امسكني بطاطس وخمسة جنيه حاجة سقعة', 4.00, 0, 0, '2025-11-22 19:11:27', '2025-11-22 19:11:27', '2025-11-25 19:50:20', NULL),
(1004, 276, 'expense', 'voice', 5.00, 'حاجة سقعة', '‏امسكني بطاطس وخمسة جنيه حاجة سقعة', 4.00, 0, 0, '2025-11-22 19:11:27', '2025-11-22 19:11:27', '2025-11-25 19:50:20', NULL),
(1005, 277, 'expense', 'voice', 1232.00, 'سماعات كمبيوتر', '‏1232 من علي اكسبرس سماعات كمبيوتر', 25.00, 0, 0, '2025-11-22 20:12:37', '2025-11-22 20:12:37', '2025-11-25 19:50:20', NULL),
(1006, 277, 'expense', 'voice', 2200.00, 'سماعات Gym', '‏دفعت برضوا سماعات Gym 2200 جنيه', 25.00, 0, 0, '2025-11-22 20:12:56', '2025-11-22 20:12:56', '2025-11-25 19:50:20', NULL),
(1008, 210, 'expense', 'voice', 200.00, 'فراخ', 'في 190 جنيه فراخ و 150 جنيه مكرونه', 7.00, 0, 0, '2025-11-22 20:14:46', '2025-11-22 20:19:24', '2025-11-25 19:50:20', NULL),
(1009, 210, 'expense', 'voice', 150.00, 'مكرونة', 'في 190 جنيه فراخ و 150 جنيه مكرونه', 7.00, 0, 0, '2025-11-22 20:14:46', '2025-11-22 20:14:46', '2025-11-25 19:50:20', NULL),
(1012, 278, 'expense', 'voice', 2200.00, 'سماعات التمرين', '‏سماعات التمرين 2200 جنيه', 12.00, 0, 0, '2025-11-22 20:15:02', '2025-11-22 20:15:02', '2025-11-25 19:50:20', NULL),
(1013, 210, 'expense', 'voice', 20.00, 'حاجة ساقعة', 'وب 20 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-22 20:15:06', '2025-11-22 20:15:06', '2025-11-25 19:50:20', NULL),
(1015, 278, 'expense', 'voice', 1232.00, 'سماعات الكمبيوتر', '‏سماعات الكمبيوتر 1232 جنيه', 13.00, 0, 0, '2025-11-22 20:15:13', '2025-11-22 20:15:13', '2025-11-25 19:50:20', NULL),
(1016, 210, 'expense', 'voice', 10.00, 'مياه', 'ب 10 جنيه ميه', 2.00, 0, 0, '2025-11-22 20:15:21', '2025-11-22 20:15:21', '2025-11-25 19:50:20', NULL),
(1017, 210, 'expense', 'voice', 15.00, 'كيكة', 'وب 15 جنيه كيكه', 3.00, 0, 0, '2025-11-22 20:15:29', '2025-11-22 20:15:29', '2025-11-25 19:50:20', NULL),
(1018, 279, 'expense', 'manual', 175.00, '5 roosters', NULL, NULL, 0, 0, '2025-11-22 20:39:03', '2025-11-22 20:39:36', '2025-11-22 20:39:36', NULL),
(1020, 230, 'income', 'manual', 105.00, NULL, NULL, NULL, 0, 0, '2025-11-22 20:47:06', '2025-11-22 22:47:00', '2025-11-22 20:47:06', NULL),
(1021, 281, 'income', 'manual', 200.00, NULL, NULL, NULL, 0, 0, '2025-11-22 21:10:03', '2025-11-22 23:09:09', '2025-11-22 21:10:03', NULL),
(1022, 281, 'expense', 'manual', 200.00, 'order', NULL, NULL, 0, 0, '2025-11-22 21:10:30', '2025-11-22 21:10:30', '2025-11-22 21:10:30', NULL),
(1023, 210, 'expense', 'voice', 145.00, '-', '145 جنيه', 4.00, 0, 0, '2025-11-22 22:03:25', '2025-11-22 22:03:25', '2025-11-25 19:50:20', NULL),
(1026, 283, 'income', 'manual', 1700.00, NULL, NULL, NULL, 0, 0, '2025-11-23 00:30:04', '2025-11-23 02:30:01', '2025-11-23 00:30:04', NULL),
(1027, 271, 'expense', 'voice', 5.00, 'بلدي', '5 جنيه بلدي وخمسه جنيه حاجه سخنه', 10.00, 0, 0, '2025-11-23 07:40:02', '2025-11-23 07:40:02', '2025-11-25 19:50:20', NULL),
(1028, 271, 'expense', 'voice', 5.00, 'حاجه سخنه', '5 جنيه بلدي وخمسه جنيه حاجه سخنه', 10.00, 0, 0, '2025-11-23 07:40:02', '2025-11-23 07:40:02', '2025-11-25 19:50:20', NULL),
(1029, 271, 'expense', 'voice', 5.00, 'حاجة ساقعة', 'طيب اشتريت ب 5 جنيه حاجه ساقعه وخمسه جنيه حاجه سخنه خمسه جنيه عيش و5 جنيه فول', 6.00, 0, 0, '2025-11-23 07:40:17', '2025-11-23 07:40:17', '2025-11-25 19:50:20', NULL),
(1030, 271, 'expense', 'voice', 5.00, 'حاجة سخنة', 'طيب اشتريت ب 5 جنيه حاجه ساقعه وخمسه جنيه حاجه سخنه خمسه جنيه عيش و5 جنيه فول', 6.00, 0, 0, '2025-11-23 07:40:17', '2025-11-23 07:40:17', '2025-11-25 19:50:20', NULL),
(1031, 271, 'expense', 'voice', 5.00, 'عيش', 'طيب اشتريت ب 5 جنيه حاجه ساقعه وخمسه جنيه حاجه سخنه خمسه جنيه عيش و5 جنيه فول', 6.00, 0, 0, '2025-11-23 07:40:17', '2025-11-23 07:40:17', '2025-11-25 19:50:20', NULL),
(1032, 271, 'expense', 'voice', 5.00, 'فول', 'طيب اشتريت ب 5 جنيه حاجه ساقعه وخمسه جنيه حاجه سخنه خمسه جنيه عيش و5 جنيه فول', 6.00, 0, 0, '2025-11-23 07:40:17', '2025-11-23 07:40:17', '2025-11-25 19:50:20', NULL),
(1035, 271, 'expense', 'voice', 5.00, 'بطاطس', '5 جنيه فولو 5 جنيه فلافل 5 جنيه بطاطس و 5 جنيه عيش فين و5 جنيه عيش بلدي', 5.00, 0, 0, '2025-11-23 07:40:30', '2025-11-23 07:40:30', '2025-11-25 19:50:20', NULL),
(1036, 271, 'expense', 'voice', 5.00, 'عيش فين', '5 جنيه فولو 5 جنيه فلافل 5 جنيه بطاطس و 5 جنيه عيش فين و5 جنيه عيش بلدي', 5.00, 0, 0, '2025-11-23 07:40:30', '2025-11-23 07:40:30', '2025-11-25 19:50:20', NULL),
(1037, 271, 'expense', 'voice', 5.00, 'عيش بلدي', '5 جنيه فولو 5 جنيه فلافل 5 جنيه بطاطس و 5 جنيه عيش فين و5 جنيه عيش بلدي', 5.00, 0, 0, '2025-11-23 07:40:30', '2025-11-23 07:40:30', '2025-11-25 19:50:20', NULL),
(1038, 271, 'expense', 'voice', 5.00, 'فينو', 'ب 5 جنيه فينو 5 جنيه عيش وخمسه جنيه بلدي و5 جنيه فول و5 جنيه فلافل وخمسه جنيه بط', 6.00, 0, 0, '2025-11-23 07:40:42', '2025-11-23 07:40:42', '2025-11-25 19:50:20', NULL),
(1039, 271, 'expense', 'voice', 5.00, 'عيش', 'ب 5 جنيه فينو 5 جنيه عيش وخمسه جنيه بلدي و5 جنيه فول و5 جنيه فلافل وخمسه جنيه بط', 6.00, 0, 0, '2025-11-23 07:40:42', '2025-11-23 07:40:42', '2025-11-25 19:50:20', NULL),
(1041, 271, 'expense', 'voice', 5.00, 'فول', 'ب 5 جنيه فينو 5 جنيه عيش وخمسه جنيه بلدي و5 جنيه فول و5 جنيه فلافل وخمسه جنيه بط', 6.00, 0, 0, '2025-11-23 07:40:42', '2025-11-23 07:40:42', '2025-11-25 19:50:20', NULL),
(1042, 271, 'expense', 'voice', 5.00, 'فلافل', 'ب 5 جنيه فينو 5 جنيه عيش وخمسه جنيه بلدي و5 جنيه فول و5 جنيه فلافل وخمسه جنيه بط', 6.00, 0, 0, '2025-11-23 07:40:42', '2025-11-23 07:40:42', '2025-11-25 19:50:20', NULL),
(1043, 271, 'expense', 'voice', 5.00, 'بط', 'ب 5 جنيه فينو 5 جنيه عيش وخمسه جنيه بلدي و5 جنيه فول و5 جنيه فلافل وخمسه جنيه بط', 6.00, 0, 0, '2025-11-23 07:40:42', '2025-11-23 07:40:42', '2025-11-25 19:50:20', NULL),
(1048, 167, 'expense', 'voice', 726.00, 'مطعم', '‏صرفت 726 جنيه في مطعم', 5.00, 0, 0, '2025-11-23 09:40:01', '2025-11-23 09:40:01', '2025-11-25 19:50:20', NULL),
(1050, 167, 'expense', 'voice', 100.00, 'اوبر', '‏ومئة جنيه وبر', 2.00, 0, 0, '2025-11-23 09:40:17', '2025-11-23 09:43:25', '2025-11-25 19:50:20', NULL),
(1051, 167, 'expense', 'voice', 180.00, 'عصير', '‏ومئة وثمانين جنيه عصير', 4.00, 0, 0, '2025-11-23 09:40:32', '2025-11-23 09:40:32', '2025-11-25 19:50:20', NULL),
(1052, 167, 'expense', 'voice', 130.00, 'قطر اسكندرية', '‏ومئة وثلاثين جنيه قطر اسكندرية', 5.00, 0, 0, '2025-11-23 09:40:49', '2025-11-23 09:40:49', '2025-11-25 19:50:20', NULL),
(1053, 167, 'expense', 'voice', 60.00, 'أجرة لمحطة القطر', '‏وستين جنيه اوبا اللي لمحطة القطر', 4.00, 0, 0, '2025-11-23 09:41:14', '2025-11-23 09:41:14', '2025-11-25 19:50:20', NULL),
(1054, 167, 'expense', 'voice', 100.00, 'حاجات حلو', '‏ومئة جنيه جبت بيوم حاجات حلو', 3.00, 0, 0, '2025-11-23 09:41:43', '2025-11-23 09:41:43', '2025-11-25 19:50:20', NULL),
(1055, 167, 'expense', 'voice', 150.00, 'شال', '‏جبت بخمس 150 جنيه شال', 5.00, 0, 0, '2025-11-23 09:42:41', '2025-11-23 09:42:41', '2025-11-25 19:50:20', NULL),
(1056, 167, 'expense', 'voice', 175.00, 'اكسسوارات', '‏وثلاث 175 جنيه أكسسوارات', 4.00, 0, 0, '2025-11-23 09:42:53', '2025-11-23 09:43:17', '2025-11-25 19:50:20', NULL),
(1057, 271, 'expense', 'voice', 5.00, 'فول', 'اشتغل ب 5 جنيه فول وخمسه جنيه فلافل 10 جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-23 10:58:10', '2025-11-23 10:58:10', '2025-11-25 19:50:20', NULL),
(1058, 271, 'expense', 'voice', 5.00, 'فلافل', 'اشتغل ب 5 جنيه فول وخمسه جنيه فلافل 10 جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-23 10:58:10', '2025-11-23 10:58:10', '2025-11-25 19:50:20', NULL),
(1059, 271, 'expense', 'voice', 10.00, 'حاجة ساقعة', 'اشتغل ب 5 جنيه فول وخمسه جنيه فلافل 10 جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-23 10:58:10', '2025-11-23 10:58:10', '2025-11-25 19:50:20', NULL),
(1060, 271, 'expense', 'voice', 10.00, 'فلافل', 'ب 10 جنيه 10 جنيه فلافل 10 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-23 10:58:29', '2025-11-23 10:58:29', '2025-11-25 19:50:20', NULL),
(1061, 271, 'expense', 'voice', 10.00, 'حاجه ساقعه', 'ب 10 جنيه 10 جنيه فلافل 10 جنيه حاجه ساقعه', 5.00, 0, 0, '2025-11-23 10:58:29', '2025-11-23 10:58:29', '2025-11-25 19:50:20', NULL),
(1063, 192, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-23 11:49:43', '2025-11-23 11:49:43', '2025-11-23 11:49:43', NULL),
(1066, 192, 'expense', 'voice', 100.00, 'الإكس', '‏امبارح صرفت 100 جنيه في الإكس', 4.00, 0, 0, '2025-11-23 12:02:18', '2025-11-23 12:02:18', '2025-11-25 19:50:20', NULL),
(1067, 192, 'expense', 'voice', 5000.00, 'سعر', '‏قال لي أنتم 5000 جنيه سعر', 5.00, 0, 0, '2025-11-23 12:03:35', '2025-11-23 12:03:35', '2025-11-25 19:50:20', NULL),
(1070, 271, 'expense', 'voice', 5.00, 'فول', '5 فول وخمسه فلافل', 16.00, 0, 0, '2025-11-23 12:22:30', '2025-11-23 12:22:30', '2025-11-25 19:50:20', NULL),
(1071, 271, 'expense', 'voice', 5.00, 'فلافل', '5 فول وخمسه فلافل', 16.00, 0, 0, '2025-11-23 12:22:30', '2025-11-23 12:22:30', '2025-11-25 19:50:20', NULL),
(1072, 271, 'expense', 'voice', 5.00, 'فولو', '5 فولو 5 فلافل', 9.00, 0, 0, '2025-11-23 12:35:39', '2025-11-23 12:35:39', '2025-11-25 19:50:20', NULL),
(1073, 271, 'expense', 'voice', 5.00, 'فلافل', '5 فولو 5 فلافل', 9.00, 0, 0, '2025-11-23 12:35:39', '2025-11-23 12:35:39', '2025-11-25 19:50:20', NULL),
(1074, 271, 'expense', 'voice', 10.00, 'دواء', '10 جنيه يشفين', 12.00, 0, 0, '2025-11-23 12:35:58', '2025-11-23 12:35:58', '2025-11-25 19:50:20', NULL),
(1076, 285, 'expense', 'manual', 95.00, 'بببب', NULL, NULL, 0, 0, '2025-11-23 12:53:26', '2025-11-23 12:53:26', '2025-11-23 12:53:26', NULL),
(1077, 287, 'expense', 'voice', 10.00, 'مياه', '10 جنيه ميه', 2.00, 0, 0, '2025-11-23 14:27:23', '2025-11-23 14:27:23', '2025-11-25 19:50:20', NULL),
(1078, 290, 'expense', 'voice', 5.00, 'مياه', '5 جنيه ميه', 1.00, 0, 0, '2025-11-23 14:51:36', '2025-11-23 14:51:36', '2025-11-25 19:50:20', NULL),
(1086, 294, 'expense', 'voice', 5.00, 'بطاطس', 'خمسه بطاطس', 2.00, 0, 0, '2025-11-23 15:48:43', '2025-11-23 15:48:43', '2025-11-25 19:50:20', NULL),
(1087, 220, 'expense', 'voice', 1000.00, 'فطار', '‏1000 جنيه فطار', 2.00, 0, 0, '2025-11-23 15:59:20', '2025-11-23 15:59:20', '2025-11-25 19:50:20', NULL),
(1088, 220, 'expense', 'voice', 50.00, 'شيبسي', '‏50 جنيه شيبسي', 1.00, 0, 0, '2025-11-23 16:05:49', '2025-11-23 16:05:49', '2025-11-25 19:50:20', NULL),
(1089, 220, 'expense', 'voice', 175.00, 'معرض', '‏175 Sefi', 3.00, 0, 0, '2025-11-23 16:08:21', '2025-11-23 16:08:30', '2025-11-25 19:50:20', NULL),
(1091, 230, 'income', 'manual', 25.00, NULL, NULL, NULL, 0, 0, '2025-11-23 18:06:19', '2025-11-23 20:06:14', '2025-11-23 18:06:19', NULL),
(1092, 300, 'income', 'manual', 315.00, NULL, NULL, NULL, 0, 0, '2025-11-23 18:08:48', '2025-11-23 20:08:42', '2025-11-23 18:08:48', NULL),
(1093, 298, 'expense', 'voice', 5.00, 'حاجة ساقعة', 'انا مثلا ايه بخمسه جنيه حاجه ساقعه', 2.00, 0, 0, '2025-11-23 18:18:03', '2025-11-23 18:18:03', '2025-11-25 19:50:20', NULL),
(1094, 298, 'expense', 'voice', 0.00, 'هدية', 'لا دي هديه يعني مش احساسها', 3.00, 0, 0, '2025-11-23 18:18:20', '2025-11-23 18:18:20', '2025-11-25 19:50:20', NULL),
(1095, 301, 'expense', 'voice', 0.00, '-', 'انا برده مش فاهم', 9.00, 0, 0, '2025-11-23 18:19:24', '2025-11-23 18:19:24', '2025-11-25 19:50:20', NULL),
(1096, 304, 'expense', 'voice', 5.00, 'حاجة ساقعة', '5 جنيه حاجه ساقعه', 2.00, 0, 0, '2025-11-23 18:37:38', '2025-11-23 18:37:38', '2025-11-25 19:50:20', NULL),
(1097, 307, 'expense', 'voice', 0.00, '-', 'بتاع', 1.00, 0, 0, '2025-11-23 18:43:39', '2025-11-23 18:43:39', '2025-11-25 19:50:20', NULL),
(1098, 310, 'expense', 'voice', 5.00, 'فول', 'اشتريت ب 5 جنيه فول وخمسه جنيه فلافل', 2.00, 0, 0, '2025-11-23 18:46:07', '2025-11-23 18:46:07', '2025-11-25 19:50:20', NULL),
(1099, 310, 'expense', 'voice', 5.00, 'فلافل', 'اشتريت ب 5 جنيه فول وخمسه جنيه فلافل', 2.00, 0, 0, '2025-11-23 18:46:07', '2025-11-23 18:46:07', '2025-11-25 19:50:20', NULL),
(1100, 312, 'expense', 'voice', 3.00, 'فيديوهات', 'فيديوهات حوالي ثلاث ثواني في الاول', 11.00, 0, 0, '2025-11-23 19:01:50', '2025-11-23 19:01:50', '2025-11-25 19:50:20', NULL),
(1101, 210, 'expense', 'voice', 14.00, 'مواصلات', 'وركبت مواصلات ب 15 جنيه', 11.00, 0, 0, '2025-11-23 19:18:01', '2025-11-23 19:18:12', '2025-11-25 19:50:20', NULL),
(1102, 210, 'expense', 'voice', 30.00, 'سكوتر', 'ركبت سكوتر ب 30 جنيه الصبح', 3.00, 0, 0, '2025-11-23 19:18:18', '2025-11-23 19:18:18', '2025-11-25 19:50:20', NULL),
(1103, 210, 'income', 'manual', 24.50, NULL, NULL, NULL, 0, 0, '2025-11-23 19:20:40', '2025-11-23 21:20:29', '2025-11-23 19:20:40', NULL),
(1104, 210, 'expense', 'voice', 75.00, 'كوركينج سبيس', 'بص انا دفعت 75 جنيه في الكوركينج سبي', 3.00, 0, 0, '2025-11-23 20:21:28', '2025-11-23 20:21:28', '2025-11-25 19:50:20', NULL),
(1106, 210, 'expense', 'voice', 350.00, 'عشاء', '350 جنيه عشا', 2.00, 0, 0, '2025-11-23 20:27:46', '2025-11-23 20:27:46', '2025-11-25 19:50:20', NULL),
(1107, 229, 'expense', 'voice', 30.00, 'مواصلات', '‏30 جنيه مواصلات 20 جنيه لانش 40 جنيه تسالي', 14.00, 0, 0, '2025-11-23 20:44:15', '2025-11-23 20:44:15', '2025-11-25 19:50:20', NULL),
(1108, 229, 'expense', 'voice', 20.00, 'لانشون', '‏30 جنيه مواصلات 20 جنيه لانش 40 جنيه تسالي', 14.00, 0, 0, '2025-11-23 20:44:15', '2025-11-23 20:52:19', '2025-11-25 19:50:20', NULL),
(1109, 229, 'expense', 'voice', 40.00, 'تسالي', '‏30 جنيه مواصلات 20 جنيه لانش 40 جنيه تسالي', 14.00, 0, 0, '2025-11-23 20:44:15', '2025-11-23 20:44:15', '2025-11-25 19:50:20', NULL),
(1110, 229, 'income', 'manual', 200.00, NULL, NULL, NULL, 0, 0, '2025-11-23 20:44:49', '2025-11-23 22:44:46', '2025-11-23 20:44:49', NULL),
(1112, 184, 'income', 'manual', 965.00, NULL, NULL, NULL, 0, 0, '2025-11-23 21:11:08', '2025-11-23 23:10:47', '2025-11-23 21:11:08', NULL),
(1113, 184, 'expense', 'manual', 70.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-23 21:11:46', '2025-11-23 21:11:59', '2025-11-23 21:11:59', NULL),
(1114, 184, 'expense', 'manual', 60.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-23 21:12:19', '2025-11-23 21:12:39', '2025-11-23 21:12:39', NULL),
(1115, 184, 'expense', 'manual', 30.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-23 21:12:20', '2025-11-23 21:12:29', '2025-11-23 21:12:29', NULL),
(1116, 184, 'expense', 'manual', 365.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-23 21:12:51', '2025-11-23 21:12:56', '2025-11-23 21:12:56', NULL),
(1117, 210, 'expense', 'voice', 12.00, 'مواصلات', '12 جنيه مواصلات 10 جنيه ميه 10 جنيه حاجه', 4.00, 0, 0, '2025-11-23 21:13:08', '2025-11-23 21:13:08', '2025-11-25 19:50:20', NULL),
(1118, 210, 'expense', 'voice', 10.00, 'مياه', '12 جنيه مواصلات 10 جنيه ميه 10 جنيه حاجه', 4.00, 0, 0, '2025-11-23 21:13:08', '2025-11-23 21:13:08', '2025-11-25 19:50:20', NULL),
(1119, 210, 'expense', 'voice', 10.00, 'حاجه ساقعة', '12 جنيه مواصلات 10 جنيه ميه 10 جنيه حاجه', 4.00, 0, 0, '2025-11-23 21:13:08', '2025-11-24 13:17:02', '2025-11-25 19:50:20', NULL),
(1120, 184, 'income', 'manual', 100.00, NULL, NULL, NULL, 0, 0, '2025-11-23 21:13:09', '2025-11-23 23:13:07', '2025-11-23 21:13:09', NULL),
(1121, 184, 'expense', 'manual', 50.00, 'transportation ', NULL, NULL, 0, 0, '2025-11-23 21:14:00', '2025-11-23 21:14:11', '2025-11-23 21:14:11', NULL),
(1122, 184, 'expense', 'manual', 2000.00, 'other thing', NULL, NULL, 0, 0, '2025-11-23 21:14:44', '2025-11-23 21:15:06', '2025-11-23 21:15:06', NULL),
(1123, 184, 'income', 'manual', 85.00, NULL, NULL, NULL, 0, 0, '2025-11-23 21:15:33', '2025-11-23 23:15:14', '2025-11-23 21:15:33', NULL),
(1124, 184, 'expense', 'manual', 300.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 00:00:00', '2025-11-24 00:00:05', '2025-11-24 00:00:05', NULL),
(1125, 300, 'expense', 'voice', 550.00, 'عشاء ', '‏550 ها', 6.00, 0, 0, '2025-11-24 09:10:37', '2025-11-24 09:11:03', '2025-11-25 19:50:20', NULL),
(1128, 316, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 11:44:17', '2025-11-24 11:44:17', '2025-11-24 11:44:17', NULL),
(1129, 316, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 11:44:33', '2025-11-24 11:44:33', '2025-11-24 11:44:33', NULL),
(1130, 316, 'expense', 'manual', 100.00, 'مواصلات', NULL, NULL, 0, 0, '2025-11-24 11:44:36', '2025-11-24 11:44:54', '2025-11-24 11:44:54', NULL),
(1131, 316, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 11:45:04', '2025-11-24 11:45:04', '2025-11-24 11:45:04', NULL),
(1132, 170, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 12:00:42', '2025-11-24 12:00:42', '2025-11-24 12:00:42', NULL),
(1133, 170, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 12:00:53', '2025-11-24 12:00:53', '2025-11-24 12:00:53', NULL),
(1134, 170, 'expense', 'voice', 35561.50, 'عيش', '‏35,561 جنيه ونص عيش', 4.00, 0, 0, '2025-11-24 12:01:09', '2025-11-24 12:01:09', '2025-11-25 19:50:20', NULL),
(1136, 170, 'expense', 'voice', 236.50, 'زبدة فول سوداني', '‏236 جنيه ونص زبدة فول سوداني', 6.00, 0, 0, '2025-11-24 12:01:34', '2025-11-24 12:01:34', '2025-11-25 19:50:20', NULL),
(1137, 170, 'expense', 'voice', 100.00, 'لبن', '‏100 جنيه لبن', 1.00, 0, 0, '2025-11-24 12:09:49', '2025-11-24 12:09:49', '2025-11-25 19:50:20', NULL),
(1139, 170, 'expense', 'voice', 127.00, 'كرتونة بيض', '‏كرتونة بيض 127', 2.00, 0, 0, '2025-11-24 12:14:47', '2025-11-24 12:14:47', '2025-11-25 19:50:20', NULL),
(1140, 170, 'expense', 'voice', 90.00, 'جبنة قريش', '‏جبنة قريش 90', 2.00, 0, 0, '2025-11-24 12:14:56', '2025-11-24 12:14:56', '2025-11-25 19:50:20', NULL),
(1141, 317, 'expense', 'voice', 5.00, 'فولو', 'بخمسه جنيه فولو 50 جنيه فلافل', 4.00, 0, 0, '2025-11-24 12:33:59', '2025-11-24 12:33:59', '2025-11-25 19:50:20', NULL),
(1142, 317, 'expense', 'voice', 50.00, 'فلافل', 'بخمسه جنيه فولو 50 جنيه فلافل', 4.00, 0, 0, '2025-11-24 12:33:59', '2025-11-24 12:33:59', '2025-11-25 19:50:20', NULL),
(1143, 317, 'expense', 'voice', 5.00, 'حاجة ساقعة', 'عشان ب 5 جنيه حاجه ساقعه', 7.00, 0, 0, '2025-11-24 12:35:04', '2025-11-24 12:35:04', '2025-11-25 19:50:20', NULL),
(1146, 176, 'expense', 'voice', 45.00, 'مواصلات', '‏45 جنيه مواصلات', 2.00, 0, 0, '2025-11-24 12:57:42', '2025-11-24 12:57:42', '2025-11-25 19:50:20', NULL),
(1148, 176, 'expense', 'voice', 90.00, 'كرتونةًمياه', '‏90 جنيه مايو 16 جنيه توصيل', 5.00, 0, 0, '2025-11-24 12:58:17', '2025-11-24 12:58:40', '2025-11-25 19:50:20', NULL),
(1149, 176, 'expense', 'voice', 16.00, 'توصيل', '‏90 جنيه مايو 16 جنيه توصيل', 5.00, 0, 0, '2025-11-24 12:58:17', '2025-11-24 12:58:17', '2025-11-25 19:50:20', NULL),
(1150, 176, 'expense', 'manual', 50.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-24 13:00:10', '2025-11-24 13:00:33', '2025-11-24 13:00:33', NULL),
(1152, 170, 'expense', 'voice', 30.00, 'توابل', '‏30 جنيه التوابل', 2.00, 0, 0, '2025-11-24 13:06:18', '2025-11-24 13:06:18', '2025-11-25 19:50:20', NULL),
(1153, 170, 'expense', 'voice', 50.00, 'شوفان ', '‏شوفين بخمسين', 2.00, 0, 0, '2025-11-24 13:06:40', '2025-11-24 13:06:51', '2025-11-25 19:50:20', NULL),
(1154, 170, 'expense', 'voice', 30.00, 'صلصة', '‏صلصة بثلاثين', 2.00, 0, 0, '2025-11-24 13:07:13', '2025-11-24 13:07:13', '2025-11-25 19:50:20', NULL),
(1155, 170, 'expense', 'voice', 170.00, 'بانيه', '‏170 بني', 1.00, 0, 0, '2025-11-24 13:10:04', '2025-11-24 13:10:15', '2025-11-25 19:50:20', NULL),
(1156, 170, 'expense', 'voice', 35.00, 'موز ', '‏76 جنيه موز وفلفل', 2.00, 0, 0, '2025-11-24 13:10:44', '2025-11-24 13:11:03', '2025-11-25 19:50:20', NULL),
(1158, 170, 'expense', 'voice', 36.00, 'فلفل ألوان', '‏36 جنيه فلفل ألوان', 3.00, 0, 0, '2025-11-24 13:11:13', '2025-11-24 13:11:13', '2025-11-25 19:50:20', NULL),
(1159, 319, 'expense', 'voice', 10.00, 'فينو', 'اشتريت ب 10 جنيه فينو 10 جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-24 13:44:03', '2025-11-24 13:44:03', '2025-11-25 19:50:20', NULL),
(1160, 319, 'expense', 'voice', 10.00, 'حاجة ساقعة', 'اشتريت ب 10 جنيه فينو 10 جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-24 13:44:03', '2025-11-24 13:44:03', '2025-11-25 19:50:20', NULL),
(1163, 210, 'expense', 'manual', 300.00, 'غداء', NULL, NULL, 0, 0, '2025-11-24 15:36:01', '2025-11-24 15:36:01', '2025-11-24 15:36:01', NULL),
(1164, 323, 'expense', 'voice', 0.00, 'بطاطس', '‏بطاطس أي حاجة صعبة', 3.00, 0, 0, '2025-11-24 15:36:39', '2025-11-24 15:36:39', '2025-11-25 19:50:20', NULL),
(1165, 323, 'expense', 'voice', 25.00, 'بطاطس', '‏25 جنيه بطاطس', 3.00, 0, 0, '2025-11-24 15:37:04', '2025-11-24 15:37:04', '2025-11-25 19:50:20', NULL),
(1166, 324, 'expense', 'voice', 20.00, '-', '‏20 جنيه', 2.00, 0, 0, '2025-11-24 15:48:54', '2025-11-24 15:48:54', '2025-11-25 19:50:20', NULL),
(1167, 326, 'expense', 'voice', 25.00, 'بطاطس', '‏25 جنيه بطاطس', 3.00, 0, 0, '2025-11-24 16:06:40', '2025-11-24 16:06:40', '2025-11-25 19:50:20', NULL),
(1171, 170, 'expense', 'voice', 15.00, 'ماء', '‏15 مية', 2.00, 0, 0, '2025-11-24 18:55:14', '2025-11-24 18:55:14', '2025-11-25 19:50:20', NULL),
(1185, 329, 'expense', 'voice', 600.00, 'تحويل', '‏600 جنيه تحويل', 3.00, 0, 0, '2025-11-24 19:11:11', '2025-11-24 19:11:11', '2025-11-25 19:50:20', NULL),
(1186, 329, 'expense', 'voice', 142.00, 'تحويل موبايل', '‏عملية شراء بيت 42 موبايل Charge', 4.00, 0, 0, '2025-11-24 19:11:27', '2025-11-24 19:12:59', '2025-11-25 19:50:20', NULL),
(1189, 329, 'expense', 'voice', 1200.00, 'تحويل لحظة', '‏تعمل تحويل لحظة بألف ومئتين', 3.00, 0, 0, '2025-11-24 19:13:21', '2025-11-24 19:13:21', '2025-11-25 19:50:20', NULL),
(1190, 329, 'expense', 'voice', 249.00, 'شراب', '‏عملية شراب بمئتين 49', 5.00, 0, 0, '2025-11-24 19:14:11', '2025-11-24 19:14:11', '2025-11-25 19:50:20', NULL),
(1191, 329, 'expense', 'voice', 5.00, 'برقان', '‏خمسة برقان', 2.00, 0, 0, '2025-11-24 21:19:04', '2025-11-24 21:19:04', '2025-11-25 19:50:20', NULL),
(1192, 329, 'expense', 'voice', 10.00, 'موز', '‏10 موز', 2.00, 0, 0, '2025-11-24 21:19:15', '2025-11-24 21:19:15', '2025-11-25 19:50:20', NULL),
(1193, 329, 'expense', 'voice', 3.00, 'تفاح', '‏ثلاثة تفاح', 4.00, 0, 0, '2025-11-24 21:19:24', '2025-11-24 21:19:24', '2025-11-25 19:50:20', NULL),
(1194, 329, 'expense', 'voice', 0.00, 'طماطم', '‏عشان طماطم', 2.00, 0, 0, '2025-11-24 21:19:32', '2025-11-24 21:19:32', '2025-11-25 19:50:20', NULL),
(1195, 329, 'expense', 'voice', 5.00, 'بتنجان', '‏خمسة بتنجان', 2.00, 0, 0, '2025-11-24 21:19:43', '2025-11-24 21:19:43', '2025-11-25 19:50:20', NULL),
(1196, 170, 'expense', 'voice', 30.00, 'حليب', '‏حليب 30 ريال', 2.00, 0, 0, '2025-11-24 22:43:10', '2025-11-24 22:43:10', '2025-11-25 19:50:20', NULL),
(1198, 184, 'income', 'manual', 90.00, NULL, NULL, NULL, 0, 0, '2025-11-25 02:47:30', '2025-11-25 04:47:25', '2025-11-25 02:47:30', NULL),
(1199, 331, 'income', 'manual', 2000.00, NULL, NULL, NULL, 0, 0, '2025-11-25 04:10:43', '2025-11-25 12:10:32', '2025-11-25 04:10:43', NULL),
(1204, 327, 'expense', 'voice', 5.00, 'فول', 'اشتريت ب 5 جنيه فول وخمسه جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-25 05:46:23', '2025-11-25 05:46:23', '2025-11-25 19:50:20', NULL),
(1205, 327, 'expense', 'voice', 5.00, 'حاجة ساقعة', 'اشتريت ب 5 جنيه فول وخمسه جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-25 05:46:23', '2025-11-25 05:46:23', '2025-11-25 19:50:20', NULL),
(1206, 327, 'expense', 'voice', 10.00, 'فول', 'اشتريت ب 10 جنيه فور و 10 جنيه جبنه قريش', 3.00, 0, 0, '2025-11-25 05:46:51', '2025-11-25 05:46:51', '2025-11-25 19:50:20', NULL),
(1207, 327, 'expense', 'voice', 10.00, 'جبنة قريش', 'اشتريت ب 10 جنيه فور و 10 جنيه جبنه قريش', 3.00, 0, 0, '2025-11-25 05:46:51', '2025-11-25 05:46:51', '2025-11-25 19:50:20', NULL),
(1210, 189, 'expense', 'voice', 10.00, 'حاجة ساقعة', 'اشتري ب 10 جنيه فولو 10 جنيه فليفله وحاجه ساقعه ب 10 جنيه', 5.00, 0, 0, '2025-11-25 05:48:07', '2025-11-25 05:48:07', '2025-11-25 19:50:20', NULL),
(1211, 189, 'expense', 'voice', 10.00, 'عسل', 'انت العسلت ب 10 جنيه', 2.00, 0, 0, '2025-11-25 05:48:17', '2025-11-25 05:48:17', '2025-11-25 19:50:20', NULL),
(1212, 189, 'expense', 'voice', 10.00, 'فول', 'اشتريت فول ب 10 جنيه وطحينه ب 10 جنيه', 4.00, 0, 0, '2025-11-25 05:48:25', '2025-11-25 05:48:25', '2025-11-25 19:50:20', NULL),
(1213, 189, 'expense', 'voice', 10.00, 'طحينة', 'اشتريت فول ب 10 جنيه وطحينه ب 10 جنيه', 4.00, 0, 0, '2025-11-25 05:48:25', '2025-11-25 05:48:25', '2025-11-25 19:50:20', NULL),
(1214, 189, 'expense', 'voice', 10.00, 'فول', 'تمثيليه ب 10 جنيه فول و 10 جنيه فلافل', 3.00, 0, 0, '2025-11-25 05:49:00', '2025-11-25 05:49:00', '2025-11-25 19:50:20', NULL),
(1215, 189, 'expense', 'voice', 10.00, 'فلافل', 'تمثيليه ب 10 جنيه فول و 10 جنيه فلافل', 3.00, 0, 0, '2025-11-25 05:49:00', '2025-11-25 05:49:00', '2025-11-25 19:50:20', NULL),
(1216, 189, 'expense', 'voice', 10.00, 'حاجة ساقعة', 'البشر وبعشره جنيه حاجه ساقعه', 2.00, 0, 0, '2025-11-25 05:49:21', '2025-11-25 05:49:21', '2025-11-25 19:50:20', NULL),
(1220, 220, 'expense', 'voice', 40.00, 'transportation ', '‏40 جنيه', 3.00, 0, 0, '2025-11-25 05:52:09', '2025-11-25 05:52:19', '2025-11-25 19:50:20', NULL),
(1225, 170, 'income', 'manual', 3500.00, NULL, NULL, NULL, 0, 0, '2025-11-25 08:16:11', '2025-11-25 10:16:00', '2025-11-25 08:16:11', NULL),
(1226, 170, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-25 08:16:56', '2025-11-25 08:16:56', '2025-11-25 08:16:56', NULL),
(1227, 170, 'expense', 'voice', 1.00, 'لبن', '‏أنا جبت كيلو لبن بعشرين جنيه', 5.00, 0, 0, '2025-11-25 08:27:03', '2025-11-25 08:27:03', '2025-11-25 19:50:20', NULL),
(1228, 170, 'expense', 'voice', 20.00, 'لبن', '‏لبن 20 جنيه', 4.00, 0, 0, '2025-11-25 08:27:20', '2025-11-25 08:27:20', '2025-11-25 19:50:20', NULL),
(1229, 170, 'expense', 'voice', 130.00, 'لبن ولش مبيض', '‏لبن ولش مبيض بمية وثلاثين جنيه', 3.00, 0, 0, '2025-11-25 08:27:40', '2025-11-25 08:27:40', '2025-11-25 19:50:20', NULL),
(1230, 189, 'expense', 'voice', 5.00, 'فلافل', 'اشتريت ب 5 جنيه فلافل وخمسه جنيه فول وخمسه جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-25 12:25:41', '2025-11-25 12:25:41', '2025-11-25 19:50:20', NULL),
(1231, 189, 'expense', 'voice', 5.00, 'فول', 'اشتريت ب 5 جنيه فلافل وخمسه جنيه فول وخمسه جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-25 12:25:41', '2025-11-25 12:25:41', '2025-11-25 19:50:20', NULL),
(1232, 189, 'expense', 'voice', 5.00, 'حاجه ساقعه', 'اشتريت ب 5 جنيه فلافل وخمسه جنيه فول وخمسه جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-25 12:25:41', '2025-11-25 12:25:41', '2025-11-25 19:50:20', NULL),
(1233, 189, 'expense', 'voice', 10.00, 'حاجة ساقعة', 'سيد ب 10 جنيه في نوع 10 جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-25 12:27:13', '2025-11-25 12:27:13', '2025-11-25 19:50:20', NULL),
(1234, 189, 'expense', 'voice', 10.00, 'سيد', 'سيد ب 10 جنيه في نوع 10 جنيه حاجه ساقعه', 4.00, 0, 0, '2025-11-25 12:27:13', '2025-11-25 12:27:13', '2025-11-25 19:50:20', NULL),
(1235, 336, 'expense', 'voice', 0.00, 'بطاطس', '‏نشتري بطاطس', 4.00, 0, 0, '2025-11-25 12:28:11', '2025-11-25 12:28:11', '2025-11-25 19:50:20', NULL),
(1236, 336, 'expense', 'voice', 5.00, '-', '‏خمسة جنيه', 8.00, 0, 0, '2025-11-25 12:28:21', '2025-11-25 12:28:21', '2025-11-25 19:50:20', NULL),
(1237, 189, 'expense', 'voice', 5.00, 'فول', '5 جنيه فول 50 فليفله', 3.00, 0, 0, '2025-11-25 14:20:12', '2025-11-25 14:20:12', '2025-11-25 19:50:20', NULL),
(1238, 189, 'expense', 'voice', 50.00, 'فليفلة', '5 جنيه فول 50 فليفله', 3.00, 0, 0, '2025-11-25 14:20:12', '2025-11-25 14:20:12', '2025-11-25 19:50:20', NULL),
(1239, 170, 'expense', 'manual', 100.00, 'Groceries', NULL, NULL, 0, 0, '2025-11-25 14:44:40', '2025-11-25 14:44:40', '2025-11-25 14:44:40', NULL),
(1240, 189, 'expense', 'voice', 5.00, 'بطاطس', '5 جنيه بطاطس', 4.00, 0, 0, '2025-11-25 14:47:01', '2025-11-25 14:47:01', '2025-11-25 19:50:20', NULL),
(1241, 189, 'expense', 'manual', 88.00, 'ىلة', NULL, NULL, 0, 0, '2025-11-25 14:47:12', '2025-11-25 14:47:12', '2025-11-25 14:47:12', NULL),
(1242, 338, 'expense', 'voice', 50.00, 'مياه', '‏بخمسين جنيه مية', 4.00, 0, 0, '2025-11-25 14:58:23', '2025-11-25 14:58:23', '2025-11-25 19:50:20', NULL),
(1245, 170, 'expense', 'voice', 250.00, 'جنيه', '‏250 جنيه 160 جنيه كباب', 4.00, 0, 0, '2025-11-25 15:06:43', '2025-11-25 15:06:43', '2025-11-25 19:50:20', NULL),
(1246, 170, 'expense', 'voice', 160.00, 'جنيه كباب', '‏250 جنيه 160 جنيه كباب', 4.00, 0, 0, '2025-11-25 15:06:43', '2025-11-25 15:06:43', '2025-11-25 19:50:20', NULL),
(1247, 220, 'expense', 'voice', 500.00, 'فطار', '‏500 جنيه فطار', 2.00, 0, 0, '2025-11-25 15:21:17', '2025-11-25 15:21:17', '2025-11-25 19:50:20', NULL),
(1249, 341, 'expense', 'voice', 15000.00, 'طباشير ابيض', '15000 جنيه طباشير ابيض في السنه', 20.00, 0, 0, '2025-11-25 15:24:29', '2025-11-25 15:24:29', '2025-11-25 19:50:20', NULL),
(1250, 341, 'expense', 'voice', 50000.00, 'طباشير ملون', 'و50 الف جنيه قال له لا طباشير ملون', 25.00, 0, 0, '2025-11-25 15:24:39', '2025-11-25 15:24:39', '2025-11-25 19:50:20', NULL),
(1251, 170, 'expense', 'voice', 2.00, 'جبنة', '‏سخيف جبنة باثنين جنيه جبنة فيه', 3.00, 0, 0, '2025-11-25 15:40:54', '2025-11-25 15:40:54', '2025-11-25 19:50:20', NULL),
(1252, 170, 'expense', 'voice', 10.00, 'مائة جنيه', '‏بعشرة جنيه 100', 2.00, 0, 0, '2025-11-25 15:50:59', '2025-11-25 15:50:59', '2025-11-25 19:50:20', NULL),
(1253, 170, 'expense', 'voice', 100.00, 'لبن', '‏بمئة جنيه لبن', 1.00, 0, 0, '2025-11-25 15:51:15', '2025-11-25 15:51:15', '2025-11-25 19:50:20', NULL),
(1254, 170, 'expense', 'voice', 50.00, 'بلايستيشن', '‏رحت ال ستيشن بخمسين جنيه وبعد كده بعشرين جنيه أم علي صلحت الموبايل بمئتين جنيه', 14.00, 0, 0, '2025-11-25 15:51:53', '2025-11-25 15:52:08', '2025-11-25 19:50:20', NULL),
(1255, 170, 'expense', 'voice', 20.00, 'أم علي', '‏رحت ال ستيشن بخمسين جنيه وبعد كده بعشرين جنيه أم علي صلحت الموبايل بمئتين جنيه', 14.00, 0, 0, '2025-11-25 15:51:53', '2025-11-25 15:51:53', '2025-11-25 19:50:20', NULL),
(1256, 170, 'expense', 'voice', 200.00, 'تصليح الموبايل', '‏رحت ال ستيشن بخمسين جنيه وبعد كده بعشرين جنيه أم علي صلحت الموبايل بمئتين جنيه', 14.00, 0, 0, '2025-11-25 15:51:53', '2025-11-25 15:51:53', '2025-11-25 19:50:20', NULL),
(1257, 343, 'expense', 'manual', 958.00, 'اييي', NULL, NULL, 0, 0, '2025-11-25 15:53:33', '2025-11-25 15:53:33', '2025-11-25 15:53:33', NULL),
(1258, 343, 'expense', 'manual', 988.00, 'ةىبر', NULL, NULL, 0, 0, '2025-11-25 15:53:37', '2025-11-25 15:53:37', '2025-11-25 15:53:37', NULL),
(1259, 343, 'expense', 'voice', 5.00, 'فول', '5 جنيه فول وخمسه جنيه فلافل', 2.00, 0, 0, '2025-11-25 15:53:56', '2025-11-25 15:53:56', '2025-11-25 19:50:20', NULL),
(1260, 343, 'expense', 'voice', 5.00, 'فلافل', '5 جنيه فول وخمسه جنيه فلافل', 2.00, 0, 0, '2025-11-25 15:53:56', '2025-11-25 15:53:56', '2025-11-25 19:50:20', NULL),
(1262, 220, 'expense', 'voice', 10.00, 'مواصلات', '‏Tin باوند ترانسبورت أشن', 2.00, 0, 0, '2025-11-25 17:39:57', '2025-11-25 17:40:17', '2025-11-25 19:50:20', NULL),
(1264, 170, 'expense', 'voice', 30.00, 'لبن', '‏مثلا 30 جنيه لبن', 2.00, 0, 0, '2025-11-25 17:51:57', '2025-11-25 17:51:57', '2025-11-25 19:50:20', NULL),
(1265, 170, 'expense', 'voice', 40.00, 'عيش', '‏40 جنيه عيش', 2.00, 0, 0, '2025-11-25 17:52:04', '2025-11-25 17:52:04', '2025-11-25 19:50:20', NULL),
(1266, 170, 'expense', 'voice', 50.00, 'أم علي', '‏50 جنيه أم علي', 3.00, 0, 0, '2025-11-25 17:52:33', '2025-11-25 17:52:33', '2025-11-25 19:50:20', NULL),
(1267, 360, 'expense', 'voice', 5.00, 'بطاطس', '5 جنيه بطاطس', 3.00, 0, 0, '2025-11-25 18:08:56', '2025-11-25 18:08:56', '2025-11-25 19:50:20', NULL),
(1268, 360, 'expense', 'voice', 20.00, 'حاجة ساقعة', '20 جنيه حاجه ساقعه', 3.00, 0, 0, '2025-11-25 18:09:47', '2025-11-25 18:09:47', '2025-11-25 19:50:20', NULL),
(1269, 360, 'expense', 'voice', 5.00, 'فول', '5 جنيه فول وخمسه جنيه بطاطس', 3.00, 0, 0, '2025-11-25 18:10:02', '2025-11-25 18:10:02', '2025-11-25 19:50:20', NULL),
(1270, 360, 'expense', 'voice', 5.00, 'بطاطس', '5 جنيه فول وخمسه جنيه بطاطس', 3.00, 0, 0, '2025-11-25 18:10:02', '2025-11-25 18:10:02', '2025-11-25 19:50:20', NULL),
(1271, 170, 'expense', 'voice', 20.00, 'عيش', '‏بعشرين جنيه عيش 50 جنيه لبن بستين جنيه أم علي', 4.00, 0, 0, '2025-11-25 18:12:13', '2025-11-25 18:12:13', '2025-11-25 19:50:20', NULL),
(1272, 170, 'expense', 'voice', 50.00, 'لبن', '‏بعشرين جنيه عيش 50 جنيه لبن بستين جنيه أم علي', 4.00, 0, 0, '2025-11-25 18:12:13', '2025-11-25 18:12:13', '2025-11-25 19:50:20', NULL),
(1273, 170, 'expense', 'voice', 60.00, 'أم علي', '‏بعشرين جنيه عيش 50 جنيه لبن بستين جنيه أم علي', 4.00, 0, 0, '2025-11-25 18:12:13', '2025-11-25 18:12:13', '2025-11-25 19:50:20', NULL),
(1274, 170, 'expense', 'voice', 20.00, 'لبن', '‏صرفت بعشرين جنيه لبن وب بخمسين جنيه', 3.00, 0, 0, '2025-11-25 19:32:43', '2025-11-25 19:32:43', '2025-11-25 19:50:20', NULL),
(1275, 170, 'expense', 'voice', 50.00, 'ب', '‏صرفت بعشرين جنيه لبن وب بخمسين جنيه', 3.00, 0, 0, '2025-11-25 19:32:43', '2025-11-25 19:32:43', '2025-11-25 19:50:20', NULL),
(1276, 210, 'income', 'manual', 3000.00, NULL, NULL, NULL, 0, 0, '2025-12-02 19:34:20', '2025-11-19 13:36:39', '2025-12-02 19:34:20', NULL),
(1277, 210, 'expense', 'voice', 20.00, '-', '200 جنيه', 1.00, 0, 0, '2025-12-02 19:38:28', '2025-12-02 19:38:28', '2025-12-02 19:38:28', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `username` varchar(100) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `gender` enum('male','female') DEFAULT NULL,
  `birthdate` date DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `user_type_id` tinyint(4) NOT NULL DEFAULT 2,
  `status_id` tinyint(4) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `name`, `username`, `email`, `gender`, `birthdate`, `avatar`, `password`, `user_type_id`, `status_id`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'admin', 'admin@email.com', 'male', NULL, NULL, '$2b$12$dLECjjjie8luCSqlyZ9E/.uyT8pEAr7kDsHfpzPAyMsEWRboWLXJe', 1, 1, '2025-06-26 15:21:10', '2025-10-31 19:30:00'),
(2, 'main user', 'mainuser', 'mainuser@email.com', 'male', '1999-04-15', 'image-1759601982310-975660208.jpeg', '$2b$12$x.fJHv3e01AFxwwr/gDKNusto/qJnAb6aaJYvP0riHP7PfGt3hDmG', 2, 1, '2025-06-26 15:22:11', '2025-10-31 19:29:53'),
(155, NULL, '88598ac7-5761-4730-bbcf-0cafea36ea48', NULL, NULL, NULL, NULL, '$2b$10$aV.x3/FRr1Olr89pA8NzoeC1T5MHrKQHNBh7O5l21QM7KUC6xPFzy', 3, 1, '2025-11-15 18:18:25', '2025-11-15 18:18:25'),
(156, NULL, '5db96ad6-4b7c-44d9-af0a-a6d64d2bdafd', NULL, NULL, NULL, NULL, '$2b$10$lV0NZryR1qavODyuWhqLR.uOKo.0XIhgu4HlH1jxIA.owlmAS.oNG', 3, 1, '2025-11-16 06:31:14', '2025-11-16 06:31:14'),
(157, 'ziad', 'user', 'user@b.com', NULL, NULL, NULL, '$2b$12$VxZPYzIrsVJJNGokF3GFjuu9u9ZZhaHmHQU.cySuaCde/MYKtDhSC', 2, 4, '2025-11-16 06:50:38', '2025-11-16 06:50:42'),
(158, NULL, '721980ff-f990-4270-ae5e-0ed1d71acc01', NULL, NULL, NULL, NULL, '$2b$10$Bf9cZkvcut93Kcj3d5TaWulCQIT0cPLK7gZGSbqJ0c8tKUqKZhgsK', 3, 1, '2025-11-16 06:50:42', '2025-11-16 06:50:42'),
(159, NULL, 'b1f7492e-f4b8-43ea-8260-bdb9a0897d98', NULL, NULL, NULL, NULL, '$2b$10$YRtN5Zg5DdOV8z0Q4iypfOqW4vRp0QfHvegB0W.7zaaRYfMglOLQ2', 3, 1, '2025-11-16 11:44:05', '2025-11-16 11:44:05'),
(160, NULL, '5fc88fc7-8cae-4a83-a1a5-160b350bde35', NULL, NULL, NULL, NULL, '$2b$10$x7jN9R/EsDL1CyS6yuQb6eWOWhiGfe25ADT9cnfTEZNMMv1Y5Goiu', 3, 1, '2025-11-16 12:59:47', '2025-11-16 12:59:47'),
(161, NULL, '79efe7c0-5ce9-4d75-82af-6e10c5a7dd74', NULL, NULL, NULL, NULL, '$2b$10$pZWHc1bcXrGsLyk/NNBS6OIxyYnhMnol4AHIBp53YH/i0FAx5YH..', 3, 1, '2025-11-17 17:39:44', '2025-11-17 17:39:44'),
(162, 'Apple johb', 'olive.p24g38b.ozbj', 'olive.p24g38b.ozbj@icloud.com', NULL, NULL, NULL, '$2b$12$btm45fcZiXKoADU8PRMALu5.Bwc/byV.7MVAqDteUYCz.YywhL5i2', 2, 4, '2025-11-17 17:40:51', '2025-11-17 17:41:18'),
(163, NULL, 'bc94939e-72fe-45f2-a963-03441a2169d2', NULL, NULL, NULL, NULL, '$2b$10$N8p.z9PaTMk/WMGcNjlsc.sdON4VJPLEuD/GCzNl6nc.PzXMKeVum', 3, 1, '2025-11-17 17:41:18', '2025-11-17 17:41:18'),
(164, NULL, 'f96cdf07-6232-42a4-a8e0-5f849b18e11e', NULL, NULL, NULL, NULL, '$2b$10$YyER6o8hIbXLlwuxHskUZuR.VHn1w1SwqvYqNomvDVc1fKkH7ge8i', 3, 1, '2025-11-17 17:49:33', '2025-11-17 17:49:33'),
(165, NULL, '5af6b01e-5434-46c4-9b2f-3a20c148154b', NULL, NULL, NULL, NULL, '$2b$10$TibXXfiEDzX9rgCli1bocO8433V3W8Bynf4KBhbvTCOXYgwjFZbQ.', 3, 1, '2025-11-17 17:51:05', '2025-11-17 17:51:05'),
(166, NULL, '9b62eca1-2f0d-42f1-bbc3-3d0a05a574a1', NULL, NULL, NULL, NULL, '$2b$10$XqpebdGFzuaW3/V/YhsxJOv9epQ8htBmCSf2dtqthJ8Qr4iwVZUKq', 3, 1, '2025-11-17 17:57:21', '2025-11-17 17:57:21'),
(167, 'Rewan Hussien', 'rewanhussien18', 'rewanhussien18@gmail.com', NULL, NULL, NULL, '$2b$12$zbv7ipS1KpQLiYdd8sZv1.qJf159IwJIdOu4HI2gPBeTziben.PdS', 2, 1, '2025-11-17 17:58:22', '2025-11-17 17:58:22'),
(168, NULL, 'b8b0013e-cce1-4ed5-b3c0-fb39d212b778', NULL, NULL, NULL, NULL, '$2b$10$8QuPScEL7RjXoNc8OZIOdO0NAauhAu.vKzRvV8/OT9y49vaCZrbQ.', 3, 1, '2025-11-17 18:33:31', '2025-11-17 18:33:31'),
(169, NULL, '0ae7720a-b6e7-4949-ad00-85558ce4985a', NULL, NULL, NULL, NULL, '$2b$10$.Lvt3Gs5FABmf7.VOkH.tuVYxY3rgcHaPYJKbHYWE2Ow9LyxwrMGq', 3, 1, '2025-11-17 18:41:27', '2025-11-17 18:41:27'),
(170, 'Fadl ', 'iamfadlabdelaziz', 'iamfadlabdelaziz@gmail.com', NULL, NULL, 'image-1763405510075-533863864.jpg', '$2b$12$N1a34cvPvpebiThjUCON/.Jqjdm2OTBLnUvT5BdjgdIieYRKkZb1m', 2, 1, '2025-11-17 18:51:27', '2025-11-17 18:51:50'),
(171, NULL, '878f72c7-c120-46a9-b00a-45b50541a799', NULL, NULL, NULL, NULL, '$2b$10$zp7X7FFdbGsHTkhee2b2iuRyDaWoCS/ZS.zYdJ2KULRcaiEPTXC4i', 3, 1, '2025-11-17 20:38:30', '2025-11-17 20:38:30'),
(172, NULL, 'f480fb69-242a-493f-aa53-c4bc76ba7441', NULL, NULL, NULL, NULL, '$2b$10$Jmx5rERu20xEdX2K4/jY8u4FYO4zNUtSHKfKJE5jIWMS9wJ1EftnG', 3, 1, '2025-11-17 21:05:09', '2025-11-17 21:05:09'),
(173, NULL, '6fc657dd-019e-4ab6-9f8b-09410f911a8e', NULL, NULL, NULL, NULL, '$2b$10$P8jh/8fOK5.YNvktdxyXW.Xf0dpENl23cZs27EV7GOEGMUCw.wUZa', 3, 1, '2025-11-17 23:06:03', '2025-11-17 23:06:03'),
(174, NULL, 'a997b0bf-01d3-4241-a0c8-fc9373c0cab1', NULL, NULL, NULL, NULL, '$2b$10$8N8dtQ.rQKoHoTBYT0DR1eJJRxITx.Fm9PUYWSJsB13wl6Afuju.q', 3, 1, '2025-11-18 05:51:47', '2025-11-18 05:51:47'),
(175, 'Fikry Hamdani', 'fikryhamdani', 'fikryhamdani@gmail.com', NULL, NULL, NULL, '$2b$12$C4joLC2mPuQHg2RB2RHl2u76S.4NVtrhGCO4.mrw8YB2aODvKSvDG', 2, 1, '2025-11-18 05:52:57', '2025-11-18 05:52:57'),
(176, NULL, '336f5a4e-c342-40ab-a98c-9a52775194c3', NULL, NULL, NULL, NULL, '$2b$10$1nE2xdleypuM.zXx3t3mB.8g/YoGnPaE/eXVW4KkfV8k0C0iz/U8a', 3, 1, '2025-11-18 08:06:56', '2025-11-18 08:06:56'),
(177, NULL, 'aa733280-d628-45c6-aa52-affcc7b28134', NULL, NULL, NULL, NULL, '$2b$10$vyxiM.RGO6RkTk9lLMYzbeSv5ww.bVVjtUPSj9dIy3gLokk04.2ne', 3, 1, '2025-11-18 08:22:30', '2025-11-18 08:22:30'),
(178, NULL, '62a37d85-397b-4fc4-b959-ccd338e437e3', NULL, NULL, NULL, NULL, '$2b$10$r6.avwUEU.wZy1wIHNR1tutEzqTzcvIkM3Xssr9UAW0Un5VebRw7e', 3, 1, '2025-11-18 08:34:41', '2025-11-18 08:34:41'),
(179, NULL, '274072d9-1a38-49e8-a765-28a3342144dd', NULL, NULL, NULL, NULL, '$2b$10$702fot9PH/5tpswMqUCPjuhocTDWV4nKU.5oukAKr0gTtFS2sFtjS', 3, 1, '2025-11-18 08:38:04', '2025-11-18 08:38:04'),
(180, NULL, 'dd5f88a6-55d5-43da-bf6e-d3fc157c7f65', NULL, NULL, NULL, NULL, '$2b$10$Fn1d7MrM3tobgqAhaqAw0.s/NaegPhrEv.JONAiJQTO6TabNsZ0mO', 3, 1, '2025-11-18 09:02:03', '2025-11-18 09:02:03'),
(181, NULL, '5e3554a8-3f51-4acc-a25c-535bf2b7d533', NULL, NULL, NULL, NULL, '$2b$10$ZvL8aroPLIT2tjagxghiE.im5b0FSZYBEdWKJqhLkUGTwN2BIRZPy', 3, 1, '2025-11-18 09:09:40', '2025-11-18 09:09:40'),
(182, 'rokaya', 'rokayasadek86', 'rokayasadek86@gmail.com', NULL, NULL, 'image-1763460518805-918678267.jpg', '$2b$12$fL3eZw20aWgY3DjnTeDd1uVpNbomFuNeXhfYFNF2SvCY.5ArzbFzu', 2, 1, '2025-11-18 10:08:19', '2025-11-18 10:08:38'),
(183, NULL, 'cb634f4e-f1e4-471f-ab9b-721e7a96456b', NULL, NULL, NULL, NULL, '$2b$10$A2JfUa5cpYePPs6y/j43Mugf0iZ0T5lEmSu6bMR9UX7iltoGVLuD6', 3, 1, '2025-11-18 10:26:58', '2025-11-18 10:26:58'),
(184, 'Afnan Bahaa', 'afnanbahaa', 'afnanbahaa@icloud.com', NULL, NULL, NULL, '$2b$12$WhMSTF2xs/We6F1pYjA1Ju8AjAd8kfGYLWANfvYnXVD3at9QUxqgm', 2, 1, '2025-11-18 10:27:52', '2025-11-18 10:27:52'),
(185, 'ziad', 'u', 'u@b.com', NULL, NULL, 'image-1763470281414-422223456.jpg', '$2b$12$CMr6DeFu4lKuptCqlc1qIeOVLSnWXMcQknZ4quurFQomdAA26npgi', 2, 1, '2025-11-18 12:50:26', '2025-11-18 12:51:21'),
(186, NULL, '4e79c47b-733b-470c-a016-397981f2cdd8', NULL, NULL, NULL, NULL, '$2b$10$kx7VVjXB7wMffmJ5JfXjqe/4SjD0UsVOIXXI7FGTQAMr/.vPV1Miy', 3, 1, '2025-11-18 13:11:07', '2025-11-18 13:11:07'),
(187, 'Mohammed', 'mabdelfattahm99', 'mabdelfattahm99@gmail.com', NULL, NULL, NULL, '$2b$12$ibSL9PbegPubeehIw/dejOBJKPRTPYIILIxGYhNxjYW6DYFZkOLVG', 2, 1, '2025-11-18 13:35:15', '2025-11-18 13:35:15'),
(188, NULL, '1dc10a5d-3310-403a-a6c6-316275557e4c', NULL, NULL, NULL, NULL, '$2b$10$lF563fzs3lgkqlWgKxu.eOhJlkvX5NeL5QdFJdYUxwKS8WXxnchNS', 3, 1, '2025-11-18 14:05:39', '2025-11-18 14:05:39'),
(189, 'user10', 'user10', 'user10@email.com', NULL, NULL, NULL, '$2b$12$l3W6obKtqMQYgGLLpdhvgOfMc1utbAMRh/3AJwVt0ZySkjysfU9CK', 2, 1, '2025-11-18 14:07:55', '2025-11-18 14:07:55'),
(190, NULL, 'e3ce7f40-bfdf-4649-a7c1-8c67b761f28c', NULL, NULL, NULL, NULL, '$2b$10$WhcD3GIajNlKxptImfzjmeM3RvjoVLPz8R.WoCOONxev1YtuUpXPm', 3, 1, '2025-11-18 15:56:44', '2025-11-18 15:56:44'),
(191, NULL, 'bd482387-f991-459f-ad7b-7051f58fd585', NULL, NULL, NULL, NULL, '$2b$10$B2r88ruhA.2f0mjSePa9SuG6HUEAMU2l1yrYqjIeGyKiCwmf/maIG', 3, 1, '2025-11-18 16:43:47', '2025-11-18 16:43:47'),
(192, 'Ahmed Sabry', 'ahmed_sabry2010', 'ahmed_sabry2010@live.com', NULL, NULL, NULL, '$2b$12$auXB8tYEOVhSfUzW321Bz./EB84PxquA0.PwNN0QGQhBZy6gcS5i2', 2, 1, '2025-11-18 16:44:51', '2025-11-18 16:44:51'),
(193, NULL, '1482f6fe-ecff-4081-ab01-868d1f6d86d6', NULL, NULL, NULL, NULL, '$2b$10$0xm39LG4VoXJYcE2y3lTseYlvb5QnKNKgh7x9a2vZZjwSv9KSzBp2', 3, 1, '2025-11-18 17:27:16', '2025-11-18 17:27:16'),
(194, NULL, '5e2b5489-1781-4fb3-8fb8-40862e2c8c23', NULL, NULL, NULL, NULL, '$2b$10$cTH4a2cfidzs/BcoHYmjoemoBoSwUA7ibecwLc8fFdvwSPclHU5ka', 3, 1, '2025-11-18 17:28:19', '2025-11-18 17:28:19'),
(195, NULL, 'd7ede3c7-2650-465d-9cdc-9907efe7b476', NULL, NULL, NULL, NULL, '$2b$10$4ShzEU3Ozulwaar.hee2Sei1Zd6v5xDd/89Dik.4O06d43IaWrCw.', 3, 1, '2025-11-18 18:20:47', '2025-11-18 18:20:47'),
(196, NULL, '6b64aaab-bd49-40d2-a810-43bd2dcea9ae', NULL, NULL, NULL, NULL, '$2b$10$90pu2fKacnmJPxolSdcGUuWj0LTf7HgVAwJKa7PJiLk26qpvsoeh6', 3, 1, '2025-11-18 18:21:16', '2025-11-18 18:21:16'),
(197, NULL, 'a616df17-3447-4de0-afe6-81688c8d11b7', NULL, NULL, NULL, NULL, '$2b$10$4oI9ZlYR9GLY0zplSEE/g.9rsusS8TJloqXW.BxmSq34nnZDesGSm', 3, 1, '2025-11-18 18:42:50', '2025-11-18 18:42:50'),
(198, NULL, '8b4b7cc7-d2ff-4fd1-ae7e-ce6d3e6bbe72', NULL, NULL, NULL, NULL, '$2b$10$TW8L.MReOkCvg62kvoo7aOK9d8IUTO7J6ObOt8zjURUzXA7sp5V0C', 3, 1, '2025-11-18 19:24:18', '2025-11-18 19:24:18'),
(199, NULL, '92071211-c09b-4679-a71b-51e2f9b51e99', NULL, NULL, NULL, NULL, '$2b$10$mM3YRGNXZ/P.IJEJIYVFkekG.Sjjt3aMDNSw9BgJnmoUtjOIWJwN2', 3, 1, '2025-11-19 01:46:39', '2025-11-19 01:46:39'),
(200, 'Basel ', 'baselhesham18', 'baselhesham18@gmail.com', NULL, NULL, NULL, '$2b$12$yZh2BxXC/erw7Fp1EVzpkuSwu3MWe4PoF.Nuqoa4hm9eHzrA2cw1C', 2, 1, '2025-11-19 01:48:25', '2025-11-19 01:48:25'),
(201, NULL, '7f17a602-6bdf-49be-b077-e35174d34534', NULL, NULL, NULL, NULL, '$2b$10$iV9tWa951Vnfh7ezNzkBkusbb016FnnSZmVuM9byvM3gr4WND7Ism', 3, 1, '2025-11-19 01:53:10', '2025-11-19 01:53:10'),
(202, NULL, '52373b8f-45a8-4d2e-88f0-7c4992f332a0', NULL, NULL, NULL, NULL, '$2b$10$wbfb00VC2gjbiFh7YFrdQ.xPyl0x9utBbuQmKlne3b/QOq7CE4D/O', 3, 1, '2025-11-19 07:41:10', '2025-11-19 07:41:10'),
(203, NULL, '395d1b25-ff50-4bb3-a4ce-7d50ef3bc725', NULL, NULL, NULL, NULL, '$2b$10$eIh754QIE1qsZkHmZOyqnOqv5DKBMgGzIt0wReEy.EioBjV61OQ9.', 3, 1, '2025-11-19 08:10:38', '2025-11-19 08:10:38'),
(204, NULL, '09af7f18-ece2-4958-ab56-c261bb4b4ad5', NULL, NULL, NULL, NULL, '$2b$10$QBGMQ7S0kTo6YZL5P/ma5OMy3qfljXT8cQxWnCPigvuNKLpPCBVQK', 3, 1, '2025-11-19 08:34:20', '2025-11-19 08:34:20'),
(205, NULL, '7c2c7a1f-6e84-4cc4-9c44-dcb4bdc22fe3', NULL, NULL, NULL, NULL, '$2b$10$hW44s.WRwySPzm8LPMr95uZ6ySWzmjaknXmN4S09OrniSAyBMjVCi', 3, 1, '2025-11-19 08:36:18', '2025-11-19 08:36:18'),
(206, 'Abdelrahman Bedair ', 'abdelrahman.beder.45', 'abdelrahman.beder.45@gmail.com', NULL, NULL, NULL, '$2b$12$Ff1nF90jfxnIi3nURwfKPO7WDs4vMEV.ezAm1liyI42bqYvCyHXtu', 2, 1, '2025-11-19 08:37:04', '2025-11-19 08:37:04'),
(207, NULL, '0d4407f8-41d9-4e1c-a795-9e8858e58add', NULL, NULL, NULL, NULL, '$2b$10$DMzclmhktdPJi3YxrpF1kuj2DL0nqmwTMaEU0yFQmP5E3wK9YNvma', 3, 1, '2025-11-19 08:51:18', '2025-11-19 08:51:18'),
(208, NULL, 'bbd41c25-333f-4da0-b9ab-e7075eb2e507', NULL, NULL, NULL, NULL, '$2b$10$fvGLXu1n4vK.InMT.evDSekRdj03ZA.LJWtX5ye9PGa/YPElWDsvm', 3, 1, '2025-11-19 09:41:22', '2025-11-19 09:41:22'),
(209, 'Kamel Mohamed ', 'kamelmohamedkamel', 'kamelmohamedkamel@yahoo.com', NULL, NULL, NULL, '$2b$12$w2UtLQ3fo0BKPHmsk6842.aMNzwHOYhZfHyNeCewdTDBi8NXmXAS2', 2, 1, '2025-11-19 09:42:40', '2025-11-19 09:42:40'),
(210, 'Tarek', 'tarekofficialmail', 'tarekofficialmail@gmail.com', NULL, NULL, 'image-1763558953122-780581360.jpg', '$2b$12$lilmczTmJPmmGz9p4xiTSeuFVebZlOZnb4ynxdIXlBhPU4p5syy3q', 2, 1, '2025-11-19 11:34:27', '2025-11-19 13:40:54'),
(211, NULL, '6c9a8e1f-572f-4bc6-8fed-749658317e93', NULL, NULL, NULL, NULL, '$2b$10$iSHxE1ECou4x7cROUBFLJe/vxBfATj4OqNn32HXqnAp31iQGTPUL.', 3, 1, '2025-11-19 13:48:57', '2025-11-19 13:48:57'),
(212, NULL, '78819f05-d780-4adf-96cf-a1a995a46d46', NULL, NULL, NULL, NULL, '$2b$10$fGnfHR0Cz61kj0jDyxI6VeVNUryaPC1HSgUya0VNpkL/ilDsHyAT.', 3, 1, '2025-11-19 14:30:45', '2025-11-19 14:30:45'),
(213, 'arwa sadek', 'arwasadek419', 'arwasadek419@gmail.com', NULL, NULL, NULL, '$2b$12$Xkt0BQsAUO4Msdh3z6XrvehWUeeVuhDW9wJIiuIYatvmHcpm/7avm', 2, 1, '2025-11-19 14:32:13', '2025-11-19 14:32:13'),
(214, 'ziad', 'ziadhesham280', 'ziadhesham280@gmail.com', NULL, NULL, NULL, '$2b$12$Qs6af96R2pbx6c2299fMMOoIJZ0LuNJYwoIpczfs3einV7tlHE4FG', 2, 1, '2025-11-19 15:58:10', '2025-11-19 15:58:10'),
(215, NULL, '11ade1c5-c5ad-431a-a2a6-fb3b65f5e7c6', NULL, NULL, NULL, NULL, '$2b$10$lzUz4NN5inOMzJHS25n.4.9/j8up2omCmbn6WY1s4ESOP7PefN8gi', 3, 1, '2025-11-19 16:09:09', '2025-11-19 16:09:09'),
(216, NULL, '52a3fa34-2075-4706-917e-38e9c75a86c7', NULL, NULL, NULL, NULL, '$2b$10$7DS5ispkwfPoXmJWu9mnnOZRWQoCHvHR4Lnvgj908viNOe0X1uMZK', 3, 1, '2025-11-19 16:32:54', '2025-11-19 16:32:54'),
(217, NULL, '106990a5-62be-4f9f-b5da-50e41679678d', NULL, NULL, NULL, NULL, '$2b$10$ZkB53xCROZh2t5MQs9YiluguxD2OTq3iQ5Z6GlycRP3ImO3/mgG3m', 3, 1, '2025-11-19 16:34:08', '2025-11-19 16:34:08'),
(218, 'Yaseen', 'itisysn', 'itisysn@gmail.com', NULL, NULL, NULL, '$2b$12$fUaPLrenGYM3FzJQZOOcOeadhkKKpGgZUVm2z6037p.98b8yoAKxO', 2, 1, '2025-11-19 16:34:40', '2025-11-19 16:34:40'),
(219, 'Muhammad abdulqader', 'medokhadr94', 'medokhadr94@gmail.com', NULL, NULL, 'image-1763570456912-626912242.jpg', '$2b$12$waskxYLatGvbmzU8JkgMve.x6qTcRVSEuxghrpGsXGrRZ/Hwy1pWe', 2, 1, '2025-11-19 16:40:15', '2025-11-19 16:40:56'),
(220, 'Nouran Genena', 'norangenena1', 'norangenena1@gmail.com', NULL, NULL, NULL, '$2b$12$eFIpeME4Alb7/xTYSByskOiIiMCcsvIW5rYrfBvdYhHSoV0FHM8Ya', 2, 1, '2025-11-19 16:40:36', '2025-11-19 16:40:36'),
(221, NULL, '916d3082-4168-4a12-a6e5-c260a83d3518', NULL, NULL, NULL, NULL, '$2b$10$VURjfbGO9Y..WFRX0HB3FOqQv1xfWuOQFjlpRU8Xjgs1LeJK4EXXK', 3, 1, '2025-11-19 16:47:07', '2025-11-19 16:47:07'),
(222, NULL, '903bc7d9-c659-4679-945a-8c744c2c912d', NULL, NULL, NULL, NULL, '$2b$10$LIiGW9jl806yUW29xlmRD.4rhdUJx.ksVkrX5GCXvE/hJej2omSr6', 3, 1, '2025-11-19 18:03:52', '2025-11-19 18:03:52'),
(223, NULL, '9848658a-8f56-4ac7-aede-a1cdb89f528f', NULL, NULL, NULL, NULL, '$2b$10$qChOMBwC8QyQ3qTzjQkWPu01l.ZjYikl58K4hDzV4FZ3AFlkW7sfy', 3, 1, '2025-11-19 18:29:05', '2025-11-19 18:29:05'),
(224, NULL, 'a9e5e275-cda0-4698-a6fb-7936c8ea4784', NULL, NULL, NULL, NULL, '$2b$10$N10FBcZHWuHNG0MwpoLdHe1rKnvvIvpWmG6b.PPaYxdzQNZKmJI26', 3, 1, '2025-11-19 19:01:35', '2025-11-19 19:01:35'),
(225, NULL, 'ade73728-8e47-45c8-976e-00d462a23151', NULL, NULL, NULL, NULL, '$2b$10$yuZ1mkOK4z.xIgkCCv.DIuw2yrdVgnF33uGIX.xxpjFBiio2bf/yu', 3, 1, '2025-11-19 20:27:43', '2025-11-19 20:27:43'),
(226, NULL, '05113c2a-cb65-49ab-8cfe-18e123e1ea52', NULL, NULL, NULL, NULL, '$2b$10$SFpMO/2MK2J0wljNylium.oy6aSVlrXlSyTysCwGbMsNQPj5LYw2q', 3, 1, '2025-11-19 20:30:46', '2025-11-19 20:30:46'),
(227, 'Zaid ', 'zaidallmatari', 'zaidallmatari@gmail.co', NULL, NULL, NULL, '$2b$12$Sp8Q42AgDfJBjKEMadqA5.t9I45kk4x8yVet5n6iUkOg.4TyRaCWi', 2, 1, '2025-11-19 20:38:11', '2025-11-19 20:38:11'),
(228, NULL, 'fb859c49-9a0c-4f96-a3bb-d603db3816fb', NULL, NULL, NULL, NULL, '$2b$10$geMOO3iwwz6UOLwoijBTrOT7ZFmUQIagFcSSNP7SKoOKi/H8Jg8AW', 3, 1, '2025-11-19 20:54:58', '2025-11-19 20:54:58'),
(229, 'Ahmed', 'ahmedezzat.uiux', 'ahmedezzat.uiux@gmail.com', NULL, NULL, NULL, '$2b$12$1vZYmrmsFua/0JS34nVe1uRZ9pR.5XRvHIbVfmmZvcK1/QrZ5lBtm', 2, 1, '2025-11-19 20:56:11', '2025-11-19 20:56:11'),
(230, NULL, '5176afe2-40e4-4165-9de0-c36288e992ad', NULL, NULL, NULL, NULL, '$2b$10$LxlojAsKrriFbl6inxxxYOstq9oR52oRhFijlvPJQ6zVpjBhqez6K', 3, 1, '2025-11-20 06:43:40', '2025-11-20 06:43:40'),
(231, NULL, 'c098977b-4316-487e-94b8-a03a03de7159', NULL, NULL, NULL, NULL, '$2b$10$kwlLZDiRQvovFvog0H8Ei.Is6hANh4lc.nbG0zqPqXtrHcz7rY2/O', 3, 1, '2025-11-20 08:14:12', '2025-11-20 08:14:12'),
(232, NULL, 'f0f436b1-2051-4782-942a-af3f2d296e65', NULL, NULL, NULL, NULL, '$2b$10$bUefbixSujoirlIG99Ozr.FhZQdXrDf1dmvGoCfY2rqrWmJIOn5UW', 3, 1, '2025-11-20 08:22:52', '2025-11-20 08:22:52'),
(233, 'Dhoha', 'raihanahit2016', 'raihanahit2016@gmail.com', NULL, NULL, NULL, '$2b$12$qu.uGU0IfcPXLqu6b8by1e3Jv3E33aIyljs/PgvLb8XKLcxjUPs7C', 2, 1, '2025-11-20 08:32:13', '2025-11-20 08:32:13'),
(234, NULL, 'eae7adc1-d19b-4c65-8562-5c3d07b07f07', NULL, NULL, NULL, NULL, '$2b$10$JXS4y./PbKmrLnO1jqb3NOjJWH4gb6OsPpVKmMu1iUIAMFXSrTBHa', 3, 1, '2025-11-20 08:40:36', '2025-11-20 08:40:36'),
(235, NULL, 'efebd53b-4cb3-498b-8278-f42f1956c9fa', NULL, NULL, NULL, NULL, '$2b$10$6/Z0Fbl0FOuKQK3Fm9W24e9DPg3wAAP6V0mHvPg7KisdUT5hIbhPK', 3, 1, '2025-11-20 12:39:26', '2025-11-20 12:39:26'),
(236, NULL, 'accb174d-c77b-4ecf-aeec-2520b63d8f38', NULL, NULL, NULL, NULL, '$2b$10$XEV11ZU4jsZSMLTCG.335unjcbTyB52Pf6cNYfjUx8XiOO9iSqUg6', 3, 1, '2025-11-20 13:20:26', '2025-11-20 13:20:26'),
(237, NULL, '23199391-f940-488c-b361-b2a9d3528026', NULL, NULL, NULL, NULL, '$2b$10$Lj1WquGOBkvtKxJPjUMQYe/FxoHfPD4dnIEMO/qnYpvGzA7BWcgHS', 3, 1, '2025-11-20 15:43:50', '2025-11-20 15:43:50'),
(238, NULL, '659f539f-1ee8-4fdf-a2fd-7360ab682c08', NULL, NULL, NULL, NULL, '$2b$10$bj46xx0GRTp1Qjjsj235FuMrcy6aI2gxIs.p4I.MnYp5jYw0uCvvC', 3, 1, '2025-11-20 15:54:47', '2025-11-20 15:54:47'),
(239, NULL, 'e8889c15-4d49-42b6-8674-6b90dcc05981', NULL, NULL, NULL, NULL, '$2b$10$OG3Y.r7KUZKiKCORzWXAte8Le6oC74milcHz/UWvr8juH7f9SxmuW', 3, 1, '2025-11-20 17:38:43', '2025-11-20 17:38:43'),
(240, NULL, 'bc8bf377-9dc8-4429-85fa-eb8fb9324653', NULL, NULL, NULL, NULL, '$2b$10$j/NiZD74nVkvBlcJBpZ5ce8fPPjbctNqLUcmnBP0b8Pcn8ZX6y0g6', 3, 1, '2025-11-20 18:26:15', '2025-11-20 18:26:15'),
(241, NULL, '56192588-9232-4176-8793-99eb7662fb0f', NULL, NULL, NULL, NULL, '$2b$10$pv1EcYoMX6aYs.WcV/U4Tur9e4JYJsgpHHanJItKq7wTUPoyda8Ym', 3, 1, '2025-11-20 18:30:50', '2025-11-20 18:30:50'),
(242, NULL, '5bf2842c-74a7-4af9-a7b1-7936ca89d57d', NULL, NULL, NULL, NULL, '$2b$10$PfjdRx09.c5G1k.GdLCwA.fIC8zkE8jld66rys/S3AOAjW1aw26EK', 3, 1, '2025-11-20 18:31:44', '2025-11-20 18:31:44'),
(243, NULL, 'cf96b11d-e319-4d55-acb3-9da5fd8f237f', NULL, NULL, NULL, NULL, '$2b$10$fI9VOO9yd6Pa1hqQrn277ujdOhr6kL5pdlduDMLMfKfdvyQiwrKHS', 3, 1, '2025-11-20 20:11:51', '2025-11-20 20:11:51'),
(244, NULL, '8ba250ed-3d11-40a6-ab1b-b2b521a44f48', NULL, NULL, NULL, NULL, '$2b$10$iNDCNO1BA7DhB18TiF22fOgmJu1OJRXe9rqcZ.FRSNMDxbd//4TsC', 3, 1, '2025-11-20 21:46:15', '2025-11-20 21:46:15'),
(245, NULL, '393b1797-3b78-4a7a-93ba-07663e8ef455', NULL, NULL, NULL, NULL, '$2b$10$8sJazC7tWb2HwNPlMPCpGu8iIBAF.hNpSVz/n8V0qBX7qBRItJX6G', 3, 1, '2025-11-20 21:46:34', '2025-11-20 21:46:34'),
(246, NULL, 'ec7fcdcc-03ca-4343-b3f3-0f299b6733e3', NULL, NULL, NULL, NULL, '$2b$10$1BfRmbChzSXgn4dxvNS9r.zg9BHsGwRavgGd24Z.cLvm3HOsLwf26', 3, 1, '2025-11-20 22:11:48', '2025-11-20 22:11:48'),
(247, NULL, '050d1c37-4891-48d6-8dac-4cb7173ea396', NULL, NULL, NULL, NULL, '$2b$10$RsQwfo5xrZATtL5M5LXhz.s90KjOPh1aMUzc5KzEZ9Le070Hqb1sO', 3, 1, '2025-11-20 22:26:08', '2025-11-20 22:26:08'),
(248, 'Ali kamal', 'aliang1400', 'aliang1400@gmail.com', NULL, NULL, NULL, '$2b$12$9WE0OIzyb6gmcxhM2sDJwua3nTblG7dOTauFqnNAxaVMH.99wx90K', 2, 1, '2025-11-20 22:26:35', '2025-11-20 22:26:35'),
(249, NULL, '78644089-daff-42c2-a51d-3552132b9662', NULL, NULL, NULL, NULL, '$2b$10$9g.Qutepdv9NAtoMDvlnWelZEfTktXkFIbiKwAVidvz72KJM5av8S', 3, 1, '2025-11-20 22:39:52', '2025-11-20 22:39:52'),
(250, NULL, 'ad7d2851-4842-4aa7-9ace-44ddeb12c5ad', NULL, NULL, NULL, NULL, '$2b$10$iLsHtnfEs4Th6A8keKg5KukI6.zpQqjprTzWRyeD7.ZNLF2gfq1e.', 3, 1, '2025-11-21 04:18:04', '2025-11-21 04:18:04'),
(251, NULL, 'd7e48a21-39b0-44a0-9ef3-a8dc4f1467f1', NULL, NULL, NULL, NULL, '$2b$10$Ks..JLcB/aABWBHPu1ToveVc7.X3nK/sRg50bGIVnShvjAY/bSJTa', 3, 1, '2025-11-21 14:12:49', '2025-11-21 14:12:49'),
(252, NULL, '42ec1e2d-b5fd-4d65-bc95-12df1402874b', NULL, NULL, NULL, NULL, '$2b$10$WdH////KIVFLQhm9TL0IPORIY2YACpNy81ga50sqXqUiEVdedPAiq', 3, 1, '2025-11-21 16:13:28', '2025-11-21 16:13:28'),
(253, NULL, '6c40469f-9a9b-48a5-a113-d955e87818fa', NULL, NULL, NULL, NULL, '$2b$10$1mOK.4MUzm4X8zWXwhN4eufJZlgRPCL.vRq8.jiIqWO7UlPoszfrC', 3, 1, '2025-11-21 19:52:02', '2025-11-21 19:52:02'),
(254, NULL, '2118b110-0f28-4d1c-acc6-07503e784454', NULL, NULL, NULL, NULL, '$2b$10$OIiVqFX724j/WDS75Gu.U.gKeXdeZGEvX1OT3BnoHjlfMpYKykaDy', 3, 1, '2025-11-22 05:38:04', '2025-11-22 05:38:04'),
(255, NULL, 'f8e865d3-f21a-4de9-8c0c-f56dec6fb6fe', NULL, NULL, NULL, NULL, '$2b$10$uQKbZ2Nz589ohiTdnS16V.TmriUkalwfhAdph4CL4ziMmdPC.RYqm', 3, 1, '2025-11-22 05:54:26', '2025-11-22 05:54:26'),
(256, NULL, 'de391e05-5aac-426d-8e59-ed8bdd1f51da', NULL, NULL, NULL, NULL, '$2b$10$OTJNNHCM6r9FkP3O.oUAcuTEdzVZ7YMATes.bbzVxEUENwjuyBKN6', 3, 1, '2025-11-22 08:55:49', '2025-11-22 08:55:49'),
(257, NULL, '8a3454bd-22ca-4f40-926c-700b9d68b24b', NULL, NULL, NULL, NULL, '$2b$10$KrUss1yVSRLvbsbonCNtD.8RnDxW00fOhw0l6ahF44vFw7EWtyiAq', 3, 1, '2025-11-22 10:17:35', '2025-11-22 10:17:35'),
(258, 'Abdulrahman Mohamed Kamal ', 'abdulrahmanm.kamal2003', 'abdulrahmanm.kamal2003@gmail.com', NULL, NULL, NULL, '$2b$12$q2m.O/o7E1I.51lzxZXcFesWESTOZHMdpxHtpJJggyjaCO.KfAsFW', 2, 1, '2025-11-22 10:21:42', '2025-11-22 10:21:42'),
(259, NULL, '75ce9cb9-8540-488e-b6da-2d8bbd7667ab', NULL, NULL, NULL, NULL, '$2b$10$BOfwqAQ8lq0JWCtOEUE4GebJp8bSlfCD/y683u3ebUgXJV8EeUt8m', 3, 1, '2025-11-22 10:41:16', '2025-11-22 10:41:16'),
(260, NULL, 'dc9d1d46-5f89-4216-ad24-320863d0a4e3', NULL, NULL, NULL, NULL, '$2b$10$maCU7zmzhleYFB0Yc8X3OOMsY8oczIGlKOi9h34fWD9ZS0pCSK3GK', 3, 1, '2025-11-22 12:38:10', '2025-11-22 12:38:10'),
(261, NULL, 'a03379cb-1dd6-446e-8df1-d7b564e85b28', NULL, NULL, NULL, NULL, '$2b$10$8yr7JDlP1xg.FUSa7BidJOI6wOgXG.BYq7bpF558rjY5DVVa4CmjC', 3, 1, '2025-11-22 12:47:05', '2025-11-22 12:47:05'),
(262, NULL, '51c4e9b9-27ea-46c8-8ea8-e243f41b6116', NULL, NULL, NULL, NULL, '$2b$10$W17Sy.G4HayIiAxHNwt53e25ZwlJwggMx3kMyV.wmZ/wcMYkvT.NG', 3, 1, '2025-11-22 14:13:02', '2025-11-22 14:13:02'),
(263, NULL, '6563450c-cc99-4ab0-8f1c-c60b201b2f39', NULL, NULL, NULL, NULL, '$2b$10$e7PzbgMLm2Zu5uKg.zZTA./GhBf.gu9kxTsWtPb2wsa6HZBWaeIWi', 3, 1, '2025-11-22 14:59:02', '2025-11-22 14:59:02'),
(264, 'Hanan Nagi', 'hanannagitageldeen', 'hanannagitageldeen@gmail.com', NULL, NULL, NULL, '$2b$12$Um6RWwfvm/K.uEV4r2jGG.Xfo2rxpRE.ZTOx70q4GA3afrfaQ6X6m', 2, 1, '2025-11-22 15:00:27', '2025-11-22 15:00:27'),
(265, NULL, '9951c161-070b-4a4a-9650-4a2fb7b31453', NULL, NULL, NULL, NULL, '$2b$10$akJNqJcRM9tsWmNNx3fsce.KEqH8cZeh3I2SI8xFk2C6AkIvKAJEe', 3, 1, '2025-11-22 15:04:53', '2025-11-22 15:04:53'),
(266, NULL, '05ecadf4-b7b7-4e6a-a023-8da1114b2dbe', NULL, NULL, NULL, NULL, '$2b$10$rBZuv1ahB.jLYxtmIPQGge9gmwWy1agBejyrADItROKONpR7gQzG.', 3, 1, '2025-11-22 15:42:41', '2025-11-22 15:42:41'),
(267, 'user11', 'user11', 'user11@email.com', NULL, NULL, NULL, '$2b$12$Zlcl905I2AtlKRuDgXlhzeAJG9r7/OcFaL1f3tUmcSjH2M32sMhLq', 2, 1, '2025-11-22 16:01:13', '2025-11-22 16:01:13'),
(268, NULL, '0c766316-a333-4903-a1a5-3e69db0d12df', NULL, NULL, NULL, NULL, '$2b$10$jJ0nS8Hq0c0aHqI.LAA2pOj1NytCT9posOv/gD4nzgQVNEc6rKGI2', 3, 1, '2025-11-22 16:03:46', '2025-11-22 16:03:46'),
(269, NULL, '3649680b-0a16-4dc5-967f-98ecd054c182', NULL, NULL, NULL, NULL, '$2b$10$mcPDajYw9dWGt0eznjl4XewHCGIdwLCvDGGwDcbyrFVx0cMAYAfb.', 3, 1, '2025-11-22 16:03:56', '2025-11-22 16:03:56'),
(270, 'user12', 'user12', 'user12@email.com', NULL, NULL, NULL, '$2b$12$vEKUBnnMKEV5Dod2.K7nNem2U7gKyW8GsQFvSvNCFBa9NZvFErypy', 2, 1, '2025-11-22 16:08:09', '2025-11-22 16:08:09'),
(271, NULL, '0e04c13d-d6f6-4829-a8be-ff7a7355b72b', NULL, NULL, NULL, NULL, '$2b$10$r3e49sEHf8SscR5eIL1Qne54APZD.e.qqZKFEo0f7qIX7jNgu325u', 3, 1, '2025-11-22 16:13:49', '2025-11-22 16:13:49'),
(272, NULL, 'e110c19c-f976-4b3c-a1f3-d290c049b478', NULL, NULL, NULL, NULL, '$2b$10$B.FSb34zY29uHVaFcHtceuBbyAt9GzuAZQEhUlwAWul644tEUgmfu', 3, 1, '2025-11-22 17:16:06', '2025-11-22 17:16:06'),
(273, NULL, '252741c0-c111-43e1-aa15-b9f001b06735', NULL, NULL, NULL, NULL, '$2b$10$P.x06CWiQzFHi6L8F4Dd5.cZUAtle/J1ddClfmJB9EV/PlwRjhOlO', 3, 1, '2025-11-22 17:35:07', '2025-11-22 17:35:07'),
(274, NULL, '40ba47dc-52d3-401d-b403-2f9e9599b001', NULL, NULL, NULL, NULL, '$2b$10$XFwKPCt0ewHGwM05KC3Kr.BJJTIA11rxF2Tco6yX8.eqIrOFZpspm', 3, 1, '2025-11-22 17:35:37', '2025-11-22 17:35:37'),
(275, NULL, '45e77bd5-6025-4d90-a7c4-f27fc112b5e1', NULL, NULL, NULL, NULL, '$2b$10$ME5s25u/tY9fzPQwlT./Yuj2du5Kdb5GBsOoBIzKPmnT4RyiBKl9.', 3, 1, '2025-11-22 18:01:03', '2025-11-22 18:01:03'),
(276, NULL, '801549cf-4301-4781-b745-fd29d574a5d0', NULL, NULL, NULL, NULL, '$2b$10$8zPnq8RHvWOpKpwGZeFUOOOlbsKy/t8nVsKXbUMaDOIvU0m0x3HRy', 3, 1, '2025-11-22 19:10:42', '2025-11-22 19:10:42'),
(277, NULL, '91445b8f-8d68-475f-acb4-f5c3fa1db7da', NULL, NULL, NULL, NULL, '$2b$10$e8k5t0JOJ1DwsRw4Icp.ee0u8UCahAxSx.nuBSuNKAGjQWgotJKRK', 3, 1, '2025-11-22 20:11:23', '2025-11-22 20:11:23'),
(278, 'Gohari ', 'ahmedalgoharixv', 'ahmedalgoharixv@hotmail.com', NULL, NULL, NULL, '$2b$12$Ek6nCyWXpD9wvR/f5KioI.2ao5U0Wj42qS/6Odn4BDueSV6PtSInu', 2, 1, '2025-11-22 20:14:08', '2025-11-22 20:21:28'),
(279, NULL, '397b7a63-b14d-4541-b8fb-bd8da757e8d4', NULL, NULL, NULL, NULL, '$2b$10$YE3rntKDhPRpwe9CQUvQveTrcLuuQUL8GfvwREl7LHKx.fKnwQzOa', 3, 1, '2025-11-22 20:28:00', '2025-11-22 20:28:00'),
(280, NULL, 'e0d6deaf-54e1-4427-82d3-432711475bce', NULL, NULL, NULL, NULL, '$2b$10$11.RYg6KKePnJ65y4RlhTeW19V3nU0jVAauMx0BTopK9TRWdzX7CW', 3, 1, '2025-11-22 20:34:05', '2025-11-22 20:34:05'),
(281, 'Shrouq ', 'shrouqsalah2008', 'shrouqsalah2008@gmail.com', NULL, NULL, NULL, '$2b$12$/R7bIUqqvcKfAxEpPNEFee9H69/e0BDlG03D/.C6cNRoPIo9JynmK', 2, 1, '2025-11-22 20:34:49', '2025-11-22 20:35:25'),
(282, NULL, '04e927cd-af03-41c0-9c18-dd968dfd12fd', NULL, NULL, NULL, NULL, '$2b$10$RfRzjDUVNDLQDXkYuPmMo.JlF8YKGs2pAYjHhHKvYrNyWP7y/XDvW', 3, 1, '2025-11-22 21:11:00', '2025-11-22 21:11:00'),
(283, NULL, '38d5a103-1313-4ac1-a1d7-499b41b8776b', NULL, NULL, NULL, NULL, '$2b$10$KC2k9f8IOosATvRwHDTgtuVVQ4Oy37vwDl3BQY1VlPwegefaDAxKq', 3, 1, '2025-11-23 00:29:57', '2025-11-23 00:29:57'),
(284, NULL, '568aad0a-d6e8-4e6b-8edd-f4e07edf27c2', NULL, NULL, NULL, NULL, '$2b$10$sUH6pAkpvksn0FMP2nn0f./4Lbbiz6JsyBndNE0ZvppOoO5zZfII6', 3, 1, '2025-11-23 09:38:51', '2025-11-23 09:38:51'),
(285, NULL, '70f36207-d89f-40e6-98d3-aab88d7c186d', NULL, NULL, NULL, NULL, '$2b$10$s45hTJbddE27kv85Bk09e.znkF.ctMohLWDqLP/9Z5.HEHqXAg1k2', 3, 1, '2025-11-23 12:37:35', '2025-11-23 12:37:35'),
(286, NULL, '3dee86f6-6cbb-44cb-930a-dd492c61dbda', NULL, NULL, NULL, NULL, '$2b$10$wJhXjsMEGkoPYUwJADMUc.1URGlSULnykT2WKdQVaLWkA7zBFM6Sm', 3, 1, '2025-11-23 14:16:25', '2025-11-23 14:16:25'),
(287, NULL, '2ba27458-b6c9-4fd2-946f-903753a70ab5', NULL, NULL, NULL, NULL, '$2b$10$WUN06m/6lUik2Kv8ujs/DOs7cYhW/oiJGePyWOiJjTcvB2//FJleS', 3, 1, '2025-11-23 14:22:18', '2025-11-23 14:22:18'),
(288, NULL, '8e629350-7328-426a-93cf-11b4e38f24d6', NULL, NULL, NULL, NULL, '$2b$10$QnxeTLDi0.Z8DPeKrsxflOXfS/wInanlPQ4vLSv70QZQDernsGY/6', 3, 1, '2025-11-23 14:28:08', '2025-11-23 14:28:08'),
(289, NULL, 'fe775d74-364e-43e6-b207-1f68a958965d', NULL, NULL, NULL, NULL, '$2b$10$LWOW2crnInX5T7cgjwm9TehcyWfaHQpsPqTsNF0OGoE1ohw4b4q5C', 3, 1, '2025-11-23 14:30:44', '2025-11-23 14:30:44'),
(290, NULL, 'eebed455-e4ac-4fc5-8957-c035300f0907', NULL, NULL, NULL, NULL, '$2b$10$QnNxjBh3.9jc5xuwMvDsjul1WrMIwE6sSGqaBPXzOUtArVeLz5uRa', 3, 1, '2025-11-23 14:51:13', '2025-11-23 14:51:13'),
(291, NULL, 'e688b27f-f4a9-459c-9ebb-5137a643cd88', NULL, NULL, NULL, NULL, '$2b$10$kDnMD5xt57yC815N8sRSR.4HL1toD172Vf/FSmAXTJMuh6FDg.HLq', 3, 1, '2025-11-23 14:52:29', '2025-11-23 14:52:29'),
(292, NULL, 'f01c1112-67ec-4fa8-9ced-3c3b352d88ce', NULL, NULL, NULL, NULL, '$2b$10$NvibReSxin9ZlNdWNAlVkuZUdIN87km3/bNxXuwdQhHA2ptpk7XmG', 3, 1, '2025-11-23 15:05:49', '2025-11-23 15:05:49'),
(293, NULL, '9c000a7f-13fe-47aa-b8ef-28f33c82a8c5', NULL, NULL, NULL, NULL, '$2b$10$z6shnmGhB5eL63EnE0ZfvuGAUJgMIhC.JMzx9cWTvxxqFF2NzqgVu', 3, 1, '2025-11-23 15:09:50', '2025-11-23 15:09:50'),
(294, NULL, '9aaeb0be-7b65-4ad9-aae7-598a16c0d9a5', NULL, NULL, NULL, NULL, '$2b$10$29lvhFuDcz9iWiIDT6nCzu7LYTK8regjGHqEvAUZIOAjgZD7fBVvO', 3, 1, '2025-11-23 15:40:45', '2025-11-23 15:40:45'),
(295, NULL, 'ca27f3a6-7540-4bea-a189-e6430d90b53b', NULL, NULL, NULL, NULL, '$2b$10$RXvpWB1VibIU656V.2R5Reb6SVaiNhNaobTfdKgQ5H3ziXqu0Wp6W', 3, 1, '2025-11-23 15:50:47', '2025-11-23 15:50:47'),
(296, NULL, 'de8a34c9-2392-4eaa-87c5-20e0bf173474', NULL, NULL, NULL, NULL, '$2b$10$ZXgd6NGbqOriIyPNi847VOhDk02Snzo8wS1lkZDdT4VHYsxFt1GY2', 3, 1, '2025-11-23 16:18:02', '2025-11-23 16:18:02'),
(297, NULL, 'c87aa25f-5f96-4f81-a53b-c0f85b5160b5', NULL, NULL, NULL, NULL, '$2b$10$vFDxwOKrt8D7ncLBEDwmH.sKM4.m3e6u28shaLhNygiQhlfy3Iy5i', 3, 1, '2025-11-23 16:18:59', '2025-11-23 16:18:59'),
(298, NULL, 'b4e0a1c7-77b1-4416-bb91-bc24d69fa673', NULL, NULL, NULL, NULL, '$2b$10$aoIo3nbEQ/xBYC4.fPbdPeiSFy./Z9V1K40LbmSwYmZJrPs8kl39W', 3, 1, '2025-11-23 16:21:17', '2025-11-23 16:21:17'),
(299, NULL, 'b5edba5e-1f28-4aa5-9a20-eb331551de22', NULL, NULL, NULL, NULL, '$2b$10$qFAaC5DMpuu02O.TmeoxTONtpbb/MAOevKl.nQHTq38wcr0eXxKl2', 3, 1, '2025-11-23 17:39:47', '2025-11-23 17:39:47'),
(300, 'Ahmed ', 'ahmedelashwah01', 'ahmedelashwah01@gmail.com', NULL, NULL, 'image-1763921392571-991196943.png', '$2b$12$ZyIeQkMcezsD8se6WVMSeuKtn26F.55XPgiled5PGeLO3yrnK0e1O', 2, 1, '2025-11-23 18:08:06', '2025-11-23 18:09:52'),
(301, NULL, '0aa476af-1fc4-4583-ae58-6cd753e0aa31', NULL, NULL, NULL, NULL, '$2b$10$9cL476wpcTtR5p8vJUfEietwls/2SwWNCOhOJirNY5lvG01OayZQa', 3, 1, '2025-11-23 18:18:59', '2025-11-23 18:18:59'),
(302, NULL, '47aeebe5-a0d4-4eea-af64-75b0b10cfd33', NULL, NULL, NULL, NULL, '$2b$10$Sl49UiovzjsxnkCilMmyFutJNDBfSyjWg8gNRAozOBnuJGKs2wck.', 3, 1, '2025-11-23 18:20:09', '2025-11-23 18:20:09'),
(303, NULL, '77bf1f28-0e73-4c2e-9983-9d90454eb26a', NULL, NULL, NULL, NULL, '$2b$10$95yV/9k8LlQZBlkBjT0/COULkmvzmHZDyfeRvXo7lTNJhfTr1U58i', 3, 1, '2025-11-23 18:26:04', '2025-11-23 18:26:04'),
(304, NULL, '7fbb11df-56d6-45ab-90d8-78e230d40cc0', NULL, NULL, NULL, NULL, '$2b$10$xRf4yaaZAm/cSMlPhi9XZeh5AxQ4P9gF/w/pQfJC0h0NOnd9T78uq', 3, 1, '2025-11-23 18:37:04', '2025-11-23 18:37:04'),
(305, NULL, '7291bb48-b138-4b0c-9b9a-c520f03d38f7', NULL, NULL, NULL, NULL, '$2b$10$G8ajs86BMbZUq99wDd66cunjRKkiasBdSnsVwwZvaQPBLqT1UjQYe', 3, 1, '2025-11-23 18:39:10', '2025-11-23 18:39:10'),
(306, NULL, 'd628e094-42ae-424a-b73e-9b1c272304ac', NULL, NULL, NULL, NULL, '$2b$10$1/hR/aA1JbCq8ba16nIpcejnuZUpRO6/FhDpMrw.O5uNOFNJRYOmK', 3, 1, '2025-11-23 18:41:28', '2025-11-23 18:41:28'),
(307, NULL, 'bda7b82b-63a1-478e-a270-36822f04cea2', NULL, NULL, NULL, NULL, '$2b$10$nARTnsYQGIFDhCARGYglIeZXFIet3z/KtvspRRNX59LDUCx.W9Q9O', 3, 1, '2025-11-23 18:43:04', '2025-11-23 18:43:04'),
(308, NULL, '31c5f953-6571-4b01-b48a-83634376d624', NULL, NULL, NULL, NULL, '$2b$10$K3fJNEfhgR3iNRtVg2BPt.5AD8RM.ocp7jwdcEvk0BwCXq8bIN3kS', 3, 1, '2025-11-23 18:44:05', '2025-11-23 18:44:05'),
(309, NULL, '622fc29d-b0d4-4d00-8367-affefc837735', NULL, NULL, NULL, NULL, '$2b$10$8Mj87flZ43IAxtKq/pWQHOuEh0kjCQ37dD/zFhIZslmT.dUc9SoSW', 3, 1, '2025-11-23 18:44:36', '2025-11-23 18:44:36'),
(310, NULL, '4aaca987-cc0c-4078-9a76-2e0d666ee483', NULL, NULL, NULL, NULL, '$2b$10$kjlv4faqwn0LLtgWM8AOH.6WYLd9CcJJMz2NOZ7ypTyEAmXRHIu5O', 3, 1, '2025-11-23 18:45:34', '2025-11-23 18:45:34'),
(311, NULL, 'c85c6a6c-51d9-4b69-a7a2-b640d68912c6', NULL, NULL, NULL, NULL, '$2b$10$HsAsy2hD4d92aQUGNQi47exfsIqbyKePSoHd9aYwAJpE7I6F52fdG', 3, 1, '2025-11-23 18:46:44', '2025-11-23 18:46:44'),
(312, NULL, 'a8e0ec58-2cc0-4f56-af8a-f6e533d29f0d', NULL, NULL, NULL, NULL, '$2b$10$eVve1h.wCUEMHg4fqh4ZnuXOSOgt6RYjllj5Z9oH8aqA5ZMnCKjW6', 3, 1, '2025-11-23 18:50:14', '2025-11-23 18:50:14'),
(313, NULL, '1609c969-16f5-47ee-8257-6d6237d1a615', NULL, NULL, NULL, NULL, '$2b$10$Zy.9RRTY8uTXKjBtV81ONOSOeFs9WHcCeg2dXNlD7.aYukUIIhC9u', 3, 1, '2025-11-23 21:06:56', '2025-11-23 21:06:56'),
(314, NULL, '2faeaa9b-424a-45a0-954b-07eef0c98ee0', NULL, NULL, NULL, NULL, '$2b$10$wLg2OBcMLscYkNM5HQEUGu0va8BIq615.gfKmm7uTL05iWZjmIgTW', 3, 1, '2025-11-23 21:44:45', '2025-11-23 21:44:45'),
(315, NULL, 'aaa04475-c7d1-4d74-b454-d944df2d8de9', NULL, NULL, NULL, NULL, '$2b$10$TX.Mb2gMKRntam/5CWxZee8H3qb9Q/byKbRvQOJUXuIa7YuRX3wLe', 3, 1, '2025-11-23 22:28:55', '2025-11-23 22:28:55'),
(316, NULL, '906f8045-8b27-4ce8-b809-8a5bdda70bfd', NULL, NULL, NULL, NULL, '$2b$10$DDO/.FgqG0XqkZb/IeDFnu4LcE.I9w9X/PA9qPsBILJDOcmRp8dk.', 3, 1, '2025-11-24 11:43:52', '2025-11-24 11:43:52'),
(317, NULL, '9a7c38c4-5e0c-411c-a90f-36ca87459579', NULL, NULL, NULL, NULL, '$2b$10$5xZaK0llZSaj4Mic2J7Ft.N0hKMyJ2AF7H.omh5VO72I.gRfp1Rja', 3, 1, '2025-11-24 12:29:47', '2025-11-24 12:29:47'),
(318, NULL, '70d33a58-03e2-41b5-a543-5c923089d17d', NULL, NULL, NULL, NULL, '$2b$10$f2Pei3owxlzaPrky.afd8epnQtnSXSLkWN.Ani55Lmk32TQTjR3.W', 3, 1, '2025-11-24 12:38:05', '2025-11-24 12:38:05'),
(319, NULL, '7850d69b-5265-410f-92da-a8d28b30260a', NULL, NULL, NULL, NULL, '$2b$10$OrWVcVylYPE2WTJNLy7tJOSPDyUUMcBaWbw1qHuVsAlIkvCCOVSCy', 3, 1, '2025-11-24 13:42:10', '2025-11-24 13:42:10'),
(320, NULL, 'd013aec1-9f45-4bdb-b7d3-56eb720f80a0', NULL, NULL, NULL, NULL, '$2b$10$q9JDhxE0OVKWb2.ofVmEOuUnX93UxTf/HLTipffbs6o53WGE.TIkS', 3, 1, '2025-11-24 13:48:53', '2025-11-24 13:48:53'),
(321, NULL, '534556a8-1e19-4275-b836-b4021ae1caad', NULL, NULL, NULL, NULL, '$2b$10$6f11bSJevA30DSclSuxaa.GfNWBJRCPn9fxel9/KG5ntS4q9m6TPC', 3, 1, '2025-11-24 14:07:01', '2025-11-24 14:07:01'),
(322, NULL, '8ea5da61-8ecd-4c9b-93f8-775c2997061f', NULL, NULL, NULL, NULL, '$2b$10$qLVydgtWs5CEUZrETpZL4OvKfpJhzNtRYIuzd9fEslnNKYi3croiK', 3, 1, '2025-11-24 14:07:56', '2025-11-24 14:07:56'),
(323, NULL, '76806117-5313-4d49-9639-2d20352091bf', NULL, NULL, NULL, NULL, '$2b$10$iL87NkNGwzbV/vBwiYU1J.kOy7IjOChgU.mSiap80v9I4bdn3.Hja', 3, 1, '2025-11-24 14:51:25', '2025-11-24 14:51:25'),
(324, NULL, '109e2491-4455-4756-8c29-fbbd090eb7e6', NULL, NULL, NULL, NULL, '$2b$10$pGSG/itDIxkY7F4w5E64C.FgVS3TfhZPa5XLoVtb328Q8V7icdMsS', 3, 1, '2025-11-24 15:48:28', '2025-11-24 15:48:28'),
(325, NULL, '86df5cdb-485e-4f12-a82a-093040039b55', NULL, NULL, NULL, NULL, '$2b$10$RrqGzbFf/2W7gxMEQfHMXO2k.AsXHCvYyDZOYVime1sn18dCnzsCa', 3, 1, '2025-11-24 16:03:43', '2025-11-24 16:03:43'),
(326, NULL, 'ce270d2a-0381-4bc4-b0ce-a6f2043d1766', NULL, NULL, NULL, NULL, '$2b$10$4BbPIjX27tjn3gpiqFGHaeRKDeusvP68tEXK4Yko2DqWgWHcjtqsi', 3, 1, '2025-11-24 16:06:03', '2025-11-24 16:06:03'),
(327, NULL, '4af7f79f-6199-487a-a123-36bcb7d8705f', NULL, NULL, NULL, NULL, '$2b$10$B0HoFGbvO6JJG6NrzOjs4.tiLW2f.OWhjo/NNQlq364wked4jkDU2', 3, 1, '2025-11-24 17:33:16', '2025-11-24 17:33:16'),
(328, NULL, 'c96611de-028d-4141-8bf6-3f85830a4d3b', NULL, NULL, NULL, NULL, '$2b$10$WwOY6qrRd0hkaxYO0ZCXzeHzz8ebQlPaWW1uri8WY1bE3r9Ooa.wa', 3, 1, '2025-11-24 18:06:54', '2025-11-24 18:06:54'),
(329, NULL, 'a8a77b12-0030-427b-b677-e2969dfc681c', NULL, NULL, NULL, NULL, '$2b$10$nEddPnhHE5b59HNq0fhhfub5DYPyqYsbqLAIFiBs54qGlDgGNxrBi', 3, 1, '2025-11-24 18:54:39', '2025-11-24 18:54:39'),
(330, NULL, '6c2de1a9-f004-44b6-85ea-70ba6a803238', NULL, NULL, NULL, NULL, '$2b$10$n0tOdrEkj.C/IA5/RVdYP.Rhyd5xvCzkUoXDehMsLnSwFJ.5kFnY2', 3, 1, '2025-11-25 02:46:42', '2025-11-25 02:46:42'),
(331, NULL, '818deb39-d6d8-4f17-b8ec-c3f0bbc5aa1b', NULL, NULL, NULL, NULL, '$2b$10$gTiGEp1TjjTK24LyUYOJMeJxmPYbGM6KUcyHaviutLg2GBB6dKobm', 3, 1, '2025-11-25 04:10:12', '2025-11-25 04:10:12'),
(332, NULL, '4de00504-0fe5-45d4-bd0b-33c35ebe2eb1', NULL, NULL, NULL, NULL, '$2b$10$6EtcXRwfAWHSGh9aPOnDMe1J99iImSB4FyGBQTeE4KjsLaOnIsB4.', 3, 1, '2025-11-25 06:30:47', '2025-11-25 06:30:47'),
(333, NULL, 'f0fc86b0-27f5-470c-844e-6d8018ccead7', NULL, NULL, NULL, NULL, '$2b$10$K6cpibuccffp8d7xHw8jEe16fuuFMr7lBrZWIjJ3lNvm5ivv2QlS6', 3, 1, '2025-11-25 07:01:19', '2025-11-25 07:01:19'),
(334, NULL, '42c4a8de-bb48-48e0-902b-62de6a082976', NULL, NULL, NULL, NULL, '$2b$10$NvYhUHFMGTBvVepgVjy7meMkU8pV04Qf/sLxuk00AdBHRZLo8l8hW', 3, 1, '2025-11-25 07:22:24', '2025-11-25 07:22:24'),
(335, NULL, 'ba81e51e-0239-491a-afed-65d2ad7ed5ef', NULL, NULL, NULL, NULL, '$2b$10$2XanZAsDxwJEL9ONt0qOhepNWvFYaxUcdd9NAcBPxoc4kptNLwXie', 3, 1, '2025-11-25 07:23:43', '2025-11-25 07:23:43'),
(336, NULL, 'f909eb36-4106-4afb-a3b7-85c651288672', NULL, NULL, NULL, NULL, '$2b$10$HEPEtQo0CPK70ifH93lm0erj3z605CBr.vC6QuT76DM96EktS6V9S', 3, 1, '2025-11-25 12:27:50', '2025-11-25 12:27:50'),
(337, NULL, '66a441f2-5c05-4a3e-8694-592033a8177b', NULL, NULL, NULL, NULL, '$2b$10$PCEEggyxi0WymZUGGShJHurADsPNRndUJPD2L8qpRVc5bGjUYZy.2', 3, 1, '2025-11-25 14:18:42', '2025-11-25 14:18:42'),
(338, NULL, '9c910f85-5a15-4d0b-936b-5a33a0e088e5', NULL, NULL, NULL, NULL, '$2b$10$bZwkxp6e8qW7DyYoaagCrOyqgMr4QeSSZLO4C3EUu/8D/K6N.aOtK', 3, 1, '2025-11-25 14:56:01', '2025-11-25 14:56:01'),
(339, NULL, '8f25707d-820d-496e-be03-8bff583ffae8', NULL, NULL, NULL, NULL, '$2b$10$F1pPIJJyDtM7CfeX6SY4nuyAh9NDO2Q9K/1Q.Ts9ni9fKrFbOnhYG', 3, 1, '2025-11-25 14:59:16', '2025-11-25 14:59:16'),
(340, NULL, 'fb283a71-c2a9-4174-b19e-f34e8037b2cd', NULL, NULL, NULL, NULL, '$2b$10$7z3CXplXUw3WRiGxn9SSqO72WuMPqYR35ePoJq01Cq2HSgufGjgZK', 3, 1, '2025-11-25 15:23:06', '2025-11-25 15:23:06'),
(341, 'magdi', 'engmagdi0', 'engmagdi0@gmail.com', NULL, NULL, NULL, '$2b$12$BcVXCROOmKPUxVp4mFM30ukixlqfZx5H3LghJq7ZCaMfgFiqo9W3S', 2, 1, '2025-11-25 15:23:46', '2025-11-25 15:23:46'),
(342, NULL, 'f6f083b9-398c-4f74-9b3a-5753213a6f7b', NULL, NULL, NULL, NULL, '$2b$10$bbF91PQS374MVK8evOmsIulIsUTzp2p5sF4UO6g2LIs/pOsoET2pm', 3, 1, '2025-11-25 15:50:56', '2025-11-25 15:50:56'),
(343, NULL, '76b0b79a-4f7e-44af-8b7a-ab8266105c4b', NULL, NULL, NULL, NULL, '$2b$10$lZ9ad9VYN.03./08MlgPfOMxFc7NywCgAWk1UTYu5Ka6Sc93uPiUS', 3, 1, '2025-11-25 15:53:01', '2025-11-25 15:53:01'),
(344, NULL, 'aed4adaf-352e-4e14-9862-b9556b12f8f3', NULL, NULL, NULL, NULL, '$2b$10$JAJ83b11yLKdN8lShinwmuoLBomMoqOrDwzXaDsVLKU/IZzahIaiW', 3, 1, '2025-11-25 15:55:42', '2025-11-25 15:55:42'),
(345, NULL, 'e5190245-5643-4515-a495-584ad9f97ea7', NULL, NULL, NULL, NULL, '$2b$10$L87OqV3/g8zqF4iK7e6D1.LlFaQcMGVEy08ZissUx4OMsUL/TyxtW', 3, 1, '2025-11-25 16:01:47', '2025-11-25 16:01:47'),
(346, NULL, '1c46d1db-9b51-4545-ae8e-d7c91125ed3a', NULL, NULL, NULL, NULL, '$2b$10$ES8d3JyApmhH8wKo3D9jVOODhRSo4Ho9yfbsfHAQgQqlcRkfkZP32', 3, 1, '2025-11-25 16:06:15', '2025-11-25 16:06:15'),
(347, NULL, 'a2bc169a-1d29-4a86-b381-9147b8809042', NULL, NULL, NULL, NULL, '$2b$10$RJt9Aq3PWFDABHklgd8TYebPUwn7Zl4JKlYMya.whhVFfS8t9VTu6', 3, 1, '2025-11-25 16:07:08', '2025-11-25 16:07:08'),
(348, NULL, '0e6c2f99-2bdd-47ac-bd10-0ee456c2581e', NULL, NULL, NULL, NULL, '$2b$10$aUny2/uoVPl4JiQF1vjKNO4mV78C2xznCB0b4CqGKF4GlSj0j3Gvu', 3, 1, '2025-11-25 16:15:18', '2025-11-25 16:15:18'),
(349, NULL, '666c4157-f25f-4aa5-bfbe-57df0286e254', NULL, NULL, NULL, NULL, '$2b$10$hHN3V1fNwFk3isLivFmvCep6C.Wjenl0xzF5UVs3kOv5S0tRR1keS', 3, 1, '2025-11-25 16:18:03', '2025-11-25 16:18:03'),
(350, NULL, 'adf6ed51-921b-4656-bcff-b6234498dcbd', NULL, NULL, NULL, NULL, '$2b$10$hyoVxgE275KCRAhcemKy8ecTM5xoM75zQT34prVhT7OOACgDEGcza', 3, 1, '2025-11-25 16:30:18', '2025-11-25 16:30:18'),
(351, NULL, '87598ee7-3565-4daa-bd8f-3654682b9018', NULL, NULL, NULL, NULL, '$2b$10$1fTbJamdC9ty1CSwxCsv2OIq3tjcwfxJ5jFbmDbg3vWGm.4e8RkbS', 3, 1, '2025-11-25 17:36:35', '2025-11-25 17:36:35'),
(352, NULL, '05928424-51c9-4e31-9935-7532fc554afa', NULL, NULL, NULL, NULL, '$2b$10$jaaiSD06FMcQBu0wjoaEQu8yz.puTfhTEo2lanIoNuX6E/FjqFLRS', 3, 1, '2025-11-25 17:40:48', '2025-11-25 17:40:48'),
(353, NULL, '1bdc6c4d-93e9-4f42-acf3-7b1c24a14cdf', NULL, NULL, NULL, NULL, '$2b$10$7Cb8Dupu9pgF7qTO25/7Nuan2fa9H2SHQ7m.4y1nlP/64EnTjlEWC', 3, 1, '2025-11-25 17:45:41', '2025-11-25 17:45:41'),
(354, NULL, '57abe501-a652-4d4d-8f10-e485ed7ee85f', NULL, NULL, NULL, NULL, '$2b$10$bxNZtQDEuw3c7PXFxPbsdOtfuXq77kr15qQ5UnOYwb6xFUgPUe0R6', 3, 1, '2025-11-25 17:47:03', '2025-11-25 17:47:03'),
(355, NULL, 'a377155b-e12a-44ec-8743-ca572b563006', NULL, NULL, NULL, NULL, '$2b$10$Zhc7GfFAvXjJNE/fepl.5eMl98Vd0VVpgeNRGsici9u.hEey8aUJC', 3, 1, '2025-11-25 17:51:25', '2025-11-25 17:51:25'),
(356, NULL, 'fc7b67aa-5e8c-4a05-8fe8-51d5c6414d56', NULL, NULL, NULL, NULL, '$2b$10$JvoVsLT9splDQCFEsENg4OC5rIyhSqNDN33v9nvz6n/N5oLSRSzCC', 3, 1, '2025-11-25 17:52:56', '2025-11-25 17:52:56'),
(357, NULL, 'e322a7a7-c2f0-4a5a-bd06-69829d6e78fd', NULL, NULL, NULL, NULL, '$2b$10$qd32EyeZY3lLsqyYkjxJfemSjPV6Iyy3N3e3Yu/60Hd2SYAX1hhmu', 3, 1, '2025-11-25 17:57:52', '2025-11-25 17:57:52'),
(358, NULL, 'f832b6e0-cf71-4911-86fa-90a5a0cac088', NULL, NULL, NULL, NULL, '$2b$10$APXM7YZUHtFkaFV8eL0gFOdcpOCK.QwlcI77exMi9WCo5qBdJ/UWO', 3, 1, '2025-11-25 17:59:54', '2025-11-25 17:59:54'),
(359, NULL, '188ca53a-0a0d-49f9-a33d-0c02175c6767', NULL, NULL, NULL, NULL, '$2b$10$.8AAMWV8lL/pj.CSE6jEvOmZ4S8wiFPc/vMGobE.9Bqn05ZofUc8i', 3, 1, '2025-11-25 18:02:14', '2025-11-25 18:02:14'),
(360, NULL, '4e2b8c2a-c676-4799-8812-13b5eaba64fc', NULL, NULL, NULL, NULL, '$2b$10$x3mNRv8azKsU7xY2IZlnL.H.iU9jl7eDNcsj53e2yN/bhWR2CpN5.', 3, 1, '2025-11-25 18:07:16', '2025-11-25 18:07:16'),
(361, NULL, 'c27ac844-5b8d-47e9-ab57-d8e6126cd1f8', NULL, NULL, NULL, NULL, '$2b$10$Ix1DINWBzBcAZ8wfbrigweOs/5ByrXSQeTeqUkEsHBAMz4h/2vcgO', 3, 1, '2025-12-07 19:24:02', '2025-12-07 19:24:02');

-- --------------------------------------------------------

--
-- Table structure for table `user_type`
--

CREATE TABLE `user_type` (
  `id` tinyint(4) NOT NULL,
  `user_type_ar` varchar(100) DEFAULT NULL,
  `user_type_en` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user_type`
--

INSERT INTO `user_type` (`id`, `user_type_ar`, `user_type_en`, `created_at`, `updated_at`) VALUES
(1, 'إدارة', 'admin', '2025-06-20 18:23:22', '2025-06-20 18:23:22'),
(2, 'مستخدم', 'user', '2025-06-20 18:23:47', '2025-06-20 18:23:47'),
(3, 'زائر', 'guest', '2025-07-03 18:49:14', '2025-07-03 18:49:14');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `password_reset_code`
--
ALTER TABLE `password_reset_code`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `status`
--
ALTER TABLE `status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `transaction`
--
ALTER TABLE `transaction`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD KEY `status_id` (`status_id`),
  ADD KEY `user_type_id` (`user_type_id`);

--
-- Indexes for table `user_type`
--
ALTER TABLE `user_type`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `password_reset_code`
--
ALTER TABLE `password_reset_code`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `status`
--
ALTER TABLE `status`
  MODIFY `id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `transaction`
--
ALTER TABLE `transaction`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1278;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=362;

--
-- AUTO_INCREMENT for table `user_type`
--
ALTER TABLE `user_type`
  MODIFY `id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `feedback`
--
ALTER TABLE `feedback`
  ADD CONSTRAINT `feedback_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`);

--
-- Constraints for table `password_reset_code`
--
ALTER TABLE `password_reset_code`
  ADD CONSTRAINT `password_reset_code_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`);

--
-- Constraints for table `transaction`
--
ALTER TABLE `transaction`
  ADD CONSTRAINT `transaction_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`);

--
-- Constraints for table `user`
--
ALTER TABLE `user`
  ADD CONSTRAINT `user_ibfk_1` FOREIGN KEY (`user_type_id`) REFERENCES `user_type` (`id`),
  ADD CONSTRAINT `user_ibfk_2` FOREIGN KEY (`status_id`) REFERENCES `status` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
